[
  {
    "source": { "id": null, "name": "NPR" },
    "author": "Ayana Archie",
    "title": "Arnold Schwarzenegger has endorsed Kamala Harris for president",
    "description": "Schwarzenegger served as the governor of California from 2003 to 2011. He said he is frustrated with both parties, and does not trust either, but felt compelled to speak out.",
    "url": "https://www.npr.org/2024/10/31/nx-s1-5173456/arnold-schwarzenegger-endorses-kamala-harris",
    "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6122x3444+0+74/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F49%2Fb7%2F6b8a70814557a30c419f1d6314f5%2Fap24261488922399.jpg",
    "publishedAt": "2024-10-31T06:15:15Z",
    "content": "Former Republican governor and actor Arnold Schwarzenegger has endorsed Democratic nominee Kamala Harris for president.\r\nIn a lengthy Wednesday post on X, Schwarzenegger said he does not typically gi… [+1789 chars]"
  },
  {
    "source": { "id": null, "name": "Pitchfork" },
    "author": "Jazz Monroe",
    "title": "The National, Remi Wolf, and More Perform at Kamala Harris Rally: Watch",
    "description": "Gracie Abrams also endorsed the Democratic presidential candidate amid a break from her opening slots on Taylor Swift’s Eras Tour",
    "url": "https://pitchfork.com/news/the-national-remi-wolf-perform-at-kamala-harris-rally-watch/",
    "urlToImage": "https://media.pitchfork.com/photos/67238bcba1c9b208e06de39f/16:9/w_1280,c_limit/Kamala-Harris.jpg",
    "publishedAt": "2024-10-31T13:56:33Z",
    "content": "The National, Remi Wolf, Gracie Abrams, and Mumford &amp; Sons performed and spoke at a Kamala Harris rally in Wisconsin last night. Represented by Matt Berninger and Aaron Dessner and introduced by … [+1530 chars]"
  },
  {
    "source": { "id": null, "name": "Rolling Stone" },
    "author": "Tim Chan",
    "title": "This Baseball Cap Celebrates the Dodgers’ Win (and Maybe a Kamala Harris Win Too)",
    "description": "The 'KamaLA' hat combines the VP's name with the Dodgers logo, making for a great pickup whether you're cheering for the team, the presidential candidate, or both",
    "url": "http://www.rollingstone.com/product-recommendations/lifestyle/kamala-harris-la-dodgers-hat-buy-online-1235149614/",
    "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2024/10/kamala-dodgers-hat.png?w=900&h=600&crop=1",
    "publishedAt": "2024-10-31T22:32:27Z",
    "content": "If you purchase an independently reviewed product or service through a link on our website, Rolling Stone may receive an affiliate commission.\r\nDodgers World Series merchhit the internet just hours a… [+2010 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "Cardi B To Join Kamala Harris At Milwaukee Rally",
    "description": "Cardi B will make remarks at a Milwaukee rally with Kamala Harris on Friday, as the vice president’s campaign makes its final get-out-the-vote push ahead of Nov. 5. The event will feature performances by Gorilla, Flo Milli, MC Late, The Isley Brothers and DJ …",
    "url": "http://deadline.com/2024/10/cardi-b-kamala-harris-rally-1236163350/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2021/11/Cardi-B.jpg?w=1024",
    "publishedAt": "2024-10-31T15:29:27Z",
    "content": "Cardi B will make remarks at a Milwaukee rally with Kamala Harris on Friday, as the vice president’s campaign makes its final get-out-the-vote push ahead of Nov. 5.\r\nThe event will feature performanc… [+1098 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "LeBron James Endorses Kamala Harris In 2024 Presidential Race: “Hate Takes Us Back”",
    "description": "NBA superstar LeBron James endorsed Kamala Harris for president, posting on Instagram that the “choice is clear” in the election. This afternoon, James posted a video of Donald Trump using extreme and violent rhetoric. The video also included a clip of comedi…",
    "url": "http://deadline.com/2024/10/lebron-james-endorses-kamala-harris-1236163862/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/08/GettyImages-2164650363.jpg?w=1024",
    "publishedAt": "2024-10-31T21:26:43Z",
    "content": "NBA superstar LeBron James endorsed Kamala Harris for president, posting on Instagram that the “choice is clear” in the election.\r\nThis afternoon, James posted a video of Donald Trump using extreme a… [+1110 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Armando Tinoco",
    "title": "‘The Avengers’ Reunite: Scarlett Johansson, Chris Evans & Robert Downey Jr. & More Marvel Stars Endorse Kamala Harris Against Donald Trump",
    "description": "Scarlett Johansson made a call and assembled The Avengers to defeat Donald Trump in the upcoming presidential election and vote for Kamala Harris. In a video shared by Mark Ruffalo, the Hulk in the Marvel Cinematic Universe, the actors expressed their support…",
    "url": "http://deadline.com/2024/10/the-avengers-reunion-scarlett-johansson-chris-evans-robert-downey-jr-marvel-stars-endorse-kamala-harris-donald-trump-1236163988/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/the-avengers-kamala-harris.jpg?w=1024",
    "publishedAt": "2024-10-31T23:25:44Z",
    "content": "Scarlett Johansson made a call and assembled The Avengers to defeat Donald Trump in the upcoming presidential election and vote for Kamala Harris.\r\nIn a video shared by Mark Ruffalo, the Hulk in the … [+1388 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "Donald Trump Tries To Command News Cycle With Lawsuit Against CBS Over Kamala Harris’ ’60 Minutes’ Interview",
    "description": "In the waning days of the presidential campaign, Donald Trump has sued CBS over the way that 60 Minutes edited an interview with Kamala Harris. The lawsuit, filed in U.S. District Court in Amarillo, TX, seeks $10 billion in damages and is just the latest liti…",
    "url": "http://deadline.com/2024/10/trump-cbs-lawsuit-60-minutes-kamala-harris-1236163916/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/kamala-harris-donald-trump.jpg?w=1024",
    "publishedAt": "2024-10-31T22:52:08Z",
    "content": "In the waning days of the presidential campaign, Donald Trump has sued CBS over the way that 60 Minutesedited an interview with Kamala Harris. \r\nThe lawsuit, filed in U.S. District Court in Amarillo,… [+4332 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Katie Campione",
    "title": "‘Grotesquerie’ Star Niecy Nash-Betts Unpacks Finale, Shares Hopes For Season 2 & Explains Why Lois Is “One And The Same” With VP Kamala Harris",
    "description": "SPOILER ALERT! This post contains details from the finale of FX’s Grotesquerie. It looks like Lois may never be making it to Florida after all. The finale of FX’s Grotesquerie felt, in some ways, like the 10 episodes came full circle, with Niecy Nash-Betts pu…",
    "url": "http://deadline.com/2024/10/grotesquerie-finale-recap-niecy-nash-betts-interview-season-2-hopes-1236162592/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/pre_3276ba8adae8177fe4770231cf1e599d.jpg?w=1000",
    "publishedAt": "2024-10-31T03:18:00Z",
    "content": "SPOILER ALERT! This post contains details from the finale of FX‘s Grotesquerie.\r\nIt looks like Lois may never be making it to Florida after all.\r\nThe finale of FX’s Grotesquerie felt, in some ways, l… [+9332 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Kristin Hunt, Forbes Staff, \n Kristin Hunt, Forbes Staff\n https://www.forbes.com/",
    "title": "Here Are The Billionaires Donating To Kamala Harris' Super PAC | Forbes Topline",
    "description": "After emphasizing bipartisanship and staying away from big political donations for decades, Bill Gates recently donated about $50 million to the nonprofit arm of a super PAC supporting Kamala Harris, the New York Times reported on Tuesday. He?s far from the o…",
    "url": "https://www.forbes.com/video/e09c6371-10c5-464b-ae9d-cabba410fbd6/here-are-the-billionaires-donating-to-kamala-harris-super-pac--forbes-topline/",
    "urlToImage": "https://imageio.forbes.com/i-forbesimg/media/video/2024/10/31/e09c6371-10c5-464b-ae9d-cabba410fbd6_thumb.jpg?format=jpg&height=460&width=800&fit=bounds",
    "publishedAt": "2024-10-31T19:20:18Z",
    "content": "After emphasizing bipartisanship and staying away from big political donations for decades, Bill Gates recently donated about $50 million to the nonprofit arm of a super PAC supporting Kamala Harris,… [+84 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "aol.com",
    "title": "Trump sues CBS over Kamala Harris interview",
    "description": "Republican presidential candidate Donald Trump sued CBS on Thursday over an interview of his Democratic rival Kamala Harris aired in early October that the lawsuit alleged was \"doctored\" and misleading, according to a court filing.\nThe filing was made in the …",
    "url": "https://biztoc.com/x/54b6115c0aea71db",
    "urlToImage": "https://biztoc.com/cdn/54b6115c0aea71db_s.webp",
    "publishedAt": "2024-10-31T21:13:34Z",
    "content": "Republican presidential candidate Donald Trump sued CBS on Thursday over an interview of his Democratic rival Kamala Harris aired in early October that the lawsuit alleged was \"doctored\" and misleadi… [+146 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Map Shows Kamala Harris and Donald Trump's Final Campaign Stops",
    "description": "In the final days leading up to the November 5 election, both Vice President Kamala Harris and former President Donald Trump are making critical campaign stops in battleground states, fighting for every last undecided voter.\nThere is a broad feeling of uncert…",
    "url": "https://biztoc.com/x/1f37336121d801d2",
    "urlToImage": "https://biztoc.com/cdn/1f37336121d801d2_s.webp",
    "publishedAt": "2024-10-31T17:59:15Z",
    "content": "In the final days leading up to the November 5 election, both Vice President Kamala Harris and former President Donald Trump are making critical campaign stops in battleground states, fighting for ev… [+139 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "How Mormons Could Be Kamala Harris' Secret Weapon in Arizona",
    "description": "Traditionally conservative members of the Church of Latter-day Saints in Arizona are being turned off from former President Donald Trump, in part because of his language around immigrants.\nWith around 400,000 Mormons in the battleground state — roughly 6 perc…",
    "url": "https://biztoc.com/x/ae996b832384dd6c",
    "urlToImage": "https://biztoc.com/cdn/ae996b832384dd6c_s.webp",
    "publishedAt": "2024-10-31T19:47:26Z",
    "content": "Traditionally conservative members of the Church of Latter-day Saints in Arizona are being turned off from former President Donald Trump, in part because of his language around immigrants.With around… [+141 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "JD Vance Trolls Kamala Harris With One of Her Favorite Lines",
    "description": "Ohio Senator JD Vance opened a town hall in North Carolina with a line parodying one of Vice President Kamala Harris' frequent remarks in public speeches.\n\"I grew up in a working-class family,\" the Republican vice presidential candidate began, pausing with a …",
    "url": "https://biztoc.com/x/3aebdb210384bbe4",
    "urlToImage": "https://biztoc.com/cdn/3aebdb210384bbe4_s.webp",
    "publishedAt": "2024-10-31T18:52:53Z",
    "content": "Ohio Senator JD Vance opened a town hall in North Carolina with a line parodying one of Vice President Kamala Harris' frequent remarks in public speeches.\"I grew up in a working-class family,\" the Re… [+145 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Will Taylor Swift Appear at Kamala Harris' Pennsylvania Rally? What We Know",
    "description": "Rumors are circulating on social media that Taylor Swift could appear at a rally that Vice President Kamala Harris is reportedly holding in Pennsylvania on the eve of Election Day.\nHarris will be holding a rally in front of the iconic Philadelphia Museum of A…",
    "url": "https://biztoc.com/x/b38e8d7820cd6318",
    "urlToImage": "https://biztoc.com/cdn/b38e8d7820cd6318_s.webp",
    "publishedAt": "2024-10-31T15:17:08Z",
    "content": "Rumors are circulating on social media that Taylor Swift could appear at a rally that Vice President Kamala Harris is reportedly holding in Pennsylvania on the eve of Election Day.Harris will be hold… [+134 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Kamala Harris Would Be Least Popular Democrat to Win Election in 64 Years",
    "description": "The vice president has also the highest unfavorable view by an opposing party.",
    "url": "https://biztoc.com/x/e64b19edefecdf49",
    "urlToImage": "https://biztoc.com/cdn/807/og.png",
    "publishedAt": "2024-10-31T19:47:10Z",
    "content": "The vice president has also the highest unfavorable view by an opposing party.\r\nThis story appeared on newsweek.com, 2024-10-31 19:36:34."
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "cnbc.com",
    "title": "Kamala Harris could make history as America’s first woman president: What do women think about it?",
    "description": "We're days away from what could be a historic election, in a highly unusual campaign season.\nAmerica could get its first female president in Kamala Harris, a late entrant to the race. But unlike in 2016, when Hillary Clinton was the Democratic nominee for the…",
    "url": "https://biztoc.com/x/d138730cb79deadc",
    "urlToImage": "https://biztoc.com/cdn/d138730cb79deadc_s.webp",
    "publishedAt": "2024-10-31T18:09:34Z",
    "content": "We're days away from what could be a historic election, in a highly unusual campaign season.America could get its first female president in Kamala Harris, a late entrant to the race. But unlike in 20… [+140 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Final Poll Flips to Donald Trump in Four-Point Swing From Kamala Harris",
    "description": "Donald Trump has overtaken Kamala Harris in the final DailyMail.com/J.L. Partners national poll before Election Day, with a three-point lead over the vice president.\nThe poll, released Thursday, showed Trump with 49 percent support among likely voters, while …",
    "url": "https://biztoc.com/x/fe71f71f2048055a",
    "urlToImage": "https://biztoc.com/cdn/fe71f71f2048055a_s.webp",
    "publishedAt": "2024-10-31T17:48:06Z",
    "content": "Donald Trump has overtaken Kamala Harris in the final DailyMail.com/J.L. Partners national poll before Election Day, with a three-point lead over the vice president.The poll, released Thursday, showe… [+139 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "today.yougov.com",
    "title": "Donald Trump leads on immigration and inflation, Kamala Harris on abortion and health care",
    "description": "A recent poll finds that Americans think Kamala Harris would do a far better job handling LGBTQ issues and abortion while Trump would do a much better job handling immigration and the Israeli-Palestinian conflict.",
    "url": "https://biztoc.com/x/22424739826aa8cb",
    "urlToImage": "https://biztoc.com/cdn/22424739826aa8cb_s.webp",
    "publishedAt": "2024-10-31T18:09:41Z",
    "content": "A recent poll finds that Americans think Kamala Harris would do a far better job handling LGBTQ issues and abortion while Trump would do a much better job handling immigration and the Israeli-Palesti… [+76 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "College Trump Voter Is Sad: Everyone On Campus Is Voting For Kamala Harris",
    "description": "Kamala Harris has a 31 point lead over Donald Trump in the youth vote of ages 18 to 29, and that translates when we see a college Trump supporter complaining to RSBN that her fellow students are all for Kamala Harris and the Democratic party in Green Bay WI.\n…",
    "url": "https://crooksandliars.com/2024/10/college-trump-voter-everyone-campus-voting",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55980.jpg",
    "publishedAt": "2024-10-31T14:59:38Z",
    "content": "Kamala Harris has a 31 point lead over Donald Trump in the youth vote of ages 18 to 29, and that translates when we see a college Trump supporter complaining to RSBN that her fellow students are all … [+1612 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "Disgraced Matt Schlapp Tries To Fit Kamala Harris In Pence's Suit",
    "description": "Matt's Schlapp, the disgraced CPAC leader who paid out with an insurance policy almost a half a million dollars to settle a sexual harassment lawsuit to a male staffer from the Herschel Walker campaign tells Newsmax he's worried that Kamala Harris will do wha…",
    "url": "https://crooksandliars.com/2024/10/disgraced-matt-schlapp-tries-fit-kamala",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55979.jpg",
    "publishedAt": "2024-10-31T15:34:24Z",
    "content": "Matt's Schlapp, the disgraced CPAC leader who paid out with an insurance policy almost a half a million dollars to settle a sexual harassment lawsuit to a male staffer from the Herschel Walker campai… [+2207 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "Kamala Harris Calls Out Trump For His Last-Minute Sexist BS",
    "description": "During a press event in Madison Wisconsin, Kamala Harris responded to Speaker Johnson announcing they would dismantle Obamacare if put in charge after Nov 5th, and also condemned Trump's horrific (yet utterly typical) words about women.\n\nHARRIS: The former Pr…",
    "url": "https://crooksandliars.com/2024/10/kamala-harris-trumps-comments-women",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55985.jpg",
    "publishedAt": "2024-10-31T16:19:23Z",
    "content": "During a press event in Madison Wisconsin, Kamala Harris responded to Speaker Johnson announcing they would dismantle Obamacare if put in charge after Nov 5th, and also condemned Trump's horrific (ye… [+1487 chars]"
  }
]
