[
  {
    "source": { "id": null, "name": "NPR" },
    "author": "Ayana Archie",
    "title": "Arnold Schwarzenegger has endorsed Kamala Harris for president",
    "description": "Schwarzenegger served as the governor of California from 2003 to 2011. He said he is frustrated with both parties, and does not trust either, but felt compelled to speak out.",
    "url": "https://www.npr.org/2024/10/31/nx-s1-5173456/arnold-schwarzenegger-endorses-kamala-harris",
    "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6122x3444+0+74/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F49%2Fb7%2F6b8a70814557a30c419f1d6314f5%2Fap24261488922399.jpg",
    "publishedAt": "2024-10-31T06:15:15Z",
    "content": "Former Republican governor and actor Arnold Schwarzenegger has endorsed Democratic nominee Kamala Harris for president.\r\nIn a lengthy Wednesday post on X, Schwarzenegger said he does not typically gi… [+1789 chars]"
  },
  {
    "source": { "id": null, "name": "Pitchfork" },
    "author": "Jazz Monroe",
    "title": "The National, Remi Wolf, and More Perform at Kamala Harris Rally: Watch",
    "description": "Gracie Abrams also endorsed the Democratic presidential candidate amid a break from her opening slots on Taylor Swift’s Eras Tour",
    "url": "https://pitchfork.com/news/the-national-remi-wolf-perform-at-kamala-harris-rally-watch/",
    "urlToImage": "https://media.pitchfork.com/photos/67238bcba1c9b208e06de39f/16:9/w_1280,c_limit/Kamala-Harris.jpg",
    "publishedAt": "2024-10-31T13:56:33Z",
    "content": "The National, Remi Wolf, Gracie Abrams, and Mumford &amp; Sons performed and spoke at a Kamala Harris rally in Wisconsin last night. Represented by Matt Berninger and Aaron Dessner and introduced by … [+1530 chars]"
  },
  {
    "source": { "id": null, "name": "Rolling Stone" },
    "author": "Tim Chan",
    "title": "This Baseball Cap Celebrates the Dodgers’ Win (and Maybe a Kamala Harris Win Too)",
    "description": "The 'KamaLA' hat combines the VP's name with the Dodgers logo, making for a great pickup whether you're cheering for the team, the presidential candidate, or both",
    "url": "http://www.rollingstone.com/product-recommendations/lifestyle/kamala-harris-la-dodgers-hat-buy-online-1235149614/",
    "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2024/10/kamala-dodgers-hat.png?w=900&h=600&crop=1",
    "publishedAt": "2024-10-31T22:32:27Z",
    "content": "If you purchase an independently reviewed product or service through a link on our website, Rolling Stone may receive an affiliate commission.\r\nDodgers World Series merchhit the internet just hours a… [+2010 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "Cardi B To Join Kamala Harris At Milwaukee Rally",
    "description": "Cardi B will make remarks at a Milwaukee rally with Kamala Harris on Friday, as the vice president’s campaign makes its final get-out-the-vote push ahead of Nov. 5. The event will feature performances by Gorilla, Flo Milli, MC Late, The Isley Brothers and DJ …",
    "url": "http://deadline.com/2024/10/cardi-b-kamala-harris-rally-1236163350/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2021/11/Cardi-B.jpg?w=1024",
    "publishedAt": "2024-10-31T15:29:27Z",
    "content": "Cardi B will make remarks at a Milwaukee rally with Kamala Harris on Friday, as the vice president’s campaign makes its final get-out-the-vote push ahead of Nov. 5.\r\nThe event will feature performanc… [+1098 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "LeBron James Endorses Kamala Harris In 2024 Presidential Race: “Hate Takes Us Back”",
    "description": "NBA superstar LeBron James endorsed Kamala Harris for president, posting on Instagram that the “choice is clear” in the election. This afternoon, James posted a video of Donald Trump using extreme and violent rhetoric. The video also included a clip of comedi…",
    "url": "http://deadline.com/2024/10/lebron-james-endorses-kamala-harris-1236163862/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/08/GettyImages-2164650363.jpg?w=1024",
    "publishedAt": "2024-10-31T21:26:43Z",
    "content": "NBA superstar LeBron James endorsed Kamala Harris for president, posting on Instagram that the “choice is clear” in the election.\r\nThis afternoon, James posted a video of Donald Trump using extreme a… [+1110 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Armando Tinoco",
    "title": "‘The Avengers’ Reunite: Scarlett Johansson, Chris Evans & Robert Downey Jr. & More Marvel Stars Endorse Kamala Harris Against Donald Trump",
    "description": "Scarlett Johansson made a call and assembled The Avengers to defeat Donald Trump in the upcoming presidential election and vote for Kamala Harris. In a video shared by Mark Ruffalo, the Hulk in the Marvel Cinematic Universe, the actors expressed their support…",
    "url": "http://deadline.com/2024/10/the-avengers-reunion-scarlett-johansson-chris-evans-robert-downey-jr-marvel-stars-endorse-kamala-harris-donald-trump-1236163988/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/the-avengers-kamala-harris.jpg?w=1024",
    "publishedAt": "2024-10-31T23:25:44Z",
    "content": "Scarlett Johansson made a call and assembled The Avengers to defeat Donald Trump in the upcoming presidential election and vote for Kamala Harris.\r\nIn a video shared by Mark Ruffalo, the Hulk in the … [+1388 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "Donald Trump Tries To Command News Cycle With Lawsuit Against CBS Over Kamala Harris’ ’60 Minutes’ Interview",
    "description": "In the waning days of the presidential campaign, Donald Trump has sued CBS over the way that 60 Minutes edited an interview with Kamala Harris. The lawsuit, filed in U.S. District Court in Amarillo, TX, seeks $10 billion in damages and is just the latest liti…",
    "url": "http://deadline.com/2024/10/trump-cbs-lawsuit-60-minutes-kamala-harris-1236163916/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/kamala-harris-donald-trump.jpg?w=1024",
    "publishedAt": "2024-10-31T22:52:08Z",
    "content": "In the waning days of the presidential campaign, Donald Trump has sued CBS over the way that 60 Minutesedited an interview with Kamala Harris. \r\nThe lawsuit, filed in U.S. District Court in Amarillo,… [+4332 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Katie Campione",
    "title": "‘Grotesquerie’ Star Niecy Nash-Betts Unpacks Finale, Shares Hopes For Season 2 & Explains Why Lois Is “One And The Same” With VP Kamala Harris",
    "description": "SPOILER ALERT! This post contains details from the finale of FX’s Grotesquerie. It looks like Lois may never be making it to Florida after all. The finale of FX’s Grotesquerie felt, in some ways, like the 10 episodes came full circle, with Niecy Nash-Betts pu…",
    "url": "http://deadline.com/2024/10/grotesquerie-finale-recap-niecy-nash-betts-interview-season-2-hopes-1236162592/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/pre_3276ba8adae8177fe4770231cf1e599d.jpg?w=1000",
    "publishedAt": "2024-10-31T03:18:00Z",
    "content": "SPOILER ALERT! This post contains details from the finale of FX‘s Grotesquerie.\r\nIt looks like Lois may never be making it to Florida after all.\r\nThe finale of FX’s Grotesquerie felt, in some ways, l… [+9332 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Kristin Hunt, Forbes Staff, \n Kristin Hunt, Forbes Staff\n https://www.forbes.com/",
    "title": "Here Are The Billionaires Donating To Kamala Harris' Super PAC | Forbes Topline",
    "description": "After emphasizing bipartisanship and staying away from big political donations for decades, Bill Gates recently donated about $50 million to the nonprofit arm of a super PAC supporting Kamala Harris, the New York Times reported on Tuesday. He?s far from the o…",
    "url": "https://www.forbes.com/video/e09c6371-10c5-464b-ae9d-cabba410fbd6/here-are-the-billionaires-donating-to-kamala-harris-super-pac--forbes-topline/",
    "urlToImage": "https://imageio.forbes.com/i-forbesimg/media/video/2024/10/31/e09c6371-10c5-464b-ae9d-cabba410fbd6_thumb.jpg?format=jpg&height=460&width=800&fit=bounds",
    "publishedAt": "2024-10-31T19:20:18Z",
    "content": "After emphasizing bipartisanship and staying away from big political donations for decades, Bill Gates recently donated about $50 million to the nonprofit arm of a super PAC supporting Kamala Harris,… [+84 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "aol.com",
    "title": "Trump sues CBS over Kamala Harris interview",
    "description": "Republican presidential candidate Donald Trump sued CBS on Thursday over an interview of his Democratic rival Kamala Harris aired in early October that the lawsuit alleged was \"doctored\" and misleading, according to a court filing.\nThe filing was made in the …",
    "url": "https://biztoc.com/x/54b6115c0aea71db",
    "urlToImage": "https://biztoc.com/cdn/54b6115c0aea71db_s.webp",
    "publishedAt": "2024-10-31T21:13:34Z",
    "content": "Republican presidential candidate Donald Trump sued CBS on Thursday over an interview of his Democratic rival Kamala Harris aired in early October that the lawsuit alleged was \"doctored\" and misleadi… [+146 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Map Shows Kamala Harris and Donald Trump's Final Campaign Stops",
    "description": "In the final days leading up to the November 5 election, both Vice President Kamala Harris and former President Donald Trump are making critical campaign stops in battleground states, fighting for every last undecided voter.\nThere is a broad feeling of uncert…",
    "url": "https://biztoc.com/x/1f37336121d801d2",
    "urlToImage": "https://biztoc.com/cdn/1f37336121d801d2_s.webp",
    "publishedAt": "2024-10-31T17:59:15Z",
    "content": "In the final days leading up to the November 5 election, both Vice President Kamala Harris and former President Donald Trump are making critical campaign stops in battleground states, fighting for ev… [+139 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "How Mormons Could Be Kamala Harris' Secret Weapon in Arizona",
    "description": "Traditionally conservative members of the Church of Latter-day Saints in Arizona are being turned off from former President Donald Trump, in part because of his language around immigrants.\nWith around 400,000 Mormons in the battleground state — roughly 6 perc…",
    "url": "https://biztoc.com/x/ae996b832384dd6c",
    "urlToImage": "https://biztoc.com/cdn/ae996b832384dd6c_s.webp",
    "publishedAt": "2024-10-31T19:47:26Z",
    "content": "Traditionally conservative members of the Church of Latter-day Saints in Arizona are being turned off from former President Donald Trump, in part because of his language around immigrants.With around… [+141 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "JD Vance Trolls Kamala Harris With One of Her Favorite Lines",
    "description": "Ohio Senator JD Vance opened a town hall in North Carolina with a line parodying one of Vice President Kamala Harris' frequent remarks in public speeches.\n\"I grew up in a working-class family,\" the Republican vice presidential candidate began, pausing with a …",
    "url": "https://biztoc.com/x/3aebdb210384bbe4",
    "urlToImage": "https://biztoc.com/cdn/3aebdb210384bbe4_s.webp",
    "publishedAt": "2024-10-31T18:52:53Z",
    "content": "Ohio Senator JD Vance opened a town hall in North Carolina with a line parodying one of Vice President Kamala Harris' frequent remarks in public speeches.\"I grew up in a working-class family,\" the Re… [+145 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Will Taylor Swift Appear at Kamala Harris' Pennsylvania Rally? What We Know",
    "description": "Rumors are circulating on social media that Taylor Swift could appear at a rally that Vice President Kamala Harris is reportedly holding in Pennsylvania on the eve of Election Day.\nHarris will be holding a rally in front of the iconic Philadelphia Museum of A…",
    "url": "https://biztoc.com/x/b38e8d7820cd6318",
    "urlToImage": "https://biztoc.com/cdn/b38e8d7820cd6318_s.webp",
    "publishedAt": "2024-10-31T15:17:08Z",
    "content": "Rumors are circulating on social media that Taylor Swift could appear at a rally that Vice President Kamala Harris is reportedly holding in Pennsylvania on the eve of Election Day.Harris will be hold… [+134 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Kamala Harris Would Be Least Popular Democrat to Win Election in 64 Years",
    "description": "The vice president has also the highest unfavorable view by an opposing party.",
    "url": "https://biztoc.com/x/e64b19edefecdf49",
    "urlToImage": "https://biztoc.com/cdn/807/og.png",
    "publishedAt": "2024-10-31T19:47:10Z",
    "content": "The vice president has also the highest unfavorable view by an opposing party.\r\nThis story appeared on newsweek.com, 2024-10-31 19:36:34."
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "cnbc.com",
    "title": "Kamala Harris could make history as America’s first woman president: What do women think about it?",
    "description": "We're days away from what could be a historic election, in a highly unusual campaign season.\nAmerica could get its first female president in Kamala Harris, a late entrant to the race. But unlike in 2016, when Hillary Clinton was the Democratic nominee for the…",
    "url": "https://biztoc.com/x/d138730cb79deadc",
    "urlToImage": "https://biztoc.com/cdn/d138730cb79deadc_s.webp",
    "publishedAt": "2024-10-31T18:09:34Z",
    "content": "We're days away from what could be a historic election, in a highly unusual campaign season.America could get its first female president in Kamala Harris, a late entrant to the race. But unlike in 20… [+140 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Final Poll Flips to Donald Trump in Four-Point Swing From Kamala Harris",
    "description": "Donald Trump has overtaken Kamala Harris in the final DailyMail.com/J.L. Partners national poll before Election Day, with a three-point lead over the vice president.\nThe poll, released Thursday, showed Trump with 49 percent support among likely voters, while …",
    "url": "https://biztoc.com/x/fe71f71f2048055a",
    "urlToImage": "https://biztoc.com/cdn/fe71f71f2048055a_s.webp",
    "publishedAt": "2024-10-31T17:48:06Z",
    "content": "Donald Trump has overtaken Kamala Harris in the final DailyMail.com/J.L. Partners national poll before Election Day, with a three-point lead over the vice president.The poll, released Thursday, showe… [+139 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "today.yougov.com",
    "title": "Donald Trump leads on immigration and inflation, Kamala Harris on abortion and health care",
    "description": "A recent poll finds that Americans think Kamala Harris would do a far better job handling LGBTQ issues and abortion while Trump would do a much better job handling immigration and the Israeli-Palestinian conflict.",
    "url": "https://biztoc.com/x/22424739826aa8cb",
    "urlToImage": "https://biztoc.com/cdn/22424739826aa8cb_s.webp",
    "publishedAt": "2024-10-31T18:09:41Z",
    "content": "A recent poll finds that Americans think Kamala Harris would do a far better job handling LGBTQ issues and abortion while Trump would do a much better job handling immigration and the Israeli-Palesti… [+76 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "College Trump Voter Is Sad: Everyone On Campus Is Voting For Kamala Harris",
    "description": "Kamala Harris has a 31 point lead over Donald Trump in the youth vote of ages 18 to 29, and that translates when we see a college Trump supporter complaining to RSBN that her fellow students are all for Kamala Harris and the Democratic party in Green Bay WI.\n…",
    "url": "https://crooksandliars.com/2024/10/college-trump-voter-everyone-campus-voting",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55980.jpg",
    "publishedAt": "2024-10-31T14:59:38Z",
    "content": "Kamala Harris has a 31 point lead over Donald Trump in the youth vote of ages 18 to 29, and that translates when we see a college Trump supporter complaining to RSBN that her fellow students are all … [+1612 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "Disgraced Matt Schlapp Tries To Fit Kamala Harris In Pence's Suit",
    "description": "Matt's Schlapp, the disgraced CPAC leader who paid out with an insurance policy almost a half a million dollars to settle a sexual harassment lawsuit to a male staffer from the Herschel Walker campaign tells Newsmax he's worried that Kamala Harris will do wha…",
    "url": "https://crooksandliars.com/2024/10/disgraced-matt-schlapp-tries-fit-kamala",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55979.jpg",
    "publishedAt": "2024-10-31T15:34:24Z",
    "content": "Matt's Schlapp, the disgraced CPAC leader who paid out with an insurance policy almost a half a million dollars to settle a sexual harassment lawsuit to a male staffer from the Herschel Walker campai… [+2207 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "Kamala Harris Calls Out Trump For His Last-Minute Sexist BS",
    "description": "During a press event in Madison Wisconsin, Kamala Harris responded to Speaker Johnson announcing they would dismantle Obamacare if put in charge after Nov 5th, and also condemned Trump's horrific (yet utterly typical) words about women.\n\nHARRIS: The former Pr…",
    "url": "https://crooksandliars.com/2024/10/kamala-harris-trumps-comments-women",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55985.jpg",
    "publishedAt": "2024-10-31T16:19:23Z",
    "content": "During a press event in Madison Wisconsin, Kamala Harris responded to Speaker Johnson announcing they would dismantle Obamacare if put in charge after Nov 5th, and also condemned Trump's horrific (ye… [+1487 chars]"
  },
  {
    "source": { "id": null, "name": "Vanity Fair" },
    "author": "Bess Levin",
    "title": "Fox News Host Says He’d Divorce His Wife for Voting for Kamala Harris",
    "description": "“If I found out Emma was going into the voting booth and pulling the lever for Harris, that’s the same thing as having an affair.”",
    "url": "https://www.vanityfair.com/news/story/fox-news-host-says-hed-divorce-his-wife-for-voting-for-kamala-harris",
    "urlToImage": "https://media.vanityfair.com/photos/6723de8a801c5f5bf63037a9/16:9/w_1280,c_limit/1552264944",
    "publishedAt": "2024-10-31T19:49:39Z",
    "content": "How much respect do Donald Trumps male supporters have for women? So much that at least one of them has said hed end his marriage if his wife exercised her constitutional right to vote for Kamala Har… [+1452 chars]"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Kamala Harris reacts to Trump saying he'll protect women \"whether the women like it or not\"",
    "description": "Vice President Kamala Harris spoke to reporters in Wisconsin Thursday about former President Donald Trump's comments that he would protect women \"whether the women like it or not.\" Harris said the remark speaks to how Trump thinks about women and their agency…",
    "url": "https://www.cbsnews.com/video/kamala-harris-speaks-to-reporters-with-5-days-left-before-election-day/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/31/753f67ab-1135-4aa2-99fa-95bf1c6d368e/thumbnail/1200x630/5809ad6e04b1e20efd558e9e5043ccaf/cbsn-fusion-kamala-harris-speaks-to-reporters-with-5-days-left-before-election-day-thumbnail.jpg?v=da20036415aedcaca28a32ffe615549e",
    "publishedAt": "2024-10-31T17:48:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Kamala Harris pledges to be president for all Americans after Biden's \"garbage\" gaffe",
    "description": "Vice President Kamala Harris has promised to be a president for all and \"put country above party\" in the wake of President Biden's controversial \"garbage\" comment. CBS News campaign reporter Nidia Cavazos has more on Harris' campaign.",
    "url": "https://www.cbsnews.com/video/kamala-harris-pledges-to-be-president-for-all-americans-after-bidens-garbage-gaffe/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/31/6f155420-7bbc-4aa8-a478-3db9681e5301/thumbnail/1200x630/92201397e1638a814ca64d88c1ce26f1/cbsn-fusion-kamala-harris-pledges-to-be-president-for-all-americans-after-bidens-garbage-gaffe-thumbnail.jpg?v=da20036415aedcaca28a32ffe615549e",
    "publishedAt": "2024-10-31T15:06:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "Carrie Sheffield",
    "title": "Desperate, Elitist Kamala Harris Is Hillary Clinton 2.0",
    "description": "Vice President Kamala Harris’ weak response to President Joe Biden’s calling Donald Trump supporters “garbage” matches her hyperbolic, incendiary claims that Trump is a “fascist”... Read More\nThe post Desperate, Elitist Kamala Harris Is Hillary Clinton 2.0 ap…",
    "url": "https://www.dailysignal.com/2024/10/31/desperate-elitist-kamala-harris-is-hillary-clinton-2-0/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/241031_KamalaHillary_Sheffield.jpg",
    "publishedAt": "2024-10-31T17:03:59Z",
    "content": "Vice President Kamala Harris weak response to President Joe Bidens calling Donald Trump supporters garbage matches her hyperbolic, incendiary claims that Trump is a fascist who relies on the tactics … [+4305 chars]"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "Terence Jeffrey",
    "title": "What Kamala Harris and Henry VIII Have in Common",
    "description": "Vice President Kamala Harris and the 16th-century British monarch Henry VIII share at least one trait in common: The belief that the government can force... Read More\nThe post What Kamala Harris and Henry VIII Have in Common appeared first on The Daily Signal.",
    "url": "https://www.dailysignal.com/2024/10/31/what-kamala-harris-and-henry-viii-have-in-common/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/GettyImages-2181638827.jpg",
    "publishedAt": "2024-10-31T20:41:56Z",
    "content": "Vice President Kamala Harris and the 16th-century British monarch Henry VIII share at least one trait in common: The belief that the government can force an individual to act against his conscience a… [+5283 chars]"
  },
  {
    "source": { "id": null, "name": "The Hollywood Gossip" },
    "author": "Simon Delott",
    "title": "Saint West Posts Gross Anti Kamala Harris Meme: Did Kim Kardashian Delete His YouTube …",
    "description": "What does 8-year-old Saint West think of Vice President Kamala Harris? Not much, it seems. Not according to a fairly …\nSaint West Posts Gross Anti Kamala Harris Meme: Did Kim Kardashian Delete His YouTube … was originally published on The Hollywood Gossip.",
    "url": "http://www.thehollywoodgossip.com/2024/10/saint-west-kamala-harris-meme-youtube/",
    "urlToImage": "https://cdn.thehollywoodgossip.com/uploads/2024/10/1031_saintwest_header.jpg",
    "publishedAt": "2024-10-31T20:01:54Z",
    "content": "What does 8-year-old Saint West think of Vice President Kamala Harris?\r\nNot much, it seems. Not according to a fairly disgusting meme that was posted to his YouTube.\r\nAnd if you want to see the polit… [+4253 chars]"
  },
  {
    "source": { "id": null, "name": "Yahoo Entertainment" },
    "author": "Yahoo Sports",
    "title": "LeBron James endorses Kamala Harris for president with video blasting Donald Trump's past comments on race",
    "description": "LeBron James and Donald Trump have clashed repeatedly over the past decade.",
    "url": "https://sports.yahoo.com/lebron-james-endorses-kamala-harris-for-president-with-video-blasting-donald-trumps-past-comments-on-race-234721214.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/zShfVQUVafFrtwBaNZp_mA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05Mzc-/https://s.yimg.com/os/creatr-uploaded-images/2024-10/5a6c56a0-97e1-11ef-bfc9-175a9df82c37",
    "publishedAt": "2024-10-31T23:47:21Z",
    "content": "In case there was any confusion on where LeBron James stands in the 2024 presidential election, he made his views very clear on Thursday.\r\nThe Los Angeles Lakers star posted a video on social media o… [+2572 chars]"
  },
  {
    "source": { "id": null, "name": "Yahoo Entertainment" },
    "author": "Yahoo Sports",
    "title": "LeBron James endorses Kamala Harris for president: ‘The choice is clear’",
    "description": "LeBron James and Donald Trump have clashed repeatedly over the past decade.",
    "url": "https://sports.yahoo.com/lebron-james-endorses-kamala-harris-for-president-the-choice-is-clear-234721916.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/zShfVQUVafFrtwBaNZp_mA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05Mzc-/https://s.yimg.com/os/creatr-uploaded-images/2024-10/5a6c56a0-97e1-11ef-bfc9-175a9df82c37",
    "publishedAt": "2024-10-31T23:47:21Z",
    "content": "In case there was any confusion on where LeBron James stands in the 2024 presidential election, he made his views very clear on Thursday.\r\nThe Los Angeles Lakers star posted a video on social media o… [+2376 chars]"
  },
  {
    "source": { "id": null, "name": "NPR" },
    "author": "Tamara Keith",
    "title": "Volunteers, including friends of Kamala Harris, are knocking on doors in Wisconsin",
    "description": "A group of Vice President Kamala Harris' oldest friends from California are in Madison, Wis. -- going door-to-door to get out the vote for Harris.",
    "url": "https://www.npr.org/2024/10/31/nx-s1-5171450/volunteers-including-friends-of-kamala-harris-are-knocking-on-doors-in-wisconsin",
    "urlToImage": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "publishedAt": "2024-10-31T08:04:53Z",
    "content": "A group of Vice President Kamala Harris' oldest friends from California are in Madison, Wis. — going door-to-door to get out the vote for Harris."
  },
  {
    "source": { "id": null, "name": "FactCheck.org" },
    "author": "Eugene Kiely",
    "title": "Kamala Harris’ Closing Arguments",
    "description": "In the closing weeks of the campaign, Vice President Kamala Harris has portrayed former President Donald Trump as a danger to democracy. She also has warned he will enact policies that will hurt blue-collar workers, women, seniors, and the nation's health car…",
    "url": "https://www.factcheck.org/2024/10/kamala-harris-closing-arguments/",
    "urlToImage": "https://cdn.factcheck.org/UploadedFiles/getty-harris-slider.jpg",
    "publishedAt": "2024-10-31T22:03:07Z",
    "content": "Este artículo estará disponible en español en El Tiempo Latino.\r\nIn the closing weeks of the campaign, Vice President Kamala Harris has portrayed former President Donald Trump as a danger to democrac… [+25369 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Joel B. Pollak, Joel B. Pollak",
    "title": "Report: Kamala Harris Campaign Pays Radical Groups for GOTV Effort",
    "description": "The Kamala Harris campaign has paid large sums of money to radical groups for their help with the Democrats' \"get out the vote\" (GOTV) effort, according to a report by Fox News, citing Federal Elections Commission disclosures.\nThe post Report: Kamala Harris C…",
    "url": "https://www.breitbart.com/politics/2024/10/30/report-kamala-harris-campaign-pays-radical-groups-for-gotv-effort/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/Al-Sharpton-and-Kamala-Harris-Associated-Press-640x335.jpg",
    "publishedAt": "2024-10-31T05:46:57Z",
    "content": "The Kamala Harris campaign has paid large sums of money to radical groups for their help with the Democrats’ “get out the vote” (GOTV) effort, according to a report by Fox News, citing Federal Electi… [+1766 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Neil Munro, Neil Munro",
    "title": "Kamala Harris Offers Legal Weed to Win Younger Male Voters",
    "description": "Kamala Harris and her running mate are dangling weed in front of young Americans in exchange for their votes, and their allies in the porn industry are urging young men to vote against President Donald Trump.\nThe post Kamala Harris Offers Legal Weed to Win Yo…",
    "url": "https://www.breitbart.com/2024-election/2024/10/31/kamala-harris-dangles-legal-weed-to-get-younger-male-voters/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/GettyImages-1241688779-640x335.jpg",
    "publishedAt": "2024-10-31T22:28:16Z",
    "content": "Vice President Kamala Harris and her running mate are dangling weed in front of young Americans in exchange for their votes, and their political allies in the porn industry are urging young men to st… [+6964 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Elizabeth Weibel, Elizabeth Weibel",
    "title": "Pennsylvania News Station 'Mistakenly' Shows Election 'Test Results' of Kamala Harris Winning",
    "description": "During a Formula 1 race, a Pennsylvania news station showed election \"test results\" of Vice President Kamala Harris winning the state.\nThe post Pennsylvania News Station ‘Mistakenly’ Shows Election ‘Test Results’ of Kamala Harris Winning appeared first on Bre…",
    "url": "https://www.breitbart.com/politics/2024/10/30/pennsylvania-news-station-shows-election-test-results-kamala-harris-winning/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/kamala-harris-smile-shrug-oct-10-2024-ap-640x335.jpg",
    "publishedAt": "2024-10-31T00:23:44Z",
    "content": "During a Formula 1 race, a Pennsylvania news station showed election “test results” of Vice President Kamala Harris winning the state.\r\nWNEP, a Scranton/Wilkes-Barre-based television news station, ex… [+2915 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Simon Kent, Simon Kent",
    "title": "Kim Kardashian and Kanye West’s 8-Year-Old Son Calls Kamala Harris ‘Dumb’ in YouTube Videos",
    "description": "Reality TV megastar Kim Kardashian struck down a YouTube channel belonging to her eldest son with Kanye West after two posts critical of Vice President Kamala Harris reportedly appeared on the account.\nThe post Kim Kardashian and Kanye West’s 8-Year-Old Son C…",
    "url": "https://www.breitbart.com/entertainment/2024/10/31/kim-kardashian-and-kanye-wests-8-year-old-son-calls-kamala-harris-dumb-in-youtube-videos/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/Kim-Kardashian-and-Saint-640x335.jpg",
    "publishedAt": "2024-10-31T13:00:42Z",
    "content": "Reality TV megastar Kim Kardashian struck down a YouTube channel belonging to her eldest son with Kanye West after two posts critical of Vice President Kamala Harris reportedly appeared on the accoun… [+1535 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "John Binder, John Binder",
    "title": "JD Vance Calls Out Kamala Harris for 'Mass Amnesty Bill' to Legalize Illegal Immigration",
    "description": "Sen. JD Vance (R-OH) is calling out legislation promoted by Vice President Kamala Harris on the campaign trail that he says is a \"mass amnesty bill\" to effectively legalize illegal immigration to the United States.\nThe post JD Vance Calls Out Kamala Harris fo…",
    "url": "https://www.breitbart.com/politics/2024/10/31/jd-vance-calls-out-kamala-harris-for-mass-amnesty-bill-to-legalize-illegal-immigration/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/GettyImages-2181619388-640x335.jpg",
    "publishedAt": "2024-10-31T23:04:17Z",
    "content": "Sen. JD Vance (R-OH) is calling out legislation promoted by Vice President Kamala Harris on the campaign trail that he says is a “mass amnesty bill” to effectively legalize illegal immigration to the… [+3008 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Wendell Husebø, Wendell Husebø",
    "title": "Kamala Harris Twists Trump Quote About Protecting Women: Will Control Their Bodies 'Whether They Like It or Not'",
    "description": "Vice President Kamala Harris accused former President Donald Trump wanting to “control” women's bodies “whether they like it or not.”\nThe post Kamala Harris Twists Trump Quote About Protecting Women: Will Control Their Bodies ‘Whether They Like It or Not’ app…",
    "url": "https://www.breitbart.com/2024-election/2024/10/31/kamala-harris-twists-trump-quote-about-protecting-women-will-control-their-bodies-whether-they-like-it-or-not/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/GettyImages-2181349491-640x335.jpg",
    "publishedAt": "2024-10-31T20:19:27Z",
    "content": "Vice President Kamala Harris accused former President Donald Trump of wanting to control women’s bodies whether they like it or not.\r\nHarris’s smear is seemingly designed to distract from President J… [+1112 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Alana Mastrangelo, Alana Mastrangelo",
    "title": "Watch -- JD Vance at Turning Point Action Gen-Z Town Hall: 'You Have More to Lose than Anybody' If Kamala Harris Wins",
    "description": "Sen. JD Vance warned students at a Gen-Z town hall that they \"have more to lose than anybody\" if Vice President Kamala Harris wins the 2024 election.\nThe post Watch — JD Vance at Turning Point Action Gen-Z Town Hall: ‘You Have More to Lose than Anybody’ If Ka…",
    "url": "https://www.breitbart.com/politics/2024/10/31/watch-jd-vance-turning-point-action-gen-z-town-hall-you-have-more-lose-than-anybody-if-kamala-harris-wins/",
    "urlToImage": "https://media.breitbart.com/media/2024/08/JD-Vance-1-640x335.jpg",
    "publishedAt": "2024-10-31T22:23:30Z",
    "content": "Sen. JD Vance (R-OH) sat down with Turning Point Action for a Gen-Z town hall in High Point, North Carolina, on Thursday, where he warned students that they “have more to lose than anybody” if Vice P… [+3759 chars]"
  },
  {
    "source": { "id": null, "name": "Livejournal.com" },
    "author": "syvlie0o0",
    "title": "Kim and Kanye's 8-year-old song posts anti-Kamala Harris meme on Youtube",
    "description": "The channel mysteriously disappeared, leaving many to believe Kim Kardashian saw the posts and shut it down.https://t.co/YGlEPIxOP4\r\n— The Daily Beast (@thedailybeast) October 30, 2024 -Kim and Kanye's 8-year-old son, Saint West, has his own Youtube channel f…",
    "url": "https://ohnotheydidnt.livejournal.com/129474075.html",
    "urlToImage": "https://l-files.livejournal.net/og_image/3616053/505758?v=1730410317",
    "publishedAt": "2024-10-31T21:31:53Z",
    "content": "The channel mysteriously disappeared, leaving many to believe Kim Kardashian saw the posts and shut it down.https://t.co/YGlEPIxOP4\r\n— The Daily Beast (@thedailybeast) October 30, 2024\r\n-Kim and Kany… [+397 chars]"
  },
  {
    "source": { "id": null, "name": "Naturalnews.com" },
    "author": "Laura Harris",
    "title": "Constitution Party presidential candidate launches ads to steer votes away from infanticidal Kamala Harris",
    "description": "Pro-life activist and third party presidential candidate Randall Terry has released a series of ads urging supporters of Vice President and Democratic presidential candidate Kamala Harris to reconsider their support due to her pro-abortion policies. Terry, th…",
    "url": "https://www.naturalnews.com/2024-10-31-constitution-party-presidential-candidate-anti-abortion-ads.html",
    "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2024/11/Fetus-Abortion-Life-Hands-Care.jpg",
    "publishedAt": "2024-10-31T06:00:00Z",
    "content": "Pro-life activist and third party presidential candidate Randall Terry has released a series of ads urging supporters of Vice President and Democratic presidential candidate Kamala Harris to reconsid… [+4617 chars]"
  },
  {
    "source": { "id": null, "name": "The Daily Caller" },
    "author": "Leena Nasir",
    "title": "Kim Kardashian Reportedly Silences Her Son After He Trashes Kamala Harris On Social Media",
    "description": "Kim Kardashian reportedly deleted her son's YouTube account after he used the platform to publicly trash Kamala Harris.",
    "url": "https://dailycaller.com/2024/10/31/kim-kardashian-saint-west-youtube-kamala-harris-donald-trump-social-media/",
    "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2024/10/GettyImages-2179690648-e1730410062110.jpg",
    "publishedAt": "2024-10-31T21:42:39Z",
    "content": "Readers,\r\nInstead of sucking up to the political and corporate powers that dominate America, The Daily Caller is fighting for you our readers. We humbly ask you to consider joining us in this fight.\r… [+3565 chars]"
  },
  {
    "source": { "id": null, "name": "Wonkette.com" },
    "author": "Wonkette",
    "title": "LIVE: Trick Or Treat Or One Million Kamala Harris Rallies!",
    "description": "It’s Halloween so it was a bit of a slow news day and a slow day around here, but hey, the universe wants us to have a slow day every now and then, especially when everything is AAAAAAAAAAGLABLARCH.",
    "url": "https://www.wonkette.com/p/live-trick-or-treat-or-one-million",
    "urlToImage": "https://substackcdn.com/image/youtube/w_728,c_limit/Tge5tCZq0dc",
    "publishedAt": "2024-10-31T20:20:01Z",
    "content": "Its Halloween so it was a bit of a slow news day and a slow day around here, but hey, the universe wants us to have a slow day every now and then, especially when everything is AAAAAAAAAAGLABLARCH. (… [+801 chars]"
  },
  {
    "source": { "id": null, "name": "Wonkette.com" },
    "author": "Evan Hurst",
    "title": "Kamala Harris Was On Fire In Madison Last Night",
    "description": "Start your day with a rally.",
    "url": "https://www.wonkette.com/p/kamala-harris-was-on-fire-in-madison",
    "urlToImage": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0339564e-bc36-4be5-806e-ffd07de82c60_2456x1276.png",
    "publishedAt": "2024-10-31T12:55:35Z",
    "content": "We are literally just putting this up for you, because Kamala Harris is awesome all the time lately, just gets better and better, but she was REALLY on fire last night in Madison, Wisconsin.\r\nThe vid… [+411 chars]"
  },
  {
    "source": { "id": null, "name": "International Business Times" },
    "author": "Aurelia END",
    "title": "Kamala Or Harris? How To Thread The Needle On Politics, Gender And Race",
    "description": "",
    "url": "https://www.ibtimes.com/kamala-harris-how-thread-needle-politics-gender-race-3748900",
    "urlToImage": "https://d.ibtimes.com/en/full/4557982/calling-women-leaders-their-first-names-often-done-undercut-their-authority-experts-say.jpg",
    "publishedAt": "2024-10-31T02:18:16Z",
    "content": "What's in a name? For Kamala Harris, it's a way to assert her own authority, implicitly celebrate her identity -- and blunt attacks by her White House rival, Donald Trump.\r\nThe former Republican pres… [+4206 chars]"
  },
  {
    "source": { "id": null, "name": "International Business Times" },
    "author": "Maryam Khanum",
    "title": "Kamala Supporter Receives Fake Harris Postcard Falsely Claiming He Must Host Family of Immigrants in His Home",
    "description": "A supporter of Vice President Kamala Harris' presidential campaign received a fake postcard in the mail, informing him that a family of four immigrants would be moving into his home after he put up a yard sign demonstrating his political affiliation.",
    "url": "https://www.ibtimes.com/kamala-supporter-receives-fake-harris-postcard-falsely-claiming-he-must-host-family-immigrants-3749022",
    "urlToImage": "https://d.ibtimes.com/en/full/4558224/reddit-immigrant-postcard.jpg",
    "publishedAt": "2024-10-31T18:29:22Z",
    "content": "A supporter of Vice President Kamala Harris' presidential campaign received a fake postcard in the mail, informing him that a family of four immigrants would be moving into his home after he put up a… [+2174 chars]"
  },
  {
    "source": { "id": null, "name": "OK!" },
    "author": "Angilene Gacute",
    "title": "Kamala Harris' Transformation Over the Years: Before and After Photos",
    "description": "Kamala Harris declared the U.S. 'is ready to elect its first woman president' ahead of the 2024 presidential election.",
    "url": "https://okmagazine.com/p/kamala-harris-transformation-photos/",
    "urlToImage": "https://media.radaronline.com/brand-img/SRNDpyElJ/1200x628/kamala-harris-transformation-1730244562104.jpg",
    "publishedAt": "2024-10-31T01:00:00Z",
    "content": "In 2019, Harris said: \"My mother would look at me and shed say, Kamala, you may be the first to do many things, but make sure you are not the last.'\"\r\nThat same year, she announced her 2020 president… [+436 chars]"
  },
  {
    "source": { "id": null, "name": "Radaronline.com" },
    "author": "Lauren McIver",
    "title": "Kim Kardashian Deletes YouTube Channel Owned By Son Saint and His Dad Kanye West In Wake of Anti-Kamala Harris Posts on Account",
    "description": "The reality star quickly deleted her 8-year-old son's account after two anti-Kamala Harris posts were shared just days before the presidential election.",
    "url": "https://radaronline.com/p/kim-kardashian-deletes-son-saint-youtube-channel-anti-kamala-harris-posts/",
    "urlToImage": "https://media.radaronline.com/brand-img/6SRflvdRr/1200x628/laurens-image-templates-2024-10-31t133544226-1730398730338.jpg",
    "publishedAt": "2024-10-31T18:21:04Z",
    "content": "In early September, Kardashian boasted about her son's new YouTube channel and claimed she had him sign an \"extensive contract\" prior to launching. \r\nThe contract, which was posted on Kardashian's In… [+526 chars]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-31T12:20:16Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "Japan Today" },
    "author": null,
    "title": "Trump sues CBS over Kamala Harris interview",
    "description": "Republican presidential candidate Donald Trump sued CBS on Thursday over an interview of his Democratic rival Kamala Harris aired on its &quot;60 Minutes&quot; news program in early October that the lawsuit alleged was and misleading, according to a court fil…",
    "url": "https://japantoday.com/category/world/trump-sues-cbs-over-kamala-harris-interview",
    "urlToImage": null,
    "publishedAt": "2024-10-31T21:56:39Z",
    "content": "Republican presidential candidate Donald Trump sued CBS on Thursday over an interview of his Democratic rival Kamala Harris aired on its \"60 Minutes\" news program in early October that the lawsuit al… [+1103 chars]"
  },
  {
    "source": { "id": null, "name": "TheWrap" },
    "author": "Andi Ortiz",
    "title": "Marvel’s Avengers – Including Robert Downey Jr., Scarlett Johansson and Chris Evans –Assemble to Endorse Kamala Harris",
    "description": "The crew also tries to foist some of their signature catchphrases onto the presidential hopeful\nThe post Marvel’s Avengers – Including Robert Downey Jr., Scarlett Johansson and Chris Evans –Assemble to Endorse Kamala Harris appeared first on TheWrap.",
    "url": "https://www.thewrap.com/avengers-kamala-harris-endorsement-video/",
    "urlToImage": "https://www.thewrap.com/wp-content/uploads/2022/10/iron-man-1-robert-downey-jr.jpg",
    "publishedAt": "2024-10-31T21:48:37Z",
    "content": "We may not see them on the big screen together again any time soon, but the Avengers did assemble on Thursday afternoon this time, to endorse Kamala Harris for president.\r\nWatch the video below:\r\nDon… [+285 chars]"
  },
  {
    "source": { "id": null, "name": "The Federalist" },
    "author": "Beth Brelje",
    "title": "Seven Lies Kamala Harris Packed Into 22-Minute Harrisburg Rally",
    "description": "Kamala Harris was able to pack several lies into her relatively short campaign rally in Harrisburg, Pennsylvania on Wednesday.",
    "url": "https://thefederalist.com/2024/10/31/seven-lies-kamala-harris-packed-into-22-minute-harrisburg-rally/",
    "urlToImage": "https://thefederalist.com/wp-content/uploads/2024/10/Screenshot-2024-10-30-201950-e1730374117670.png",
    "publishedAt": "2024-10-31T11:31:38Z",
    "content": "Incredibly, Kamala Harris pantsuit did not burst into flames Wednesday in a 22-minute rally in Harrisburg, Pennsylvania, despite her tired old speech filled with lies.\r\nNo doubt some of her supporter… [+6591 chars]"
  },
  {
    "source": { "id": null, "name": "The Federalist" },
    "author": "Kamden Mulder",
    "title": "Kamala Harris Won’t Win Gen Z Voters Like Me With Memes And Vibes",
    "description": "This is a presidential election, not a vote on who should be the next member of the Hype House.",
    "url": "https://thefederalist.com/2024/10/31/kamala-harris-wont-win-gen-z-voters-like-me-with-memes-and-vibes/",
    "urlToImage": "https://thefederalist.com/wp-content/uploads/2024/10/Untitled-design-4.png",
    "publishedAt": "2024-10-31T11:33:12Z",
    "content": "While young people historically have low voter turnout, Vice President Kamala Harris campaign has taken to social media to try to bridge the gap but young voters shouldnt be so quick to applaud her g… [+4060 chars]"
  },
  {
    "source": { "id": null, "name": "In These Times" },
    "author": "Saqib Bhatti",
    "title": "It’s Not Too Late for Kamala Harris to Earn Votes Like Mine",
    "description": "Harris can win thousands of votes across the country, including in key swing states, by calling for an arms embargo.",
    "url": "https://inthesetimes.com/article/kamala-harris-democrats-palestinians-arms-embargo",
    "urlToImage": "https://s3.us-east-1.amazonaws.com/in-these-times/_1200x630_crop_center-center_82_none/GettyImages-2175318755.jpg?mtime=1730407041",
    "publishedAt": "2024-10-31T21:25:00Z",
    "content": "A year ago I wrote an article with a headline proclaiming I Am Done Voting for the Lesser of Two Evils. I Will Not Vote for Joe Biden in 2024. It was one of the first opinion pieces to emerge after O… [+7736 chars]"
  },
  {
    "source": { "id": null, "name": "Mediaite" },
    "author": "Colby Hall",
    "title": "Trump Posts Stalkery Through-Window Video of an Unsuspecting Kamala Harris Yawning",
    "description": "Former President Trump raised some eyebrows when he posted a 10-second clip of an unsuspecting Vice President Kamala Harris yawning shot through a window.\nThe post Trump Posts Stalkery Through-Window Video of an Unsuspecting Kamala Harris Yawning first appear…",
    "url": "https://www.mediaite.com/opinion/trump-posts-stalkery-through-window-video-of-an-unsuspecting-kamala-harris-yawning/",
    "urlToImage": "https://www.mediaite.com/wp-content/uploads/2024/10/Screenshot-2024-10-31-at-1.36.48 PM.jpg",
    "publishedAt": "2024-10-31T18:33:40Z",
    "content": "Screenshot\r\nFormer President Donald Trump raised some eyebrows when he posted a 10-second clip shot through a window of an unsuspecting Vice President Kamala Harris yawning on Thursday.\r\nThe short vi… [+1883 chars]"
  },
  {
    "source": { "id": null, "name": "Mediaite" },
    "author": "Charlie Nash",
    "title": "LeBron James Endorses Kamala Harris for President: ‘The Choice Is Clear to Me’",
    "description": "Los Angeles Lakers star Lebron James endorsed Vice President Kamala Harris for president on Thursday after sharing a video about Trump's \"hate.\"\nThe post LeBron James Endorses Kamala Harris for President: ‘The Choice Is Clear to Me’ first appeared on Mediaite.",
    "url": "https://www.mediaite.com/politics/lebron-james-endorses-kamala-harris-for-president-the-choice-is-clear-to-me/",
    "urlToImage": "https://www.mediaite.com/wp-content/uploads/2024/10/AP24301187450335.jpg",
    "publishedAt": "2024-10-31T23:10:05Z",
    "content": "Photo by Jevone Moore/Icon Sportswire) (Icon Sportswire via AP Images\r\nLos Angeles Lakers star Lebron James endorsed Vice President Kamala Harris for president on Thursday while sharing a video about… [+1540 chars]"
  },
  {
    "source": { "id": null, "name": "Mediaite" },
    "author": "Ahmad Austin Jr.",
    "title": "Joe Rogan Opens Up About Failed Efforts to Get Kamala Harris Interview: ‘They Want to Control a Lot of Things’",
    "description": "Joe Rogan went into detail about why his plan to have Vice President Kamala Harris on his podcast eventually fell through.\nThe post Joe Rogan Opens Up About Failed Efforts to Get Kamala Harris Interview: ‘They Want to Control a Lot of Things’ first appeared o…",
    "url": "https://www.mediaite.com/podcasts/joe-rogan-opens-up-about-failed-efforts-to-get-kamala-harris-interview-they-want-to-control-a-lot-of-things/",
    "urlToImage": "https://www.mediaite.com/wp-content/uploads/2024/10/Screenshot-2024-10-31-at-12.14.16 PM-e1730391487364.png",
    "publishedAt": "2024-10-31T16:39:25Z",
    "content": "Joe Rogan went into detail about why his plan to have Vice President Kamala Harris on his podcast eventually fell through in an episode of The Joe Rogan Experience released on Wednesday.\r\nLast week, … [+1904 chars]"
  },
  {
    "source": { "id": null, "name": "Mediaite" },
    "author": "David Gilmour",
    "title": "Jesse Watters Warns Wife That Secretly ‘Pulling The Lever’ For Kamala Harris Would Be Like ‘Having An Affair’: ‘D-Day!’",
    "description": "Panelists on Fox News show The Five laughed off host Jesse Watters’ claim that if his wife were to secretly vote for Democratic nominee Kamala Harris he would see it as “the same thing as having an affair.” The crew was discussing a recent advert by the Harri…",
    "url": "https://www.mediaite.com/tv/jesse-watters-warns-wife-that-secretly-pulling-the-lever-for-kamala-harris-would-be-like-having-an-affair-d-day/",
    "urlToImage": "https://www.mediaite.com/wp-content/uploads/2024/10/watters.jpeg",
    "publishedAt": "2024-10-31T10:55:22Z",
    "content": "Panelists on Fox News show The Five laughed off host Jesse Watters’ claim that if his wife were to secretly vote for Democratic nominee Kamala Harris he would see it as the same thing as having an af… [+1400 chars]"
  },
  {
    "source": { "id": null, "name": "Mediaite" },
    "author": "David Gilmour",
    "title": "Trump Blasts Kamala Harris ‘LIE!’ — Claims He ‘Never Mentioned’ Ending Obamacare, Even Though He Did Exactly That In a 2020 Debate",
    "description": "Former President Donald Trump risibly claimed that he \"never\" wanted to repeal Obamacare in a post on Truth Social Thursday.\nThe post Trump Blasts Kamala Harris ‘LIE!’ — Claims He ‘Never Mentioned’ Ending Obamacare, Even Though He Did Exactly That In a 2020 D…",
    "url": "https://www.mediaite.com/news/trump-blasts-kamala-harris-lie-claims-he-never-mentioned-ending-obamacare-even-though-he-did-exactly-that-in-a-2020-debate/",
    "urlToImage": "https://www.mediaite.com/wp-content/uploads/2024/10/Screenshot-2024-10-31-at-16.27.10.png",
    "publishedAt": "2024-10-31T16:59:06Z",
    "content": "Former President Donald Trump branded Vice President Kamala Harris a liar and claimed he never mentioned ending the Affordable Care Act (ACA) also called Obamacare on Thursday despite the fact that h… [+3368 chars]"
  },
  {
    "source": { "id": null, "name": "Memeorandum.com" },
    "author": null,
    "title": "Why I'm Voting for Kamala Harris (Michael R. Bloomberg/Bloomberg)",
    "description": "Michael R. Bloomberg / Bloomberg:\nWhy I'm Voting for Kamala Harris  —  When it comes to the candidates' policy positions and personal integrity, there's a clear choice. … I do not agree with Vice President Kamala Harris on every issue, but earlier this week, …",
    "url": "https://www.memeorandum.com/241031/p72",
    "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iKd6FLjVSuVs/v1/1200x800.jpg",
    "publishedAt": "2024-10-31T21:35:01Z",
    "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news out… [+72 chars]"
  },
  {
    "source": { "id": null, "name": "Memeorandum.com" },
    "author": null,
    "title": "Full transcript: Vice President Kamala Harris interviewed by NBC News' Yamiche Alcindor (NBC News)",
    "description": "NBC News:\nFull transcript: Vice President Kamala Harris interviewed by NBC News' Yamiche Alcindor  —  With just days to go before the 2024 elections, Harris spoke to NBC News on Thursday afternoon ahead of a rally in Phoenix.  —  NBC News' Yamiche Alcindor in…",
    "url": "https://www.memeorandum.com/241031/p85",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241031-kamala-harris-vl-1138a-07b74e.jpg",
    "publishedAt": "2024-10-31T23:45:01Z",
    "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news out… [+72 chars]"
  },
  {
    "source": { "id": null, "name": "Memeorandum.com" },
    "author": null,
    "title": "Why The Economist endorses Kamala Harris (The Economist)",
    "description": "The Economist:\nWhy The Economist endorses Kamala Harris  —  Our daily political update, featuring the stories that matter",
    "url": "https://www.memeorandum.com/241031/p34",
    "urlToImage": "https://www.economist.com/content-assets/images/20241102_USP515.jpg",
    "publishedAt": "2024-10-31T15:00:33Z",
    "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news out… [+72 chars]"
  },
  {
    "source": { "id": null, "name": "Memeorandum.com" },
    "author": null,
    "title": "Jesse Watters Warns Wife That Secretly 'Pulling The Lever' For Kamala Harris Would Be Like 'Having An Affair': 'D-Day!' (David Gilmour/Mediaite)",
    "description": "David Gilmour / Mediaite:\nJesse Watters Warns Wife That Secretly ‘Pulling The Lever’ For Kamala Harris Would Be Like ‘Having An Affair’: ‘D-Day!’  —  Panelists on Fox News show The Five laughed off host Jesse Watters' claim that if his wife were to secretly v…",
    "url": "https://www.memeorandum.com/241031/p53",
    "urlToImage": "https://www.mediaite.com/wp-content/uploads/2024/10/watters.jpeg",
    "publishedAt": "2024-10-31T17:25:00Z",
    "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news out… [+72 chars]"
  },
  {
    "source": { "id": null, "name": "Boston Herald" },
    "author": "Associated Press",
    "title": "Kamala Harris says Trump’s comments on women ‘are offensive to everybody’",
    "description": "Trump has taken to boasting in public events and in social media posts that he’d protect women and make sure they wouldn’t be “thinking about abortion.”",
    "url": "https://www.bostonherald.com/2024/10/31/kamala-harris-donald-trump-campaigning/",
    "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2024/10/Election_2024_Harris_70293.jpg?w=1024&h=683",
    "publishedAt": "2024-10-31T15:57:28Z",
    "content": "By WILL WEISSERT and COLLEEN LONG\r\nMADISON, Wis. (AP) — Kamala Harris said Thursday that Donald Trump’s comment that he would protect women “whether the women like it or not” showed that the Republic… [+1969 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Dan Gooding",
    "title": "How Mormons Could Be Kamala Harris' Secret Weapon in Arizona",
    "description": "Members of the Church of Latter-Day Saints are growing uncomfortable with the way the GOP talks about immigrants. It could cost Trump in a key state.",
    "url": "https://www.newsweek.com/trump-immigration-arizona-latter-day-saints-vote-1978189",
    "urlToImage": "https://d.newsweek.com/en/full/2509390/mormon-utah.jpg",
    "publishedAt": "2024-10-31T19:39:13Z",
    "content": "Traditionally conservative members of the Church of Latter-day Saints in Arizona are being turned off from former President Donald Trump, in part because of his language around immigrants.\r\nWith arou… [+4745 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Maya Mehrara",
    "title": "Kamala Harris Scores Win With Gen Z, Gen Alpha",
    "description": "Children have chosen Vice President Kamala Harris over Donald Trump in a Nickelodeon poll.",
    "url": "https://www.newsweek.com/kamala-harris-gen-z-alpha-poll-1977503",
    "urlToImage": "https://d.newsweek.com/en/full/2508244/kamala-harris-dnc-family.jpg",
    "publishedAt": "2024-10-31T16:40:09Z",
    "content": "Vice President Kamala Harris appears to have won over likely members Gen Z and Gen Alpha as she won Nickelodeon's Kids Pick the President \"Kids' Vote\" poll run throughout this month.\r\nHarris beat Tru… [+3794 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Kaitlin Lewis",
    "title": "Donald Trump's Wisconsin Crowd Size Compared to Kamala Harris'",
    "description": "Trump and Harris held competing rallies in Wisconsin on Wednesday as polls show the candidates in a dead heat in the battleground state.",
    "url": "https://www.newsweek.com/donald-trump-kamala-harris-crowd-size-wisconsin-1977695",
    "urlToImage": "https://d.newsweek.com/en/full/2508517/harris-trump-wisconsin-rally-sizes-compared.jpg",
    "publishedAt": "2024-10-31T02:03:15Z",
    "content": "Vice President Kamala Harris and former President Donald Trump held dueling rallies in Wisconsin as polls show the candidates in a dead heat as they push to win the key battleground state next week.\r… [+4376 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Jordan King",
    "title": "Kamala Harris Pounces on Donald Trump's Remarks About Women",
    "description": "Kamala Harris' campaign has posted an edited clip of Donald Trump repeating \"whether the women like it or not.\"",
    "url": "https://www.newsweek.com/kamala-harris-pounces-donald-trump-comment-whether-women-like-it-not-1977756",
    "urlToImage": "https://d.newsweek.com/en/full/2508588/trump-wisconsin.jpg",
    "publishedAt": "2024-10-31T10:46:49Z",
    "content": "Vice President Kamala Harris' campaign team has pounced on Donald Trump's comment about protecting women \"whether the women like it or not.\"\r\nThe election is less than a week away and the two preside… [+5437 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Ewan Palmer",
    "title": "Electoral College Map Projector Flips Two States to Kamala Harris",
    "description": "RealClearPolitics' No Toss-Up map now has the swing states of Wisconsin and Michigan leaning toward the vice president.",
    "url": "https://www.newsweek.com/electoral-college-map-projector-flips-two-states-kamala-harris-1977769",
    "urlToImage": "https://d.newsweek.com/en/full/2508607/kamala-harris-wisconsin.jpg",
    "publishedAt": "2024-10-31T11:40:49Z",
    "content": "An election forecaster's Electoral College map, which does not list any state as a toss-up, has moved a second key swing state this week to lean toward Vice President Kamala Harris.\r\nRealClearPolitic… [+3278 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Martha McHardy",
    "title": "Kamala Harris Gets Good News in Final Rust Belt Polls",
    "description": "With less than a week to go, the election is close than ever, according to recent polling.",
    "url": "https://www.newsweek.com/donald-trump-kamala-harris-polls-rust-belt-states-1977962",
    "urlToImage": "https://d.newsweek.com/en/full/2508965/harris.jpg",
    "publishedAt": "2024-10-31T15:00:01Z",
    "content": "With the election just days away, Vice President Kamala Harris received a boost from the final round of polling in key Rust Belt states, where recent data shows her pulling ahead of Donald Trump.\r\nAc… [+3463 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Martha McHardy",
    "title": "Kamala Harris No Longer Favorite in New Hampshire: Election Forecast",
    "description": "The latest polling is bad news for Harris, who is virtually neck and neck with Trump with less than a week to go until the election.",
    "url": "https://www.newsweek.com/donald-trump-kamala-harris-polls-new-hampshire-1977839",
    "urlToImage": "https://d.newsweek.com/en/full/2508759/harris.jpg",
    "publishedAt": "2024-10-31T12:49:52Z",
    "content": "Kamala Harris is no longer the favorite to win in New Hampshire, according to a top election forecast.\r\nAccording to RealClearPolitics' forecast, New Hampshire is now a toss-up state after it was pre… [+3835 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Jesus Mesa",
    "title": "Map Shows Kamala Harris and Donald Trump's Final Campaign Stops",
    "description": "In the final days before the election, Kamala Harris and Donald Trump are making key stops in battleground states, aiming to win over undecided voters.",
    "url": "https://www.newsweek.com/map-shows-kamala-harris-donald-trumps-final-campaign-stops-1978152",
    "urlToImage": "https://d.newsweek.com/en/full/2509229/us-map.jpg",
    "publishedAt": "2024-10-31T17:58:20Z",
    "content": "In the final days leading up to the November 5 election, both Vice President Kamala Harris and former President Donald Trump are making critical campaign stops in battleground states, fighting for ev… [+2331 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Matt Levine",
    "title": "Lakers' LeBron James Officially Endorses Kamala Harris For President",
    "description": "Lakers star LeBron James has endorsed Kamala Harris for President.",
    "url": "https://www.newsweek.com/sports/nba/lakers-lebron-james-officially-endorses-kamala-harris-president-1978301",
    "urlToImage": "https://d.newsweek.com/en/full/2509456/lebron-james.jpg",
    "publishedAt": "2024-10-31T21:17:48Z",
    "content": "Los Angeles Lakers superstar LeBron James has officially endorsed Democratic candidate Kamala Harris for President. The star took to social media to relay his thoughts about the upcoming political el… [+2922 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Martha McHardy",
    "title": "Final Pennsylvania Polls Look Grim For Kamala Harris",
    "description": "Harris led in the Keystone State after becoming the Democratic nominee for president but in the last two weeks Donald Trump has taken the lead.",
    "url": "https://www.newsweek.com/donald-trump-kamala-harris-polls-swing-states-pennsylvania-1977763",
    "urlToImage": "https://d.newsweek.com/en/full/2508616/harris.jpg",
    "publishedAt": "2024-10-31T11:01:03Z",
    "content": "Several polls from the key battleground state of Pennsylvania show Kamala Harris trailing her opponent Donald Trump with less than a week to go until the election.\r\nPennsylvania, which has 19 elector… [+4414 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Flynn Nicholls",
    "title": "Final Poll Flips to Donald Trump in Four-Point Swing From Kamala Harris",
    "description": "The election remains a coin-flip with only five days remaining.",
    "url": "https://www.newsweek.com/final-poll-flips-donald-trump-four-point-swing-kamala-harris-1978155",
    "urlToImage": "https://d.newsweek.com/en/full/2509221/donald-trump.jpg",
    "publishedAt": "2024-10-31T17:43:18Z",
    "content": "Donald Trump has overtaken Kamala Harris in the final DailyMail.com/J.L. Partners national poll before Election Day, with a three-point lead over the vice president.\r\nThe poll, released Thursday, sho… [+3594 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Kaitlin Lewis",
    "title": "CNN Anchor Cuts Away From Kamala Harris Rally and Fact-Checks Claims",
    "description": "CNN's Jake Tapper fact-checked the vice president on two attacks leveled at President Donald Trump.",
    "url": "https://www.newsweek.com/cnn-anchor-cuts-away-kamala-harris-rally-fact-checks-claims-1978337",
    "urlToImage": "https://d.newsweek.com/en/full/2509509/cnn-anchor-fact-checks-harris-claims.jpg",
    "publishedAt": "2024-10-31T23:01:03Z",
    "content": "CNN anchor Jake Tapper pulled away from Vice President Kamala Harris' rally in Arizona while on air Thursday and offered \"two teeny little fact checks\" on the Democratic nominee's speech.\r\nHarris is … [+2524 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Flynn Nicholls",
    "title": "Who Will Win the Election? Kamala Harris vs Donald Trump Polls Five Days Out",
    "description": "The Republican and Democratic candidates are still essentially tied as race enters its final few days.",
    "url": "https://www.newsweek.com/who-will-win-election-kamala-harris-vs-donald-trump-polls-five-days-out-1977355",
    "urlToImage": "https://d.newsweek.com/en/full/2508001/harris-vs-trump-polls-five-days-out.png",
    "publishedAt": "2024-10-31T07:00:01Z",
    "content": "The 2024 election between Donald Trump and Kamala Harris appears closer than ever as the race enters its final week.\r\nPollsters and forecasters are saying that Trump has the slight edge over the Demo… [+4202 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Theo Burman",
    "title": "Kamala Harris Struggles With Young Black Men as Gen Z Skips Church",
    "description": "The church has been a vital part of the Democrats' outreach to Black communities but declining attendance among younger voters poses a problem.",
    "url": "https://www.newsweek.com/kamala-harris-gen-z-black-men-voters-church-decline-us-election-2024-1976622",
    "urlToImage": "https://d.newsweek.com/en/full/2505598/harris-struggles-black-men-gen-z-skips-church.png",
    "publishedAt": "2024-10-31T09:00:02Z",
    "content": "It was a classic hot mic moment: while Kamala Harris grabbed a beer at a bar in Michigan with Governor Gretchen Whitmer on Saturday, the Vice President apparently let slip that her campaign was strug… [+7211 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Monica Sager",
    "title": "Kamala Harris' Campaign Mocks Trump for Video of Man Walking Out of Rally",
    "description": "Former President Donald Trump had unfortunate timing while continuing to claim that no one leaves his rallies.",
    "url": "https://www.newsweek.com/donald-trump-rally-north-carolina-leaving-crowd-1977628",
    "urlToImage": "https://d.newsweek.com/en/full/2509127/trump-attendee-leaving-rally.jpg",
    "publishedAt": "2024-10-31T16:26:29Z",
    "content": "Former President Donald Trump claimed that \"nobody leaves early\" at his rallies, while a man behind him is seen stepping away from his seat.\r\nDuring Trump's rally in Rocky Mount, North Carolina, on W… [+3930 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Monica Sager",
    "title": "Kamala Harris Would Be Least Popular Democrat to Win Election in 64 Years",
    "description": "The vice president has also the highest unfavorable view by an opposing party.",
    "url": "https://www.newsweek.com/kamala-harris-least-popular-democrat-election-1978188",
    "urlToImage": "https://d.newsweek.com/en/full/2509331/harris-trump-signs.jpg",
    "publishedAt": "2024-10-31T19:36:34Z",
    "content": "Vice President Kamala Harris could face the lowest favorability of any Democratic president-elect if November 5 goes in her favor.\r\nHarris and her opponent, former President Donald Trump both are on … [+3872 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Mandy Taheri",
    "title": "Kamala Harris, Donald Trump Need These Swing States to Win the Election",
    "description": "Seven key battleground states hold 93 Electoral College votes, with Pennsylvania as the most coveted and largest swing state.",
    "url": "https://www.newsweek.com/kamala-harris-donald-trump-need-these-swing-states-win-election-1978083",
    "urlToImage": "https://d.newsweek.com/en/full/2509112/trump-harris.png",
    "publishedAt": "2024-10-31T18:57:17Z",
    "content": "Five days ahead of an extraordinarily tight presidential race, Kamala Harris and Donald Trump are campaigning to secure 270 Electoral College votes needed to claim the presidency—an outcome likely to… [+4410 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Jesus Mesa",
    "title": "JD Vance Trolls Kamala Harris With One of Her Favorite Lines",
    "description": "\"I grew up in a working-class family,\" Vance began, pausing with a smirk before adding, \"I'm kidding.\"",
    "url": "https://www.newsweek.com/jd-vance-trolls-kamala-harris-working-class-families-1978197",
    "urlToImage": "https://d.newsweek.com/en/full/2509315/jd-vance.jpg",
    "publishedAt": "2024-10-31T18:42:53Z",
    "content": "Ohio Senator JD Vance opened a town hall in North Carolina with a line parodying one of Vice President Kamala Harris' frequent remarks in public speeches.\r\n\"I grew up in a working-class family,\" the … [+3239 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Dan Gooding",
    "title": "Kamala Harris May Be Within Striking Distance in Solidly Red State: Poll",
    "description": "In Alaska, the Democrat has gained ground on her opponent, former President Donald Trump, in recent weeks.",
    "url": "https://www.newsweek.com/alaska-kamala-harris-donald-trump-presidential-election-poll-close-1978304",
    "urlToImage": "https://d.newsweek.com/en/full/2509459/kamala-harris-pennsylvania.jpg",
    "publishedAt": "2024-10-31T22:37:06Z",
    "content": "Vice President Kamala Harris' chances of gaining ground in solidly Republican Alaska appears to have increased, according to polling released on Thursday.\r\nThe latest report from Alaska Survey Resear… [+2937 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Khaleda Rahman",
    "title": "Will Taylor Swift Appear at Kamala Harris' Pennsylvania Rally? What We Know",
    "description": "The vice president and Democratic nominee will reportedly hold a rally in Philadelphia on the eve of Election Day.",
    "url": "https://www.newsweek.com/taylor-swift-kamala-harris-pennsylvania-rally-1977807",
    "urlToImage": "https://d.newsweek.com/en/full/2508683/taylor-swift-performs.jpg",
    "publishedAt": "2024-10-31T15:10:56Z",
    "content": "Rumors are circulating on social media that Taylor Swift could appear at a rally that Vice President Kamala Harris is reportedly holding in Pennsylvania on the eve of Election Day.\r\nHarris will be ho… [+2945 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Marni Rose McFall",
    "title": "How to Watch Kamala Harris' Rally in Nevada with Jennifer Lopez Today",
    "description": "Jennifer Lopez will join Harris at a rally in Las Vegas, following controversial remarks made by Tony Hinchcliffe.",
    "url": "https://www.newsweek.com/how-watch-kamala-harris-las-vegas-rally-jennifer-lopez-1977796",
    "urlToImage": "https://d.newsweek.com/en/full/2508647/jlo.jpg",
    "publishedAt": "2024-10-31T15:47:22Z",
    "content": "Vice President Kamala Harris is scheduled to appear at a campaign rally in Las Vegas tonight, alongside Jennifer Lopez and Maná, as part of the \"When We Vote We Win\" event series.\r\nThe 2024 president… [+3193 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Mandy Taheri",
    "title": "Signs Kamala Harris Could Win Are 'Clear as Day'—Election Forecaster",
    "description": "A CNN election forecaster says if Vice President Kamala Harris wins the election, the \"signs were clear as day.\"",
    "url": "https://www.newsweek.com/signs-kamala-harris-could-win-election-forecaster-1978251",
    "urlToImage": "https://d.newsweek.com/en/full/2509398/kamala-harris.jpg",
    "publishedAt": "2024-10-31T20:48:47Z",
    "content": "CNN data analyst and forecaster Harry Enten said Thursday that if Vice President Kamala Harris wins, \"the signs were clear as day,\" citing her favorability rating and abortion as a key issue in the 2… [+3844 chars]"
  },
  {
    "source": { "id": "newsweek", "name": "Newsweek" },
    "author": "Anna Commander",
    "title": "CNN Polling Analyst's Warning to Kamala Harris: Signs 'Have Been Obvious'",
    "description": "CNN's Harry Enten said that if Trump wins the 2024 election, \"the signs were there all along\" in a warning to Democrats.",
    "url": "https://www.newsweek.com/cnn-polling-analyst-warning-kamala-harris-1977685",
    "urlToImage": "https://d.newsweek.com/en/full/2508489/kamala-harris.jpg",
    "publishedAt": "2024-10-31T00:29:55Z",
    "content": "CNN data analyst Harry Enten issued a warning to Vice President Kamala Harris' campaign, saying President Joe Biden's approval ratings and Republican registration in key states are troubling and if D… [+3157 chars]"
  },
  {
    "source": { "id": null, "name": "Celebitchy.com" },
    "author": "Kaiser",
    "title": "Jennifer Aniston: ‘I very proudly voted for Kamala Harris and Tim Walz’",
    "description": "While I definitely think Jennifer Aniston can be and often is problematic, she’s never played any political “both sides” games. She’s always been a Democrat, she’s always supported Democrats nationally. She usually attends one or two fundraisers in presidenti…",
    "url": "https://www.celebitchy.com/896170/jennifer_aniston_i_very_proudly_voted_for_kamala_harris_and_tim_walz/",
    "urlToImage": null,
    "publishedAt": "2024-10-31T11:10:41Z",
    "content": "While I definitely think Jennifer Aniston can be and often is problematic, shes never played any political both sides games. Shes always been a Democrat, shes always supported Democrats nationally. S… [+2151 chars]"
  },
  {
    "source": { "id": null, "name": "Page Six" },
    "author": "Riley Cardoza",
    "title": "Kim Kardashian’s son Saint West’s YouTube account deleted after posting anti-Kamala Harris meme",
    "description": "The \"Kardashians\" star publicized her 8-year-old's account via Instagram in September after making the little one sign an \"extensive contract.\"",
    "url": "https://pagesix.com/2024/10/31/parents/kim-kardashians-son-saints-youtube-deleted-after-anti-kamala-harris-meme/",
    "urlToImage": "https://pagesix.com/wp-content/uploads/sites/3/2024/10/kim-kardashian-saint-west-84-1.jpg?quality=75&strip=all&w=1024",
    "publishedAt": "2024-10-31T13:26:07Z",
    "content": "Kim Kardashian’s son Saint’s YouTube account was deleted. kimkardashian/Instagram\r\nKeeping up with Saint West’s social media activity just got a little harder.\r\nKim Kardashian and Kanye West’s son’s … [+3201 chars]"
  },
  {
    "source": { "id": null, "name": "Page Six" },
    "author": "Nicki Cox",
    "title": "Stevie Nicks reveals her biggest voting ‘regret’ after Kamala Harris endorsement",
    "description": "The Fleetwood Mac rocker, 76, confirmed she would be voting for the Vice President during an interview with Rolling Stone earlier this month.",
    "url": "https://pagesix.com/2024/10/31/celebrity-news/stevie-nicks-reveals-her-biggest-voting-regret-after-kamala-harris-endorsement/",
    "urlToImage": "https://pagesix.com/wp-content/uploads/sites/3/2024/10/92767058.jpg?quality=75&strip=all&w=1024",
    "publishedAt": "2024-10-31T17:28:29Z",
    "content": "It’s never too late to get in the voter’s booth. \r\nDuring a recent interview with MSNBC, Steve Nicks admitted that her biggest “regret” was not using her right to vote until her 70s and encouraged ot… [+3187 chars]"
  },
  {
    "source": { "id": null, "name": "Sky.com" },
    "author": "Neville Lazarus",
    "title": "'I am inspired by her': The people cheering Kamala Harris on from her Indian roots",
    "description": "They may be thousands of miles away, but everyone in the tiny village of Thulasendrapuram, in the southern Indian state of Tamil Nadu, is keenly following the American presidential election.",
    "url": "https://news.sky.com/story/us-election-the-tiny-village-in-india-which-is-cheering-kamala-harris-on-as-she-aims-for-the-white-house-13245497",
    "urlToImage": "https://e3.365dm.com/24/10/1600x900/skynews-kamala-harris-india_6734464.jpg?20241031151108",
    "publishedAt": "2024-10-31T14:20:00Z",
    "content": "They may be thousands of miles away, but everyone in the tiny village of Thulasendrapuram, in the southern Indian state of Tamil Nadu, is keenly following the American presidential election.\r\nIt is b… [+4474 chars]"
  },
  {
    "source": { "id": null, "name": "Teen Vogue" },
    "author": "Alí Bustamante",
    "title": "Student Debt Relief and Kamala Harris: What to Expect If She Gets Elected",
    "description": "Kamala Harris has pledged to create an “opportunity economy” where everyone has a fair shot at success. That can’t happen without student debt relief.",
    "url": "https://www.teenvogue.com/story/student-debt-relief-kamala-harris-what-to-expect",
    "urlToImage": "https://assets.teenvogue.com/photos/6722780f61ba09a445444503/16:9/w_1280,c_limit/GettyImages-1400676122.jpg",
    "publishedAt": "2024-10-31T12:00:00Z",
    "content": "Beyond student loan cancellation, the administration has also taken steps to expand Pell Grants and other forms of financial aid to help low-income students afford college without taking on massive l… [+3282 chars]"
  },
  {
    "source": { "id": null, "name": "Thegatewaypundit.com" },
    "author": "Cristina Laila",
    "title": "Top Kamala Harris Surrogate Mark Cuban Faces Intense Backlash From #WomenForTrump After He Says Female Trump Supporters are Weak, Dumb… And Trump’s Response is Legendary!",
    "description": "Kamala Harris’s top surrogate Mark Cuban faced intense backlash after he insulted millions of women on Thursday.\nThe post Top Kamala Harris Surrogate Mark Cuban Faces Intense Backlash From #WomenForTrump After He Says Female Trump Supporters are Weak, Dumb… A…",
    "url": "https://www.thegatewaypundit.com/2024/10/top-kamala-harris-surrogate-mark-cuban-faces-intense/",
    "urlToImage": "https://www.thegatewaypundit.com/wp-content/uploads/2024/01/mark-cuban-1.jpg",
    "publishedAt": "2024-10-31T23:20:47Z",
    "content": "Kamala Harris’s top surrogate Mark Cuban faced intense backlash after he insulted millions of women on Thursday.\r\nTop Kamala surrogate Mark Cuban insulted MILLIONS of women after Joe Biden called Tru… [+4879 chars]"
  },
  {
    "source": { "id": null, "name": "New York Post" },
    "author": "Miranda Devine",
    "title": "Kamala Harris and the Dems can’t lead the country if they hate half of it",
    "description": "Vice President Kamala Harris, her surrogates and media handmaidens spent three days putting a comedian’s ill-chosen words in Donald Trump’s mouth.",
    "url": "https://nypost.com/2024/10/30/opinion/kamala-harris-and-the-dems-cant-lead-the-country-if-they-hate-half-of-it/",
    "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/10/KBEJERH.jpg?quality=75&strip=all&w=1024",
    "publishedAt": "2024-10-31T02:01:02Z",
    "content": "Vice President Kamala Harris, her surrogates and media handmaidens spent three days putting a comedians ill-chosen words in Donald Trumps mouth. \r\nNow they are pretending the sitting president didnt … [+5532 chars]"
  },
  {
    "source": { "id": null, "name": "New York Post" },
    "author": "Josh Christenson",
    "title": "JD Vance tells Joe Rogan that Kamala Harris is the ‘Michael Jordan’ of word salads: ‘There’s a skill to this’",
    "description": "Republican vice presidential candidate JD Vance admired the skill Vice President Kamala Harris has for word salads.",
    "url": "https://nypost.com/2024/10/31/us-news/jd-vance-says-kamala-harris-is-the-michael-jordan-of-word-salads-theres-a-skill-to-this/",
    "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-csdzx5r1z-1730402634291.jpg?quality=75&strip=all&1730388268&w=1024",
    "publishedAt": "2024-10-31T19:26:24Z",
    "content": "Republican vice presidential candidate JD Vance admired the skill Vice President Kamala Harris has for word salads.\r\n“I give a lot of speeches, so there’s actually a skill to this,” Vance told podcas… [+1489 chars]"
  },
  {
    "source": { "id": null, "name": "Hip-Hop Wired" },
    "author": "Christopher Smith",
    "title": "Kamala Harris Endorsed By Puerto Rico’s Biggest Newspaper",
    "description": "Puerto Rico's largest newspaper, El Nuevo Dia, officially endorsed Kamala Harris in the presidential election. The editorial bashed Republican presidential nominee Donald Trump for his disrespect of Puerto Rico and his erratic behavior.",
    "url": "https://hiphopwired.com/2447907/kamala-harris-endorsed-by-puerto-ricos-biggest-newspaper/",
    "urlToImage": "https://hiphopwired.com/wp-content/uploads/sites/43/2024/10/17303927612872.jpg",
    "publishedAt": "2024-10-31T16:40:47Z",
    "content": "HipHopWired Featured Video\r\nSource: DREW ANGERER / Getty\r\nThe largest newspaper in Puerto Rico endorsed Kamala Harris in the presidential race, blasting Donald Trump in the process.\r\nThe fallout from… [+2207 chars]"
  },
  {
    "source": { "id": null, "name": "Hip-Hop Wired" },
    "author": "D.L. Chandler",
    "title": "Cardi B Will Join Vice President Kamala Harris At Milwaukee Rally",
    "description": "Cardi B will join Vice President Kamala Harris in Milwaukee, Wisc. for a rally as the election campaign winds down.",
    "url": "https://hiphopwired.com/2448114/cardi-b-will-join-vice-president-kamala-harris-at-milwaukee-rally/",
    "urlToImage": "https://hiphopwired.com/wp-content/uploads/sites/43/2024/10/17304003741172.jpg",
    "publishedAt": "2024-10-31T18:48:19Z",
    "content": "HipHopWired Featured Video\r\nCardi B, one of the few entertainers who does happen to know how to talk politics, will be among several special guests for a Friday this weekend in Wisconsin. According t… [+1283 chars]"
  },
  {
    "source": { "id": null, "name": "Littlegreenfootballs.com" },
    "author": "Charred Johnson",
    "title": "Seth Meyers: Trump's Dwindling Crowds and Madison Square Garden Rally Fallout vs. Kamala Harris' Closing Argument",
    "description": "Seth takes a closer look at Kamala Harris delivering her closing argument before a record crowd of 75,000 people while Donald Trump continues to reel from the aftermath of a racist comment about Puerto Rico at his Madison Square Garden rally.",
    "url": "https://littlegreenfootballs.com/article/54124_Seth_Meyers-_Trumps_Dwindling_",
    "urlToImage": "https://littlegreenfootballs.com/weblog/thumbnails/charles/2024/10/30/XznQin7BfBE.jpg",
    "publishedAt": "2024-10-31T02:44:48Z",
    "content": "Seth takes a closer look at Kamala Harris delivering her closing argument before a record crowd of 75,000 people while Donald Trump continues to reel from the aftermath of a racist comment about Puer… [+42 chars]"
  },
  {
    "source": { "id": null, "name": "Freethoughtblogs.com" },
    "author": "William Brinkman",
    "title": "Of course we are endorsing Kamala Harris for President (Fiction)",
    "description": "By the Bolingbrook Babbler Editorial Board Seriously? Will this country elect a convicted felon as its leader? Are we about to elect someone who led an insurrection and tried to overturn a free and fair election? Who was a terrible President? Someone who is a…",
    "url": "https://freethoughtblogs.com/babbler/2024/10/30/of-course-we-are-endorsing-kamala-harris-for-president-fiction/",
    "urlToImage": "https://freethoughtblogs.com/babbler/wp-content/themes/ftb2-theme/images/logo.gif",
    "publishedAt": "2024-10-31T01:18:29Z",
    "content": "By the Bolingbrook Babbler Editorial Board\r\nSeriously?\r\nWill this country elect a convicted felon as its leader? Are we about to elect someone who led an insurrection and tried to overturn a free and… [+2166 chars]"
  },
  {
    "source": { "id": "abc-news", "name": "ABC News" },
    "author": "WILL WEISSERT Associated Press, COLLEEN LONG Associated Press",
    "title": "Kamala Harris says Trump's comments on women 'are offensive to everybody'",
    "description": "Vice President Kamala Harris says Donald Trump’s remarks that he’d protect women “whether the women like it or not” were offensive and showed that the Republican presidential nominee does not understand women’s right to make decisions about their own l...",
    "url": "https://abcnews.go.com/Politics/wireStory/kamala-harris-trumps-comments-women-offensive-115356550",
    "urlToImage": "https://i.abcnewsfe.com/a/cc3af401-a8fc-4110-bd3e-d364b27a897f/wirestory_f5903d49488ebc733d7ba5812b36f935_16x9.jpg?w=1600",
    "publishedAt": "2024-10-31T15:58:19Z",
    "content": "MADISON, Wis. -- Kamala Harris said Thursday that Donald Trump's comment that he would protect women whether the women like it or not showed that the Republican presidential nominee does not understa… [+1851 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "ft.com",
    "title": "Why Kamala Harris will win",
    "description": "Because it’s still the economy, stupid",
    "url": "https://biztoc.com/x/1e998c6d9ef0c676",
    "urlToImage": "https://biztoc.com/cdn/1e998c6d9ef0c676_s.webp",
    "publishedAt": "2024-10-31T11:51:08Z",
    "content": "Because its still the economy, stupid\r\nThis story appeared on ft.com, 2024-10-31 11:00:07."
  }
]
