[
  {
    "source": { "id": null, "name": "NPR" },
    "author": "Ayana Archie",
    "title": "Arnold Schwarzenegger has endorsed Kamala Harris for president",
    "description": "Schwarzenegger served as the governor of California from 2003 to 2011. He said he is frustrated with both parties, and does not trust either, but felt compelled to speak out.",
    "url": "https://www.npr.org/2024/10/31/nx-s1-5173456/arnold-schwarzenegger-endorses-kamala-harris",
    "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6122x3444+0+74/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F49%2Fb7%2F6b8a70814557a30c419f1d6314f5%2Fap24261488922399.jpg",
    "publishedAt": "2024-10-31T06:15:15Z",
    "content": "Former Republican governor and actor Arnold Schwarzenegger has endorsed Democratic nominee Kamala Harris for president.\r\nIn a lengthy Wednesday post on X, Schwarzenegger said he does not typically gi… [+1789 chars]"
  },
  {
    "source": { "id": "time", "name": "Time" },
    "author": "Rebecca Schneid",
    "title": "The Republicans Crossing Party Lines and Voting For Harris Over Trump",
    "description": "Former Governor of California Arnold Schwarzenegger joins a growing number of Republicans who are voting for Kamala Harris over Donald Trump.",
    "url": "https://time.com/7160907/republicans-crossing-party-lines-voting-kamala-harris-over-donald-trump/",
    "urlToImage": "https://api.time.com/wp-content/uploads/2024/10/GettyImages-2171848317.jpg?quality=85&w=1200&h=628&crop=1",
    "publishedAt": "2024-10-31T18:06:25Z",
    "content": "With the general election between Vice President Kamala Harris and former President Donald Trump upon us, endorsements from high-profile figures hold much significance. Especially those that involve … [+10120 chars]"
  },
  {
    "source": { "id": "abc-news", "name": "ABC News" },
    "author": "Max Zahn",
    "title": "Could a Trump presidency damage both democracy and the economy? Experts weigh in",
    "description": "Trump could damage the economy, experts say, if he makes good on threats to prosecute political rivals, including Kamala Harris.",
    "url": "https://abcnews.go.com/Politics/trump-presidency-damage-economy-weakens-democracy-experts/story?id=115142899",
    "urlToImage": "https://i.abcnewsfe.com/a/4fb9c4ce-00d1-43a0-9cca-c8ca6fab5555/trump1-gty-ml-241025_1729878821345_hpMain_16x9.jpg?w=1600",
    "publishedAt": "2024-10-31T15:44:23Z",
    "content": "Former President Donald Trump has drawn scrutiny in recent weeks for an escalation of rhetoric threatening political opponents with retribution if he's elected to a second term. The comments have tri… [+7592 chars]"
  },
  {
    "source": { "id": "abc-news", "name": "ABC News" },
    "author": "Bill Hutchinson",
    "title": "Harris seizes on Trump's pledge to protect women 'whether they like it or not'",
    "description": "Vice President Kamala Harris slammed Donald Trump on Thursday, saying the former president's pledge to protect women was \"offensive to everybody.\"",
    "url": "https://abcnews.go.com/Politics/harris-seizes-trumps-pledge-protect-women/story?id=115349240",
    "urlToImage": "https://i.abcnewsfe.com/a/936a0094-2447-4c1d-bf33-04c9f1ea9102/kamala-harris-gty-jef-241031_1730391665399_hpMain_16x9.jpg?w=1600",
    "publishedAt": "2024-10-31T22:48:46Z",
    "content": "Vice President Kamala Harris slammed former President Donald Trump on Thursday, saying his campaign rally pledge to protect women \"whether they like it or not\" was \"offensive to everybody.\"\r\n\"It's ju… [+6276 chars]"
  },
  {
    "source": { "id": null, "name": "Pitchfork" },
    "author": "Jazz Monroe",
    "title": "The National, Remi Wolf, and More Perform at Kamala Harris Rally: Watch",
    "description": "Gracie Abrams also endorsed the Democratic presidential candidate amid a break from her opening slots on Taylor Swift’s Eras Tour",
    "url": "https://pitchfork.com/news/the-national-remi-wolf-perform-at-kamala-harris-rally-watch/",
    "urlToImage": "https://media.pitchfork.com/photos/67238bcba1c9b208e06de39f/16:9/w_1280,c_limit/Kamala-Harris.jpg",
    "publishedAt": "2024-10-31T13:56:33Z",
    "content": "The National, Remi Wolf, Gracie Abrams, and Mumford &amp; Sons performed and spoke at a Kamala Harris rally in Wisconsin last night. Represented by Matt Berninger and Aaron Dessner and introduced by … [+1530 chars]"
  },
  {
    "source": { "id": null, "name": "Rolling Stone" },
    "author": "Tim Chan",
    "title": "This Baseball Cap Celebrates the Dodgers’ Win (and Maybe a Kamala Harris Win Too)",
    "description": "The 'KamaLA' hat combines the VP's name with the Dodgers logo, making for a great pickup whether you're cheering for the team, the presidential candidate, or both",
    "url": "http://www.rollingstone.com/product-recommendations/lifestyle/kamala-harris-la-dodgers-hat-buy-online-1235149614/",
    "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2024/10/kamala-dodgers-hat.png?w=900&h=600&crop=1",
    "publishedAt": "2024-10-31T22:32:27Z",
    "content": "If you purchase an independently reviewed product or service through a link on our website, Rolling Stone may receive an affiliate commission.\r\nDodgers World Series merchhit the internet just hours a… [+2010 chars]"
  },
  {
    "source": { "id": "al-jazeera-english", "name": "Al Jazeera English" },
    "author": "Al Jazeera Staff",
    "title": "US election: 5 days left – What polls say, what Harris and Trump are up to",
    "description": "Kamala Harris will visit two swing states, while Donald Trump travels to Nevada and New Mexico.",
    "url": "https://www.aljazeera.com/news/2024/10/31/us-election-5-days-left-what-polls-say-what-harris-and-trump-are-up-to",
    "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/10/2024-10-30T224938Z_840363408_RC2AVAAGZAVG_RTRMADP_3_USA-ELECTION-TRUMP-1730330627.jpg?resize=1920%2C1440",
    "publishedAt": "2024-10-31T06:08:47Z",
    "content": "With less than one week before election day, Vice President Kamala Harris and former President Donald Trump hosted rival events in the swing states of Wisconsin and North Carolina where both are figh… [+8161 chars]"
  },
  {
    "source": { "id": "al-jazeera-english", "name": "Al Jazeera English" },
    "author": "Al Jazeera",
    "title": "Fact check: Would Trump slash social security and Medicare?",
    "description": "Kamala Harris claims Donald Trump would allow medical insurance companies to deny coverage for pre-existing conditions.",
    "url": "https://www.aljazeera.com/news/2024/10/31/fact-check-would-trump-slash-social-security-and-medicare",
    "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/10/AP24305077359293-1730356082.jpg?resize=1920%2C1440",
    "publishedAt": "2024-10-31T12:09:10Z",
    "content": "Vice President Kamala Harris is rolling out her closing argument for president in a new TV advertisement that attacks former President Donald Trump on healthcare, entitlement programmes and taxes.\r\nW… [+8603 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "Cardi B To Join Kamala Harris At Milwaukee Rally",
    "description": "Cardi B will make remarks at a Milwaukee rally with Kamala Harris on Friday, as the vice president’s campaign makes its final get-out-the-vote push ahead of Nov. 5. The event will feature performances by Gorilla, Flo Milli, MC Late, The Isley Brothers and DJ …",
    "url": "http://deadline.com/2024/10/cardi-b-kamala-harris-rally-1236163350/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2021/11/Cardi-B.jpg?w=1024",
    "publishedAt": "2024-10-31T15:29:27Z",
    "content": "Cardi B will make remarks at a Milwaukee rally with Kamala Harris on Friday, as the vice president’s campaign makes its final get-out-the-vote push ahead of Nov. 5.\r\nThe event will feature performanc… [+1098 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Armando Tinoco",
    "title": "‘The Avengers’ Reunite: Scarlett Johansson, Chris Evans & Robert Downey Jr. & More Marvel Stars Endorse Kamala Harris Against Donald Trump",
    "description": "Scarlett Johansson made a call and assembled The Avengers to defeat Donald Trump in the upcoming presidential election and vote for Kamala Harris. In a video shared by Mark Ruffalo, the Hulk in the Marvel Cinematic Universe, the actors expressed their support…",
    "url": "http://deadline.com/2024/10/the-avengers-reunion-scarlett-johansson-chris-evans-robert-downey-jr-marvel-stars-endorse-kamala-harris-donald-trump-1236163988/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/the-avengers-kamala-harris.jpg?w=1024",
    "publishedAt": "2024-10-31T23:25:44Z",
    "content": "Scarlett Johansson made a call and assembled The Avengers to defeat Donald Trump in the upcoming presidential election and vote for Kamala Harris.\r\nIn a video shared by Mark Ruffalo, the Hulk in the … [+1388 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "LeBron James Endorses Kamala Harris In 2024 Presidential Race: “Hate Takes Us Back”",
    "description": "NBA superstar LeBron James endorsed Kamala Harris for president, posting on Instagram that the “choice is clear” in the election. This afternoon, James posted a video of Donald Trump using extreme and violent rhetoric. The video also included a clip of comedi…",
    "url": "http://deadline.com/2024/10/lebron-james-endorses-kamala-harris-1236163862/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/08/GettyImages-2164650363.jpg?w=1024",
    "publishedAt": "2024-10-31T21:26:43Z",
    "content": "NBA superstar LeBron James endorsed Kamala Harris for president, posting on Instagram that the “choice is clear” in the election.\r\nThis afternoon, James posted a video of Donald Trump using extreme a… [+1110 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "Donald Trump Tries To Command News Cycle With Lawsuit Against CBS Over Kamala Harris’ ’60 Minutes’ Interview",
    "description": "In the waning days of the presidential campaign, Donald Trump has sued CBS over the way that 60 Minutes edited an interview with Kamala Harris. The lawsuit, filed in U.S. District Court in Amarillo, TX, seeks $10 billion in damages and is just the latest liti…",
    "url": "http://deadline.com/2024/10/trump-cbs-lawsuit-60-minutes-kamala-harris-1236163916/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/kamala-harris-donald-trump.jpg?w=1024",
    "publishedAt": "2024-10-31T22:52:08Z",
    "content": "In the waning days of the presidential campaign, Donald Trump has sued CBS over the way that 60 Minutesedited an interview with Kamala Harris. \r\nThe lawsuit, filed in U.S. District Court in Amarillo,… [+4332 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Glenn Garner",
    "title": "Doug Emhoff To Appear On MSNBC’s ‘Last Word with Lawrence O’Donnell’ From Nevada",
    "description": "As Kamala Harris reaches the final stretch of her presidential campaign, husband Doug Emhoff is meeting the press. The second gentleman will appear Friday at 10pm ET on MSNBC for an interview on The Last Word with Lawrence O’Donnell about the stakes of the ra…",
    "url": "http://deadline.com/2024/10/doug-emhoff-appear-msnbc-last-word-lawrence-odonnell-nevada-1236163037/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2023/07/GettyImages-1258492236-e1730341344904.jpg?w=1024",
    "publishedAt": "2024-10-31T02:55:08Z",
    "content": "As Kamala Harris reaches the final stretch of her presidential campaign, husband Doug Emhoff is meeting the press.\r\nThe second gentleman will appear Friday at 10pm ET on MSNBC for an interview on The… [+1672 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Katie Campione",
    "title": "‘Grotesquerie’ Star Niecy Nash-Betts Unpacks Finale, Shares Hopes For Season 2 & Explains Why Lois Is “One And The Same” With VP Kamala Harris",
    "description": "SPOILER ALERT! This post contains details from the finale of FX’s Grotesquerie. It looks like Lois may never be making it to Florida after all. The finale of FX’s Grotesquerie felt, in some ways, like the 10 episodes came full circle, with Niecy Nash-Betts pu…",
    "url": "http://deadline.com/2024/10/grotesquerie-finale-recap-niecy-nash-betts-interview-season-2-hopes-1236162592/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/pre_3276ba8adae8177fe4770231cf1e599d.jpg?w=1000",
    "publishedAt": "2024-10-31T03:18:00Z",
    "content": "SPOILER ALERT! This post contains details from the finale of FX‘s Grotesquerie.\r\nIt looks like Lois may never be making it to Florida after all.\r\nThe finale of FX’s Grotesquerie felt, in some ways, l… [+9332 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Malcolm Ferguson",
    "title": "MAGA Men Are Freaking Out Over Their Wives Secretly Voting for Harris",
    "description": "MAGA is seething at the possibility of their wives voting for Vice President Kamala Harris.\r\nThis narrative took off after Liz Cheney urged women to “vote your conscience,” even if it meant keeping their vote for Harris a “secret” from their Trump-supporting …",
    "url": "https://newrepublic.com/post/187767/maga-men-jesse-waters-meltdown-wives-secretly-voting-harris",
    "urlToImage": "https://images.newrepublic.com/47a696fae60dda64a3ed172611126639c2279800.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T17:29:46Z",
    "content": "But Kennedysand by extension, Lutnicksflagrant vaccine claims are plainly false. Dozens of vaccines had been invented by 1954, when Kennedy was born, preventing the societal spread of horrific illnes… [+1018 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Ellie Quinlan Houghtaling",
    "title": "Trump Gets Shocking News From Double Whammy of Poll Results",
    "description": "Just days out from Election Day, Donald Trump still doesn’t have the votes to reclaim the White House—at least, that’s according to data reportedly obtained by his campaign.\r\nDuring a CNN roundtable Wednesday night, Republican strategist Margaret Hoover claim…",
    "url": "https://newrepublic.com/post/187751/donald-trump-shocking-news-poll-results",
    "urlToImage": "https://images.newrepublic.com/2d916a53ab5cfe78e0637a110812e6ca52e4296b.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T13:51:43Z",
    "content": "The plan sounds strikingly similar to that of Musk and Trumps friend Javier Milei of Argentina. When campaigning for president, Milei promised to take a chainsaw to the state, cut public spending on … [+1001 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "The Daily Blast with Greg Sargent",
    "title": "Transcript: Angry Trump Starts Blame Game as Polls Reveal New Problem",
    "description": "The following is a lightly edited transcript of the October 31 episode of The Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nDonald…",
    "url": "https://newrepublic.com/article/187741/transcript-angry-trump-starts-blame-game-polls-reveal-new-problem",
    "urlToImage": "https://images.newrepublic.com/4950db5ab322f2425dc6040969bd931713af6745.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T10:23:08Z",
    "content": "As an African American political consultant, Ill say, I think thats good. I think its good that those voters are being treated as a persuasion universe, but that presents a challenge now for Democrat… [+1521 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Malcolm Ferguson",
    "title": "Trump Slammed for Sinister Vow: “Whether the Women Like It or Not”",
    "description": "Former President Donald Trump took his promise to protect women to a creepy new level Wednesday evening, claiming he’d do so “whether the women like it or not.” \r\nWearing an orange garbage collector vest from a failed photo-op earlier in the day, Trump, speak…",
    "url": "https://newrepublic.com/post/187752/trump-protect-women-whether-like-it-or-not",
    "urlToImage": "https://images.newrepublic.com/cddf3c21a101e58bce0f7ab9d828d97b9e8f97ef.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T14:28:08Z",
    "content": "Giuliani was ordered in December to pay nearly $150 million in damages to Freeman and Moss. Since then, the former Trump attorney unsuccessfully filed for bankruptcy, lost his accountant over his ins… [+1339 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Melissa Gira Grant",
    "title": "Got a Problem? The GOP Has Someone to Blame.",
    "description": "In\nRepublican political ads this election year, there is a scapegoat no matter the\ntopic. The same scapegoats—often trans people, immigrants, or both—are blamed for incredibly divergent issues. The ads paint the scapegoated group as\na menace that Democrats ha…",
    "url": "https://newrepublic.com/article/187738/gop-attack-ads-trans-immigrants",
    "urlToImage": "https://images.newrepublic.com/a73bf8d379539e769c5cc48a53f5338d5b41f7c3.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T10:00:00Z",
    "content": "This\r\nappeal to my pocket, or your money is a consistent theme in these ads.\r\nThats usually overlooked when the ads are interpreted as just more MAGA\r\nculture war. The ads use trans people and immigr… [+2051 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Jay Willis",
    "title": "Jeff Bezos Doesn’t Understand That He Is the Problem",
    "description": "Late last week, The Washington Post announced that its editorial board would not endorse a candidate in the 2024 presidential election—which, let’s recall, pits Kamala Harris, the sitting vice president and a fairly mainstream Democrat, against Donald Trump, …",
    "url": "https://newrepublic.com/article/187685/jeff-bezos-journalism-washington-post",
    "urlToImage": "https://images.newrepublic.com/2c033f7b60f76ece8ad157ca5c6e8e5670006dd6.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T10:00:00Z",
    "content": "On Monday evening, Bezos made his second-dumbest decision of the week, publishing a bylined column on the Posts website to explain why readers need not be concerned about a tech billionaire meddling … [+2033 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Alex Shephard",
    "title": "Move Over, JD Vance. Trump Has a New, Even Weirder Running Mate.",
    "description": "I would like to apologize to JD Vance. He is not, it turns out, the weirdest member of Trump’s reelection campaign.\r\nIn late July, I described the Ohio senator as not only the worst running mate Trump could have picked, but perhaps the worst in history. Vance…",
    "url": "https://newrepublic.com/article/187740/trump-running-mate-elon-musk-weirder-jd-vance",
    "urlToImage": "https://images.newrepublic.com/0dc9c0accf885d338a806c5ab4c176b3ce4939d7.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T10:00:00Z",
    "content": "Elon Musk jumps on stage pic.twitter.com/ox6jyTrseH\r\n Acyn (@Acyn) October 5, 2024\r\nMore substantively, Musk has been dogged by a number of stories showing him to be a off-putting creep. An advocate … [+2610 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Benjamin Hett",
    "title": "Wanna Take a Guess Who Trump-Backing Businessmen Sound Like?",
    "description": "On the afternoon of February 20, 1933, Adolf Hitler met with Germany’s business leaders. Among the two dozen executives present was Gustav Krupp von Bohlen, head of the legendary eponymous maker of steel and armaments. There was car manufacturer Fritz von Ope…",
    "url": "https://newrepublic.com/article/187668/trump-businessmen-sound-like-germany-hitler",
    "urlToImage": "https://images.newrepublic.com/6868a76713cf289bb388a05d60f5bbb7361bd022.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T10:00:00Z",
    "content": "It was business leaders who negotiated the deal that brought Hitler to power in 1933. The banker Kurt von Schröder arranged crucial negotiations between Hitler and Franz von Papen, the former chancel… [+1284 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "David Daley",
    "title": "How John Roberts—Yes, John Roberts—Might Decide Who Won the Election",
    "description": "Last summer, after the Supreme Court appeared to brush aside a fringe theory that would have given gerrymandered GOP legislatures unfettered power over election procedures, progressive activists at Common Cause hailed a “historic pro-democracy decision.” MSNB…",
    "url": "https://newrepublic.com/article/187699/john-roberts-supreme-court-decide-2024-election",
    "urlToImage": "https://images.newrepublic.com/005d2f57372cf906ea7714565f5a9961355b189a.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T10:00:00Z",
    "content": "In other words, here is a high court conservative majoritywhich, by the way, includes three lawyers who helped develop and argue George W. Bushs case in Bush v. Goreannouncing that it can put its thu… [+1559 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "The Daily Blast with Greg Sargent",
    "title": "Angry Trump Starts Blame Game as Polls Reveal Big New Problem for Him",
    "description": "The presidential race is tied, and Donald Trump very well could win. But he is now scapegoating others for a possible loss: He’s reportedly angry with Republican National Committee chair Michael Whatley, he’s raging about supposed voter fraud in Pennsylvania,…",
    "url": "https://newrepublic.com/article/187730/angry-trump-starts-blame-game-polls-reveal-big-new-problem",
    "urlToImage": "https://images.newrepublic.com/0f835065163f7fe86bc94314780165c6b610bfaf.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T09:00:00Z",
    "content": "The presidential race is tied, and Donald Trump very well could win. But he is now scapegoating others for a possible loss: Hes reportedly angry with Republican National Committee chair Michael Whatl… [+515 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Paige Oamek",
    "title": "Trump Media Stock Crashes in Sign of Struggling Election Prospects",
    "description": "Are Wall Street traders planning for a Kamala Harris win? \r\nTrump Media & Technology Group stock was halted twice Thursday morning as its value dropped nearly 14 percent. Just the day before, the stock plummeted more than 20 percent after a multiweek rise, de…",
    "url": "https://newrepublic.com/post/187772/donald-trump-media-stock-election",
    "urlToImage": "https://images.newrepublic.com/f1c0286aace2d1126295bfbf9019e0bf4a3282ec.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-31T19:27:17Z",
    "content": "Musk was initially required to appear in court in Pennsylvania on Thursday but didnt show up. Fogliettas ruling not only overrules that requirement, but it allows the tech moguls America PAC to conti… [+939 chars]"
  },
  {
    "source": { "id": "cbc-news", "name": "CBC News" },
    "author": null,
    "title": "Harris casts Trump as threat to democracy in final pitch to voters. Will they listen?",
    "description": "In the final week before Americans vote, Kamala Harris is highlighting the threat she says Donald Trump poses to U.S. democracy. But some observers, including some Democrats, have questioned whether that should be the focus of the remainder of the presidentia…",
    "url": "https://www.cbc.ca/news/world/kamala-harris-closing-trump-1.7367797",
    "urlToImage": "https://i.cbc.ca/1.7368430.1730319240!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/election-2024-harris.jpg",
    "publishedAt": "2024-10-31T08:00:00Z",
    "content": "Policy positions are one thing, and Kamala Harris trotted out many in her \"closing argument\" campaign speech Tuesday night.\r\nBut in politics, the most important thing is symbolism, says Cornell Belch… [+6700 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Andy J. Semotiuk, Contributor, \n Andy J. Semotiuk, Contributor\n https://www.forbes.com/sites/andyjsemotiuk/",
    "title": "Trump Vs. Harris On Immigration Deportation Or Path To Citizenship?",
    "description": "Donald Trump pledges to deport all immigrants within the U.S. without legal status. Kamala Harris calls for a Path to Citizenship for them. Who is right?",
    "url": "https://www.forbes.com/sites/andyjsemotiuk/2024/10/31/trump-vs-harris-on-immigration----deportation-or-path-to-citizenship/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6722da353dbd30c7143d6444/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-31T11:09:43Z",
    "content": "US Vice President and Democratic presidential candidate Kamala Harris (R) shakes hands with former ... [+] US President and Republican presidential candidate Donald Trump during a presidential debate… [+3918 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Emily Baker-White, Forbes Staff, \n Emily Baker-White, Forbes Staff\n https://www.forbes.com/sites/emilybaker-white-1/",
    "title": "Facebook Took More Than $1 Million For Ads Sowing Election Lies",
    "description": "The ads, live as of today, falsely claimed that Democrats plan to postpone the election and insinuated that Vice President Kamala Harris might drop out of the race.",
    "url": "https://www.forbes.com/sites/emilybaker-white/2024/10/30/facebook-ads-election-misinformation/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6722af66033aa1984bfb0e09/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-31T10:30:00Z",
    "content": "In 2020, Mark Zuckerberg and his wife, Priscilla Chan, donated hundreds of millions to support election integrity efforts. The billionaire couple does not appear to have continued their giving this c… [+4811 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Molly Bohannon, Forbes Staff, \n Molly Bohannon, Forbes Staff\n https://www.forbes.com/sites/mollybohannon/",
    "title": "Trump Says He ‘Never Even Thought About’ Ending Obamacare—Despite Signing Measure Backing Its Repeal",
    "description": "Former President Donald Trump called Vice President Kamala Harris a liar for saying he wanted to repeal the Affordable Care Act, despite him making multiple attempts to do so while in office.",
    "url": "https://www.forbes.com/sites/mollybohannon/2024/10/31/trump-says-he-never-even-thought-about-ending-obamacare-despite-signing-measure-backing-its-repeal/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6705765b4f6e0362b46e93c5/0x0.jpg?format=jpg&crop=3000,1688,x0,y68,safe&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-31T17:23:58Z",
    "content": "Former President Donald Trump accused Vice President Kamala Harris of lying when she said he sought to end the Affordable Care Act, saying in a post on Truth Social on Thursday that he never mentione… [+3810 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Kristin Hunt, Forbes Staff, \n Kristin Hunt, Forbes Staff\n https://www.forbes.com/",
    "title": "Here Are The Billionaires Donating To Kamala Harris' Super PAC | Forbes Topline",
    "description": "After emphasizing bipartisanship and staying away from big political donations for decades, Bill Gates recently donated about $50 million to the nonprofit arm of a super PAC supporting Kamala Harris, the New York Times reported on Tuesday. He?s far from the o…",
    "url": "https://www.forbes.com/video/e09c6371-10c5-464b-ae9d-cabba410fbd6/here-are-the-billionaires-donating-to-kamala-harris-super-pac--forbes-topline/",
    "urlToImage": "https://imageio.forbes.com/i-forbesimg/media/video/2024/10/31/e09c6371-10c5-464b-ae9d-cabba410fbd6_thumb.jpg?format=jpg&height=460&width=800&fit=bounds",
    "publishedAt": "2024-10-31T19:20:18Z",
    "content": "After emphasizing bipartisanship and staying away from big political donations for decades, Bill Gates recently donated about $50 million to the nonprofit arm of a super PAC supporting Kamala Harris,… [+84 chars]"
  },
  {
    "source": { "id": null, "name": "Project Syndicate" },
    "author": "Sandeep Vaheesan",
    "title": "How Antitrust Can Advance Kamala Harris’s Small-Business Agenda",
    "description": "The US Federal Trade Commission has long treated cooperation among independent businesses as an illegal restraint of trade, and thus no different from collusion among large corporations. If Kamala Harris wins the US presidential election in November, that mus…",
    "url": "https://www.project-syndicate.org/commentary/kamala-harris-small-business-agenda-requires-antitrust-action-by-sandeep-vaheesan-2024-10",
    "urlToImage": "https://webapi.project-syndicate.org/library/737edfdae98ce1f3c0b3085ed7e929e7.2-1-super.1.jpg",
    "publishedAt": "2024-10-31T12:43:10Z",
    "content": "The US Federal Trade Commission has long treated cooperation among independent businesses as an illegal restraint of trade, and thus no different from collusion among large corporations. If Kamala Ha… [+6156 chars]"
  },
  {
    "source": { "id": null, "name": "Democracy Now!" },
    "author": "webdev@democracynow.org (Democracy Now!)",
    "title": "Bishop William Barber Endorses Harris, Says Faith Leaders Must Oppose Trump's Hate",
    "description": "“There can be no middle ground, not in this moment.” As the U.S. presidential race draws to a close, Bishop William Barber, the national co-chair of the Poor People’s Campaign, founding director of the Center for Public Theology and Public Policy at Yale Divi…",
    "url": "https://www.democracynow.org/2024/10/31/2024_election",
    "urlToImage": "https://www.democracynow.org/images/story/92/74392/full_hd/Seg2-revandharris.jpg",
    "publishedAt": "2024-10-31T12:43:47Z",
    "content": "This is viewer supported news. Please do your part today.\r\nDonate\r\n“There can be no middle ground, not in this moment.” As the U.S. presidential race draws to a close, Bishop William Barber, the nati… [+648 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "aol.com",
    "title": "Trump sues CBS over Kamala Harris interview",
    "description": "Republican presidential candidate Donald Trump sued CBS on Thursday over an interview of his Democratic rival Kamala Harris aired in early October that the lawsuit alleged was \"doctored\" and misleading, according to a court filing.\nThe filing was made in the …",
    "url": "https://biztoc.com/x/54b6115c0aea71db",
    "urlToImage": "https://biztoc.com/cdn/54b6115c0aea71db_s.webp",
    "publishedAt": "2024-10-31T21:13:34Z",
    "content": "Republican presidential candidate Donald Trump sued CBS on Thursday over an interview of his Democratic rival Kamala Harris aired in early October that the lawsuit alleged was \"doctored\" and misleadi… [+146 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Map Shows Kamala Harris and Donald Trump's Final Campaign Stops",
    "description": "In the final days leading up to the November 5 election, both Vice President Kamala Harris and former President Donald Trump are making critical campaign stops in battleground states, fighting for every last undecided voter.\nThere is a broad feeling of uncert…",
    "url": "https://biztoc.com/x/1f37336121d801d2",
    "urlToImage": "https://biztoc.com/cdn/1f37336121d801d2_s.webp",
    "publishedAt": "2024-10-31T17:59:15Z",
    "content": "In the final days leading up to the November 5 election, both Vice President Kamala Harris and former President Donald Trump are making critical campaign stops in battleground states, fighting for ev… [+139 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "How Mormons Could Be Kamala Harris' Secret Weapon in Arizona",
    "description": "Traditionally conservative members of the Church of Latter-day Saints in Arizona are being turned off from former President Donald Trump, in part because of his language around immigrants.\nWith around 400,000 Mormons in the battleground state — roughly 6 perc…",
    "url": "https://biztoc.com/x/ae996b832384dd6c",
    "urlToImage": "https://biztoc.com/cdn/ae996b832384dd6c_s.webp",
    "publishedAt": "2024-10-31T19:47:26Z",
    "content": "Traditionally conservative members of the Church of Latter-day Saints in Arizona are being turned off from former President Donald Trump, in part because of his language around immigrants.With around… [+141 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "youtube.com",
    "title": "What could a #Trump presidency mean for inflation? #election",
    "description": "While major polls show Donald Trump and Kamala Harris deadlocked, Wall Street has become increasingly convinced Trump is ...",
    "url": "https://biztoc.com/x/acab08580d945406",
    "urlToImage": "https://biztoc.com/cdn/acab08580d945406_s.webp",
    "publishedAt": "2024-10-31T10:51:21Z",
    "content": "While major polls show Donald Trump and Kamala Harris deadlocked, Wall Street has become increasingly convinced Trump is ...\r\nThis story appeared on youtube.com, 2024-10-31 10:00:28."
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "breakingthenews.net",
    "title": "Trump says Harris will 'crack' under pressure",
    "description": "Republican presidential candidate Donald Trump labeled Kamala Harris, the Democratic nominee and current vice president, as a \"trainwreck\" and \"unqualified\" to be the next president of the United Stat...",
    "url": "https://biztoc.com/x/8e7dfeae0d1d939f",
    "urlToImage": "https://biztoc.com/cdn/8e7dfeae0d1d939f_s.webp",
    "publishedAt": "2024-10-31T19:47:15Z",
    "content": "Republican presidential candidate Donald Trump labeled Kamala Harris, the Democratic nominee and current vice president, as a \"trainwreck\" and \"unqualified\" to be the next president of the United Sta… [+69 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Will Taylor Swift Appear at Kamala Harris' Pennsylvania Rally? What We Know",
    "description": "Rumors are circulating on social media that Taylor Swift could appear at a rally that Vice President Kamala Harris is reportedly holding in Pennsylvania on the eve of Election Day.\nHarris will be holding a rally in front of the iconic Philadelphia Museum of A…",
    "url": "https://biztoc.com/x/b38e8d7820cd6318",
    "urlToImage": "https://biztoc.com/cdn/b38e8d7820cd6318_s.webp",
    "publishedAt": "2024-10-31T15:17:08Z",
    "content": "Rumors are circulating on social media that Taylor Swift could appear at a rally that Vice President Kamala Harris is reportedly holding in Pennsylvania on the eve of Election Day.Harris will be hold… [+134 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Final Poll Flips to Donald Trump in Four-Point Swing From Kamala Harris",
    "description": "Donald Trump has overtaken Kamala Harris in the final DailyMail.com/J.L. Partners national poll before Election Day, with a three-point lead over the vice president.\nThe poll, released Thursday, showed Trump with 49 percent support among likely voters, while …",
    "url": "https://biztoc.com/x/fe71f71f2048055a",
    "urlToImage": "https://biztoc.com/cdn/fe71f71f2048055a_s.webp",
    "publishedAt": "2024-10-31T17:48:06Z",
    "content": "Donald Trump has overtaken Kamala Harris in the final DailyMail.com/J.L. Partners national poll before Election Day, with a three-point lead over the vice president.The poll, released Thursday, showe… [+139 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "nbcnews.com",
    "title": "Progressives gear up for their first big fight if Harris wins: Protecting Lina Khan",
    "description": "Progressives are promising a big fight if Kamala Harris removes FTC Chair Lina Khan, who has gone after Amazon and Facebook.",
    "url": "https://biztoc.com/x/88c01de4b6cac1d4",
    "urlToImage": "https://biztoc.com/cdn/88c01de4b6cac1d4_s.webp",
    "publishedAt": "2024-10-31T15:16:38Z",
    "content": "Progressives are promising a big fight if Kamala Harris removes FTC Chair Lina Khan, who has gone after Amazon and Facebook.\r\nThis story appeared on nbcnews.com, 2024-10-31 14:34:05."
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "today.yougov.com",
    "title": "Donald Trump leads on immigration and inflation, Kamala Harris on abortion and health care",
    "description": "A recent poll finds that Americans think Kamala Harris would do a far better job handling LGBTQ issues and abortion while Trump would do a much better job handling immigration and the Israeli-Palestinian conflict.",
    "url": "https://biztoc.com/x/22424739826aa8cb",
    "urlToImage": "https://biztoc.com/cdn/22424739826aa8cb_s.webp",
    "publishedAt": "2024-10-31T18:09:41Z",
    "content": "A recent poll finds that Americans think Kamala Harris would do a far better job handling LGBTQ issues and abortion while Trump would do a much better job handling immigration and the Israeli-Palesti… [+76 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Graph Shows Arnold Schwarzenegger's Following Spike After Harris Endorsement",
    "description": "Arnold Schwarzenegger has seen a spike in followers on X, formerly Twitter, the day after he endorsed Kamala Harris.\nOn Wednesday, Schwarzenegger posted a lengthy comment saying he \"hates politics\" now, but has come out publicly to endorse Harris and Walz bec…",
    "url": "https://biztoc.com/x/ba4001a77220f21b",
    "urlToImage": "https://biztoc.com/cdn/ba4001a77220f21b_s.webp",
    "publishedAt": "2024-10-31T15:06:07Z",
    "content": "Arnold Schwarzenegger has seen a spike in followers on X, formerly Twitter, the day after he endorsed Kamala Harris.On Wednesday, Schwarzenegger posted a lengthy comment saying he \"hates politics\" no… [+142 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "cnn.com",
    "title": "Is The US Economy A Reno Project Or A Tear Down?",
    "description": "Vice President Kamala Harris wants to renovate the American economy. Former President Donald Trump’s economic vision amounts to knocking it down and rebuilding it from the ground up.\nThe Harris economic agenda calls for modest improvements designed to make li…",
    "url": "https://biztoc.com/x/687d343535b1289a",
    "urlToImage": "https://biztoc.com/cdn/687d343535b1289a_s.webp",
    "publishedAt": "2024-10-31T18:52:52Z",
    "content": "Vice President Kamala Harris wants to renovate the American economy. Former President Donald Trumps economic vision amounts to knocking it down and rebuilding it from the ground up.The Harris economi… [+144 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "breakingthenews.net",
    "title": "Harris: Trump to walk in with enemies list, I'll have to-do list",
    "description": "United States Vice President Kamala Harris said on Thursday speaking at an Arizona rally that if former President Donald Trump were to be elected again, on day one, he would walk into the Oval Office ...",
    "url": "https://biztoc.com/x/740b19f17059e8b0",
    "urlToImage": "https://biztoc.com/cdn/740b19f17059e8b0_s.webp",
    "publishedAt": "2024-10-31T21:13:48Z",
    "content": "United States Vice President Kamala Harris said on Thursday speaking at an Arizona rally that if former President Donald Trump were to be elected again, on day one, he would walk into the Oval Office… [+69 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Clip of Trump Calling Harris Allies 'Scum' and 'Garbage' Resurfaces",
    "description": "A video of Donald Trump calling people close to Kamala Harris \"garbage\" has resurfaced after Trump criticized Joe Biden for using the same word against Trump supporters.\nThe clip was posted on X, formerly Twitter, by the anti-Trump conservative group The Linc…",
    "url": "https://biztoc.com/x/76c39c7f5d418c44",
    "urlToImage": "https://biztoc.com/cdn/76c39c7f5d418c44_s.webp",
    "publishedAt": "2024-10-31T14:33:32Z",
    "content": "A video of Donald Trump calling people close to Kamala Harris \"garbage\" has resurfaced after Trump criticized Joe Biden for using the same word against Trump supporters.The clip was posted on X, form… [+140 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "JD Vance Trolls Kamala Harris With One of Her Favorite Lines",
    "description": "Ohio Senator JD Vance opened a town hall in North Carolina with a line parodying one of Vice President Kamala Harris' frequent remarks in public speeches.\n\"I grew up in a working-class family,\" the Republican vice presidential candidate began, pausing with a …",
    "url": "https://biztoc.com/x/3aebdb210384bbe4",
    "urlToImage": "https://biztoc.com/cdn/3aebdb210384bbe4_s.webp",
    "publishedAt": "2024-10-31T18:52:53Z",
    "content": "Ohio Senator JD Vance opened a town hall in North Carolina with a line parodying one of Vice President Kamala Harris' frequent remarks in public speeches.\"I grew up in a working-class family,\" the Re… [+145 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "cnbc.com",
    "title": "Kamala Harris could make history as America’s first woman president: What do women think about it?",
    "description": "We're days away from what could be a historic election, in a highly unusual campaign season.\nAmerica could get its first female president in Kamala Harris, a late entrant to the race. But unlike in 2016, when Hillary Clinton was the Democratic nominee for the…",
    "url": "https://biztoc.com/x/d138730cb79deadc",
    "urlToImage": "https://biztoc.com/cdn/d138730cb79deadc_s.webp",
    "publishedAt": "2024-10-31T18:09:34Z",
    "content": "We're days away from what could be a historic election, in a highly unusual campaign season.America could get its first female president in Kamala Harris, a late entrant to the race. But unlike in 20… [+140 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Kamala Harris Would Be Least Popular Democrat to Win Election in 64 Years",
    "description": "The vice president has also the highest unfavorable view by an opposing party.",
    "url": "https://biztoc.com/x/e64b19edefecdf49",
    "urlToImage": "https://biztoc.com/cdn/807/og.png",
    "publishedAt": "2024-10-31T19:47:10Z",
    "content": "The vice president has also the highest unfavorable view by an opposing party.\r\nThis story appeared on newsweek.com, 2024-10-31 19:36:34."
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "benzinga.com",
    "title": "Trump, Harris And Cannabis Stocks: Are Election Results Already Priced In?",
    "description": "The U.S. heads into another historical election, the outcome of which will have an effect on cannabis stocks.\nWith both major candidates, Donald Trump and Kamala Harris, supporting cannabis reform, investors are closely watching the sector. These past few day…",
    "url": "https://biztoc.com/x/dce55cb308925f98",
    "urlToImage": "https://biztoc.com/cdn/dce55cb308925f98_s.webp",
    "publishedAt": "2024-10-31T15:16:38Z",
    "content": "The U.S. heads into another historical election, the outcome of which will have an effect on cannabis stocks.With both major candidates, Donald Trump and Kamala Harris, supporting cannabis reform, in… [+144 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "youtube.com",
    "title": "Harris Rips Trump’s Vow to Protect Women Whether They ‘Like It Or Not’",
    "description": "Vice President Kamala #Harris seized on a remark from Donald #Trump that he would “protect” women if elected, whether they “like it or not” to assail her #Republican rival’s stance on reproductive rights and other freedoms in an appeal to suburban and indepen…",
    "url": "https://biztoc.com/x/ae7db14e5a79ef05",
    "urlToImage": "https://biztoc.com/cdn/ae7db14e5a79ef05_s.webp",
    "publishedAt": "2024-10-31T18:20:35Z",
    "content": "Vice President Kamala #Harris seized on a remark from Donald #Trump that he would protect women if elected, whether they like it or not to assail her #Republican rivals stance on reproductive rights … [+133 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Mark Cuban's Trump Women Remark Sparks MAGA Rage: 'Profoundly Offensive'",
    "description": "Mark Cuban, supporter of Vice President Kamala Harris, is being ripped by the Trump campaign after saying the former president is never surrounded by \"strong, intelligent women.\"\nThe comments were made during Thursday's episode of ABC's The View after former …",
    "url": "https://biztoc.com/x/5c0aaa7efa945242",
    "urlToImage": "https://biztoc.com/cdn/5c0aaa7efa945242_s.webp",
    "publishedAt": "2024-10-31T19:36:36Z",
    "content": "Mark Cuban, supporter of Vice President Kamala Harris, is being ripped by the Trump campaign after saying the former president is never surrounded by \"strong, intelligent women.\"The comments were mad… [+140 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "aol.com",
    "title": "America won the war on inflation. You still think the economy stinks",
    "description": "Inflation has been tamed. Consumers are spending like crazy. Companies have more jobs available than job seekers to fill them. What more could you want, America?\nThat may well be Vice President Kamala Harris’ inner monologue. The US economy is undeniably on f…",
    "url": "https://biztoc.com/x/3d6934c801232e7f",
    "urlToImage": "https://biztoc.com/cdn/3d6934c801232e7f_s.webp",
    "publishedAt": "2024-10-31T17:59:15Z",
    "content": "Inflation has been tamed. Consumers are spending like crazy. Companies have more jobs available than job seekers to fill them. What more could you want, America?That may well be Vice President Kamala… [+146 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Democrat Voter Enthusiasm Ahead of Republicans by Double-Digits: Poll",
    "description": "Polling data just days before the U.S. presidential election has found a voter enthusiasm gap between Republicans and Democrats, with Vice President Kamala Harris more likely to benefit.\nGallup polling released on Thursday showed that while early voting has d…",
    "url": "https://biztoc.com/x/6933b18fc7226e0b",
    "urlToImage": "https://biztoc.com/cdn/6933b18fc7226e0b_s.webp",
    "publishedAt": "2024-10-31T19:36:23Z",
    "content": "Polling data just days before the U.S. presidential election has found a voter enthusiasm gap between Republicans and Democrats, with Vice President Kamala Harris more likely to benefit.Gallup pollin… [+146 chars]"
  },
  {
    "source": { "id": null, "name": "ProPublica" },
    "author": "by Max Nesterak, Minnesota Reformer, and Jessica Lussenhop, ProPublica",
    "title": "In Minnesota, the Mayo Clinic Sometimes Called the Shots With Gov. Tim Walz",
    "description": "by Max Nesterak, Minnesota Reformer, and Jessica Lussenhop, ProPublica \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in…",
    "url": "https://www.propublica.org/article/tim-walz-mayo-clinic-health-care-influence-election-minnesota",
    "urlToImage": "https://img.assets-d.propublica.org/v5/images/Walz-Mayo-Clinic_preview_maxWidth_3000_maxHeight_3000_ppi_72_embedColorProfile_true_quality_951_2024-10-30-194103_sahu.jpg?crop=focalpoint&fit=crop&fp-x=0.4419&fp-y=0.3879&h=630&imgixProfile=propublicaAssetsV5&q=90&w=1200&s=9fcb2685369c4d01a2e03b38d270ba49",
    "publishedAt": "2024-10-31T10:00:00Z",
    "content": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every we… [+16524 chars]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-31T13:26:12Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-31T16:40:33Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "BlazeTV Staff",
    "title": "‘As a mother,’ Beyoncé loves abortion",
    "description": "While both the Trump and Harris campaigns have been focusing their efforts in the swing states, they’ve also put some serious time into Texas, which unfortunately is no longer reliably red. In fact, it’s been trending blue for a while now — and Democrats want…",
    "url": "https://www.theblaze.com/shows/relatable/as-a-mother-beyonce-loves-abortion",
    "urlToImage": "https://www.theblaze.com/media-library/image.jpg?id=54089947&width=1200&height=600&coordinates=0%2C0%2C0%2C120",
    "publishedAt": "2024-10-31T18:30:00Z",
    "content": "While both the Trump and Harris campaigns have been focusing their efforts in the swing states, theyve also put some serious time into Texas, which unfortunately is no longer reliably red. In fact, i… [+2401 chars]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "Ryan Rhodes",
    "title": "Trump’s authenticity reshapes 2024 race as early votes pour in",
    "description": "As a grassroots consultant who played a key role in campaigns across the years, including my firm’s work knocking on millions of doors and being an essential player in Dr. Ben Carson’s 2016 presidential campaign, I have seen my share of election cycles. We ha…",
    "url": "https://www.theblaze.com/columns/opinion/trumps-authenticity-reshapes-2024-race-as-early-votes-pour-in",
    "urlToImage": "https://www.theblaze.com/media-library/trumps-authenticity-reshapes-2024-race-as-early-votes-pour-in.jpg?id=54024581&width=1200&height=600&coordinates=0%2C85%2C0%2C86",
    "publishedAt": "2024-10-31T00:30:00Z",
    "content": "As a grassroots consultant who played a key role in campaigns across the years, including my firms work knocking on millions of doors and being an essential player in Dr. Ben Carsons 2016 presidentia… [+4888 chars]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "Christian Toto",
    "title": "Frat guy to DEI: Will Ferrell's unfunny fall",
    "description": "Comedians defending comedy, what a concept (with apologies to Mork from Ork)!This week, it’s Jon Stewart’s turn.Will Ferrell is on a mission – crush all the goodwill he generated with 20+ years of great big-screen comedies like 'Elf,' 'Old School,' and 'Step …",
    "url": "https://www.theblaze.com/align/frat-guy-to-dei-will-ferrell-s-unfunny-fall",
    "urlToImage": "https://www.theblaze.com/media-library/frat-guy-to-dei-will-ferrell-s-unfunny-fall.jpg?id=54087454&width=1200&height=600&coordinates=0%2C90%2C0%2C91",
    "publishedAt": "2024-10-31T01:00:00Z",
    "content": "Comedians defending comedy, what a concept (with apologies to Mork from Ork)!\r\nThis week, its Jon Stewarts turn.\r\nWill Ferrell is on a mission crush all the goodwill he generated with 20+ years of gr… [+4160 chars]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "Andrew Chapados",
    "title": "Puerto Rican NFL player defends Trump rally joke, says liberal outrage is only for political gain",
    "description": "San Francisco 49ers offensive lineman Jon Feliciano said those claiming to be offended by a joke about Puerto Rico at a Donald Trump rally are pushing an agenda.During Trump's star-studded rally at Madison Square Garden, roast comedian Tony Hinchcliffe caused…",
    "url": "https://www.theblaze.com/news/49ers-jon-feliciano-tony-hinchcliffe",
    "urlToImage": "https://www.theblaze.com/media-library/puerto-rican-nfl-player-defends-trump-rally-joke-says-liberal-outrage-is-only-for-political-gain.jpg?id=54091838&width=1200&height=600&coordinates=0%2C3%2C0%2C168",
    "publishedAt": "2024-10-31T15:40:00Z",
    "content": "San Francisco 49ers offensive lineman Jon Feliciano said those claiming to be offended by a joke about Puerto Rico at a Donald Trump rally are pushing an agenda.\r\nDuring Trump's star-studded rally at… [+2580 chars]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "Joseph MacKinnon",
    "title": "Critics ask whether DOJ will give Jimmy Kimmel the Douglass Mackey treatment for 'election interference'",
    "description": "Critics are wondering whether the Biden-Harris Department of Justice will hold Jimmy Kimmel to the same standard to which it held pro-Trump social media influencer Douglass Mackey, who was convicted for supposed \"election interference\" and sentenced to prison…",
    "url": "https://www.theblaze.com/news/critics-ask-whether-doj-will-give-jimmy-kimmel-the-douglass-mackey-treatment-for-election-interference",
    "urlToImage": "https://www.theblaze.com/media-library/critics-ask-whether-doj-will-give-jimmy-kimmel-the-douglass-mackey-treatment-for-election-interference.jpg?id=54093154&width=1200&height=600&coordinates=0%2C24%2C0%2C219",
    "publishedAt": "2024-10-31T18:49:59Z",
    "content": "Critics are wondering whether the Biden-Harris Department of Justice will hold Jimmy Kimmel to the same standard to which it held pro-Trump social media influencer Douglass Mackey, who was convicted … [+4903 chars]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "Glenn Beck",
    "title": "The left’s 5-step election takeover plan is back — and worse than ever",
    "description": "The thing I was most worried about in the weeks leading up to the 2020 election was that the left clearly had a comprehensive plan and the right didn’t appear to. It was a strategy to control, manipulate, and dominate every aspect of the electoral process — a…",
    "url": "https://www.theblaze.com/columns/opinion/the-lefts-5-step-election-takeover-plan-is-back-and-worse-than-ever",
    "urlToImage": "https://www.theblaze.com/media-library/the-lefts-5-step-election-takeover-plan-is-back-and-worse-than-ever.jpg?id=54093267&width=1200&height=600&coordinates=0%2C177%2C0%2C177",
    "publishedAt": "2024-10-31T21:00:00Z",
    "content": "The thing I was most worried about in the weeks leading up to the 2020 election was that the left clearly had a comprehensive plan and the right didnt appear to. It was a strategy to control, manipul… [+5578 chars]"
  },
  {
    "source": { "id": null, "name": "Snopes.com" },
    "author": "Jordan Liles",
    "title": "No American Flags Visible at Rally for Harris at Temple University in October 2024?",
    "description": "American flags were not visible at a rally supporting U.S. Vice President Kamala Harris' campaign, held on the campus of Temple University in Philadelphia, on Oct. 28, 2024.",
    "url": "https://www.snopes.com//fact-check/flags-harris-rally-temple-university/",
    "urlToImage": "https://mediaproxy.snopes.com/width/1200/https://media.snopes.com/2024/10/obama_temple_october_2024.jpg",
    "publishedAt": "2024-10-31T00:07:00Z",
    "content": "6ABC Digital Staff, and Caroline Goggin. \"Bruce Springsteen, John Legend and Former President Obama Rally for Harris in North Philadelphia.\" 6ABC Philadelphia, 28 Oct. 2024, https://6abc.com/post/bru… [+905 chars]"
  },
  {
    "source": { "id": null, "name": "Inessential.com" },
    "author": null,
    "title": "Harris for President",
    "description": "Donald Trump is a disgusting villain and a traitor to our country. He’s a convicted felon, adjudicated rapist, and head of a criminal organization; he works with criminals and he pardons criminals; he’s a narcissist and violent insurrectionist, racist and mis…",
    "url": "https://inessential.com/2024/10/31/harris_for_president.html",
    "urlToImage": null,
    "publishedAt": "2024-10-31T20:04:03Z",
    "content": "Donald Trump is a disgusting villain and a traitor to our country. Hes a convicted felon, adjudicated rapist, and head of a criminal organization; he works with criminals and he pardons criminals; he… [+763 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "Disgraced Matt Schlapp Tries To Fit Kamala Harris In Pence's Suit",
    "description": "Matt's Schlapp, the disgraced CPAC leader who paid out with an insurance policy almost a half a million dollars to settle a sexual harassment lawsuit to a male staffer from the Herschel Walker campaign tells Newsmax he's worried that Kamala Harris will do wha…",
    "url": "https://crooksandliars.com/2024/10/disgraced-matt-schlapp-tries-fit-kamala",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55979.jpg",
    "publishedAt": "2024-10-31T15:34:24Z",
    "content": "Matt's Schlapp, the disgraced CPAC leader who paid out with an insurance policy almost a half a million dollars to settle a sexual harassment lawsuit to a male staffer from the Herschel Walker campai… [+2207 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "College Trump Voter Is Sad: Everyone On Campus Is Voting For Kamala Harris",
    "description": "Kamala Harris has a 31 point lead over Donald Trump in the youth vote of ages 18 to 29, and that translates when we see a college Trump supporter complaining to RSBN that her fellow students are all for Kamala Harris and the Democratic party in Green Bay WI.\n…",
    "url": "https://crooksandliars.com/2024/10/college-trump-voter-everyone-campus-voting",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55980.jpg",
    "publishedAt": "2024-10-31T14:59:38Z",
    "content": "Kamala Harris has a 31 point lead over Donald Trump in the youth vote of ages 18 to 29, and that translates when we see a college Trump supporter complaining to RSBN that her fellow students are all … [+1612 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "Kamala Harris Calls Out Trump For His Last-Minute Sexist BS",
    "description": "During a press event in Madison Wisconsin, Kamala Harris responded to Speaker Johnson announcing they would dismantle Obamacare if put in charge after Nov 5th, and also condemned Trump's horrific (yet utterly typical) words about women.\n\nHARRIS: The former Pr…",
    "url": "https://crooksandliars.com/2024/10/kamala-harris-trumps-comments-women",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55985.jpg",
    "publishedAt": "2024-10-31T16:19:23Z",
    "content": "During a press event in Madison Wisconsin, Kamala Harris responded to Speaker Johnson announcing they would dismantle Obamacare if put in charge after Nov 5th, and also condemned Trump's horrific (ye… [+1487 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "Susie Madrak",
    "title": "Which Candidate Is That Who's Calling People Garbage?",
    "description": "Our media is in very, very sad shape. I was listening to the news at 5 o'clock this morning, hoping there might be actual information. But no, they were featuring a reporter from The Hill speaking very, very seriously about the implications of Kamala Harris r…",
    "url": "https://crooksandliars.com/2024/10/which-candidate-whos-calling-people",
    "urlToImage": "https://crooksandliars.com/files/embeds/2024/10/62905.jpg",
    "publishedAt": "2024-10-31T10:43:27Z",
    "content": "Our media is in very, very sad shape. I was listening to the news at 5 o'clock this morning, hoping there might be actual information. But no, they were featuring a reporter from The Hill speaking ve… [+1598 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "Conover Kennard",
    "title": "The Grabber Will Protect Women 'Whether They Like It Or Not'?",
    "description": "The disgraced former President, with a lengthy history of misogyny, made remarks at his Green Bay, Wisconsin, rally, combining a 'sir story' with odd language. \n\"I wanna protect the women of our country,\" he said before saying he shouldn't say that. But becau…",
    "url": "https://crooksandliars.com/2024/10/grabbers-whether-women-it-or-not-rant",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55982.jpg",
    "publishedAt": "2024-10-31T14:33:00Z",
    "content": "The disgraced former President, with a lengthy history of misogyny, made remarks at his Green Bay, Wisconsin, rally, combining a 'sir story' with odd language. \r\n\"I wanna protect the women of our cou… [+1547 chars]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-31T23:04:16Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-31T01:01:36Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": "nbc-news", "name": "NBC News" },
    "author": "Curtis Bunn",
    "title": "Howard student journalists brace for their biggest assignment: Election night with Harris",
    "description": "Kamala Harris will spend election night at Howard, University her alma mater and a prominent HBCU. Staff of student media organizations are prepping for the big assignment.",
    "url": "https://www.nbcnews.com/news/nbcblk/howard-student-journalists-prepare-cover-election-night-harris-rcna177893",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-08/240829-Kamala-Harris-Howard-aa-426p-b3b9d3.jpg",
    "publishedAt": "2024-10-31T18:53:17Z",
    "content": "For a century, student journalists at Howard University have chronicled life on the campus in Washington, D.C., including commencement addresses by seven presidents, celebrity visits and other monume… [+4679 chars]"
  },
  {
    "source": { "id": "new-york-magazine", "name": "New York Magazine" },
    "author": "Benjamin Hart",
    "title": "Why Arizona Is Looking Trumpier in 2024",
    "description": "Arizona is tipping toward Donald Trump in 2024. Yvonne Wingett Sanchez, an expert on the state’s politics, explains why Kamala Harris has an uphill battle there.",
    "url": "http://nymag.com/intelligencer/article/arizona-presidential-election-harris-trump.html",
    "urlToImage": "https://pyxis.nymag.com/v1/imgs/323/fc3/1f364f45d9c297d3a1cd482c73b296cf36-just-asking-questions-swing-states-AZ.1x.rsocial.w1200.jpg",
    "publishedAt": "2024-10-31T19:01:54Z",
    "content": "Arizona was one of the closest states in the country in 2020, with Joe Bidens tiny margin of victory tipping the state to Democrats for the first time since 1996 and seeding a million Republican cons… [+12008 chars]"
  },
  {
    "source": { "id": null, "name": "Vanity Fair" },
    "author": "Bess Levin",
    "title": "Fox News Host Says He’d Divorce His Wife for Voting for Kamala Harris",
    "description": "“If I found out Emma was going into the voting booth and pulling the lever for Harris, that’s the same thing as having an affair.”",
    "url": "https://www.vanityfair.com/news/story/fox-news-host-says-hed-divorce-his-wife-for-voting-for-kamala-harris",
    "urlToImage": "https://media.vanityfair.com/photos/6723de8a801c5f5bf63037a9/16:9/w_1280,c_limit/1552264944",
    "publishedAt": "2024-10-31T19:49:39Z",
    "content": "How much respect do Donald Trumps male supporters have for women? So much that at least one of them has said hed end his marriage if his wife exercised her constitutional right to vote for Kamala Har… [+1452 chars]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-31T21:01:57Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Kamala Harris reacts to Trump saying he'll protect women \"whether the women like it or not\"",
    "description": "Vice President Kamala Harris spoke to reporters in Wisconsin Thursday about former President Donald Trump's comments that he would protect women \"whether the women like it or not.\" Harris said the remark speaks to how Trump thinks about women and their agency…",
    "url": "https://www.cbsnews.com/video/kamala-harris-speaks-to-reporters-with-5-days-left-before-election-day/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/31/753f67ab-1135-4aa2-99fa-95bf1c6d368e/thumbnail/1200x630/5809ad6e04b1e20efd558e9e5043ccaf/cbsn-fusion-kamala-harris-speaks-to-reporters-with-5-days-left-before-election-day-thumbnail.jpg?v=da20036415aedcaca28a32ffe615549e",
    "publishedAt": "2024-10-31T17:48:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "Kaia Hubbard",
    "title": "Comparing Trump and Harris' views on LGBTQ rights, marriage equality",
    "description": "Former President Donald Trump and Vice President Kamala Harris have starkly different messages and backgrounds on LGBTQ issues.",
    "url": "https://www.cbsnews.com/news/trump-harris-lgbtq-rights-2024/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/25/799bf6a8-f2e5-48ad-a048-05702085fd23/thumbnail/1200x630/f2d0426436c4120dfc50a98bf78c37d1/gettyimages-2158833310.jpg?v=da20036415aedcaca28a32ffe615549e",
    "publishedAt": "2024-10-31T11:00:08Z",
    "content": "Washington — Among the topics voters may consider in the 2024 presidential election are LGBTQ rights — and it's an issue where former President Donald Trump and Vice President Kamala Harris have star… [+6269 chars]"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Kamala Harris pledges to be president for all Americans after Biden's \"garbage\" gaffe",
    "description": "Vice President Kamala Harris has promised to be a president for all and \"put country above party\" in the wake of President Biden's controversial \"garbage\" comment. CBS News campaign reporter Nidia Cavazos has more on Harris' campaign.",
    "url": "https://www.cbsnews.com/video/kamala-harris-pledges-to-be-president-for-all-americans-after-bidens-garbage-gaffe/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/31/6f155420-7bbc-4aa8-a478-3db9681e5301/thumbnail/1200x630/92201397e1638a814ca64d88c1ce26f1/cbsn-fusion-kamala-harris-pledges-to-be-president-for-all-americans-after-bidens-garbage-gaffe-thumbnail.jpg?v=da20036415aedcaca28a32ffe615549e",
    "publishedAt": "2024-10-31T15:06:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "Alexander Tin",
    "title": "How Harris and Trump's stances on Medicare compare",
    "description": "The future of Medicare continues to come up in the closing arguments from both Kamala Harris and Donald Trump ahead of Election Day 2024.",
    "url": "https://www.cbsnews.com/news/trump-harris-medicare-2024/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2019/11/12/eb2e5e39-6863-4559-ab74-c81f91f6e289/thumbnail/1200x630/70dc528de599a2c589bb7945da002323/MEDICARE-HELP-5PKG_frame_778.jpg?v=da20036415aedcaca28a32ffe615549e",
    "publishedAt": "2024-10-31T14:34:24Z",
    "content": "The future of Medicare, America's sweeping health insurance program for older adults, continues to come up on the campaign trail from both Vice President Kamala Harris and former President Donald Tru… [+6449 chars]"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Why Harris needs Latino voters in Arizona, Nevada",
    "description": "Vice President Kamala Harris is visiting Arizona and Nevada where Latino voters could help her campaign win both battleground states. CBS News' Nidia Cavazos breaks down the influence of Latino voters in the West.",
    "url": "https://www.cbsnews.com/video/why-harris-needs-latino-voters-in-arizona-nevada/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/31/c1e6d087-02ba-4356-9f11-10a2d7168066/thumbnail/1200x630/e8e3b2318ded50506f5b86d8f5099d8a/cbsn-fusion-why-harris-needs-latino-voters-in-arizona-nevada-thumbnail.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T18:52:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris reacts to Trump comments about protecting women",
    "description": "Vice President Kamala Harris weighed in on former President Donald Trump's comments about protecting women whether they \"like it or not.\" This comes as both campaigns target younger voters. CBS News political director Fin Gómez reports.",
    "url": "https://www.cbsnews.com/video/harris-reacts-to-trump-comments-about-protecting-women/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/31/f2ecd297-3c0f-45d2-ab77-bbfe8a77af51/thumbnail/1200x630/13af7b47e910521a24bb24a2fccafbf9/cbsn-fusion-harris-reacts-to-trump-comments-about-protecting-women-thumbnail.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T18:04:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris makes final campaign push in West",
    "description": "Vice President Kamala Harris was campaigning in two critical battleground western states Thursday, hoping Latino voters can help deliver Arizona and Nevada. Polls show that Harris narrowly trails former President Donald Trump in the Grand Canyon State, where …",
    "url": "https://www.cbsnews.com/video/harris-makes-final-campaign-push-in-west/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/31/ecb2b2f2-75d9-46ff-bc90-753a7df4b453/thumbnail/1200x630/559b5bf85749144043dc55e4fd4bf1fe/1031-en-kvc.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T23:31:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris campaign hopes to drive young voters to the polls",
    "description": "In her third battleground stop of the day on Wednesday, Vice President Kamala Harris campaigned in Madison, Wisconsin, focusing on young voter turnout. Polls show Harris has a 23-point advantage over former President Donald Trump among young voters, but they …",
    "url": "https://www.cbsnews.com/video/harris-campaign-hopes-to-drive-young-voters-to-the-polls/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/31/b485d6db-6eac-4e51-8a1e-7441873e8d6b/thumbnail/1200x630/d9a299256d8c6ae2677a2313a9a5ea7e/1031-cmo-harris-cordes.jpg?v=da20036415aedcaca28a32ffe615549e",
    "publishedAt": "2024-10-31T14:32:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris to Nevada to court Latinos before Election Day",
    "description": "Vice President Kamala Harris will hold a rally in Las Vegas, Nevada, where Latinos could help her campaign's efforts in the battleground state. The economy and immigration are important issues for voters in that state. CBS News' Lilia Luciano previews Harris'…",
    "url": "https://www.cbsnews.com/video/harris-to-nevada-to-court-latinos-before-election-day/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/31/a60d7609-ce32-40f3-a0f7-c943257e8c20/thumbnail/1200x630/578e51b68acab1f0fdb55a7a444f0e9e/cbsn-fusion-harris-to-nevada-to-court-latinos-before-election-day-thumbnail.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T20:32:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Johnson says Harris is lying over his Affordable Care Act plans if Trump wins",
    "description": "House Speaker Mike Johnson is rebuking Vice President Kamala Harris' comments about the future of the Affordable Care Act if former President Donald Trump becomes president again. CBS News' Nikole Killion reports.",
    "url": "https://www.cbsnews.com/video/johnson-says-harris-is-lying-over-his-affordable-care-act-plans-if-trump-wins/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/31/16a54379-3cac-4328-94c5-be6791d31b1e/thumbnail/1200x630/4499a3af03ab58e11e6ce84de166a03f/cbsn-fusion-johnson-says-harris-is-lying-over-his-affordable-care-act-plans-if-trump-wins-thumbnail.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T19:41:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Concerns over 2024 election betting",
    "description": "New data shows more than $100 million has been legally wagered on the Kamala Harris and Donald Trump presidential race. Koleman Strumpf, the Burchfield Presidential Chair of Political Economy at Wake Forrest University, joins CBS News with more.",
    "url": "https://www.cbsnews.com/video/concerns-over-2024-election-betting/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/31/a5134ce1-caa9-4c25-94cc-f15ccbf13cd0/thumbnail/1200x630/05d8e885fbc7a5536960346fb7b42359/cbsn-fusion-concerns-over-2024-election-betting-thumbnail.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T20:48:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "What Harris, Trump are doing in the West right before Election Day",
    "description": "Vice President Kamala Harris and former President Donald Trump are visiting the West just days before the Nov. 5 Election Day. CBS News political reporter Zak Hudak has more on the upcoming campaign moves.",
    "url": "https://www.cbsnews.com/video/what-harris-trump-are-doing-in-the-west-right-before-election-day/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/31/c2ec8d25-15ed-4c88-bd10-436a14cf1802/thumbnail/1200x630/5423c697e62ef46850e85c732810078d/cbsn-fusion-what-harris-trump-are-doing-in-the-west-right-before-election-day-thumbnail.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T20:13:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Trump rips Biden for \"garbage\" comment, Harris still trying to appeal to moderates and youth",
    "description": "Former President Donald Trump is seizing on President Biden's comments where he appeared to call Trump supporters \"garbage,\" though the White House says the president was referring specifically to the rhetoric of the comedian who disparaged Puerto Rico during…",
    "url": "https://www.cbsnews.com/video/trump-rips-biden-for-garbage-comment-harris-making-last-appeal-to-young-voters/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/31/3f443850-ef35-41f6-81c6-deb17e664a28/thumbnail/1200x630/d6c258228501c5067be0ad7626797b10/cbsn-fusion-trump-rips-biden-for-garbage-comment-harris-making-last-appeal-to-young-voters-thumbnail.jpg?v=da20036415aedcaca28a32ffe615549e",
    "publishedAt": "2024-10-31T12:24:04Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Trump says he will \"protect women\" whether they \"like it or not\"",
    "description": "While campaigning in Green Bay, Wisconsin, on Wednesday, former President Donald Trump told a crowd that \"whether the women like it or not, I'm going to protect them.'\" Vice President Kamala Harris called the remarks \"offensive to women.\" Nikole Killion repor…",
    "url": "https://www.cbsnews.com/video/trump-says-he-will-protect-women-whether-they-like-it-or-not/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/31/f82c8eb2-a99b-4352-b86b-3ca313d4640c/thumbnail/1200x630/851c17708b39e3f572f48056b1b58d83/1031-en-killion.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T23:30:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Trump says \"shame on you\" to people who voted against him",
    "description": "Former President Donald Trump said \"if you voted against me shame on you\" at a New Mexico rally on Thursday after criticizing President Biden's \"garbage\" comment. CBS News political reporter Zak Hudak and CBS News national correspondent Kris Van Cleave follow…",
    "url": "https://www.cbsnews.com/video/trump-says-shame-people-who-voted-against-him/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/31/a09601ec-2a5c-4c8c-a489-260098276b30/thumbnail/1200x630/20a1226089c83dba0a565ec6191439e4/cbsn-fusion-trump-says-shame-people-who-voted-against-him-thumbnail.jpg?v=379420b9063a2aadbcd559df18e2d1ae",
    "publishedAt": "2024-10-31T23:22:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "Carrie Sheffield",
    "title": "Desperate, Elitist Kamala Harris Is Hillary Clinton 2.0",
    "description": "Vice President Kamala Harris’ weak response to President Joe Biden’s calling Donald Trump supporters “garbage” matches her hyperbolic, incendiary claims that Trump is a “fascist”... Read More\nThe post Desperate, Elitist Kamala Harris Is Hillary Clinton 2.0 ap…",
    "url": "https://www.dailysignal.com/2024/10/31/desperate-elitist-kamala-harris-is-hillary-clinton-2-0/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/241031_KamalaHillary_Sheffield.jpg",
    "publishedAt": "2024-10-31T17:03:59Z",
    "content": "Vice President Kamala Harris weak response to President Joe Bidens calling Donald Trump supporters garbage matches her hyperbolic, incendiary claims that Trump is a fascist who relies on the tactics … [+4305 chars]"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "Terence Jeffrey",
    "title": "What Kamala Harris and Henry VIII Have in Common",
    "description": "Vice President Kamala Harris and the 16th-century British monarch Henry VIII share at least one trait in common: The belief that the government can force... Read More\nThe post What Kamala Harris and Henry VIII Have in Common appeared first on The Daily Signal.",
    "url": "https://www.dailysignal.com/2024/10/31/what-kamala-harris-and-henry-viii-have-in-common/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/GettyImages-2181638827.jpg",
    "publishedAt": "2024-10-31T20:41:56Z",
    "content": "Vice President Kamala Harris and the 16th-century British monarch Henry VIII share at least one trait in common: The belief that the government can force an individual to act against his conscience a… [+5283 chars]"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "Tony Kinnett",
    "title": "When in a Hole, Kamala Keeps Digging",
    "description": "On the latest episode of “The Tony Kinnett Cast,” we examine the possible effects of Vice President Kamala Harris’ resolute decision to continue diving deeper... Read More\nThe post When in a Hole, Kamala Keeps Digging appeared first on The Daily Signal.",
    "url": "https://www.dailysignal.com/2024/10/31/when-hole-kamala-keeps-digging/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/TKC_Digging_WP.jpg",
    "publishedAt": "2024-10-31T21:12:21Z",
    "content": "On the latest episode of The Tony Kinnett Cast, we examine the possible effects of Vice President Kamala Harris’ resolute decision to continue diving deeper into divisive politics and far-left rhetor… [+859 chars]"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "Nathan Harden",
    "title": "Could Tim Walz’s Progressive Education Policies Doom Harris?",
    "description": "Donald Trump currently holds a razor-thin 0.6% lead over Kamala Harris in the RealClearPolitics polling average for Pennsylvania. With this key swing state potentially deciding the outcome... Read More\nThe post Could Tim Walz’s Progressive Education Policies …",
    "url": "https://www.dailysignal.com/2024/10/31/could-tim-walzs-progressive-education-policies-doom-harris/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/GettyImages-2180343781.jpg",
    "publishedAt": "2024-10-31T12:00:00Z",
    "content": "Donald Trump currently holds a razor-thin 0.6% lead over Kamala Harris in the RealClearPolitics polling average for Pennsylvania. With this key swing state potentially deciding the outcome of the Ele… [+6048 chars]"
  },
  {
    "source": { "id": "abc-news-au", "name": "ABC News (AU)" },
    "author": "Brianna Morris-Grant",
    "title": "Donald Trump rides in a garbage truck as Pennsylvania faces multiple voting lawsuits — the latest from the US election campaign trail",
    "description": "Kamala Harris attempts to distance herself from Joe Biden's \"garbage\" comments and an 18-year-old is charged after brandishing a machete at a Florida voting booth — here's the latest updates from the US election.",
    "url": "https://www.abc.net.au/news/2024-10-31/us-pols-election-latest-oct-31/104542410",
    "urlToImage": "https://live-production.wcms.abc-cdn.net.au/2be56cf83038cd1f801735cf734a6514?impolicy=wcms_watermark_news&cropH=2160&cropW=3840&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "publishedAt": "2024-10-31T04:03:42Z",
    "content": "Good afternoon and welcome back to another day on the presidential campaign trail.\r\nThis is our daily wrap, making sure you're caught up on the latest election developments.\r\nIn today's wrap, we take… [+5022 chars]"
  },
  {
    "source": { "id": "msnbc", "name": "MSNBC" },
    "author": "Helaine R. Olen",
    "title": "There’s one thing Harris and Trump have agreed on. The reason why is wildly depressing.",
    "description": "Former President Donald Trump and Vice President Kamala Harris differ on everything from tariffs to abortion.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-harris-crypto-bitcoin-voters-rcna178213",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-09/240920-bitcoin-wc-1104-dbe6f2.jpg",
    "publishedAt": "2024-10-31T18:54:38Z",
    "content": "Former President Donald Trump and Vice President Kamala Harris differ on everything from tariffs to abortion. Yet both have made their support for crypto a part of their platforms.\r\nTrump, who used t… [+6040 chars]"
  },
  {
    "source": { "id": "msnbc", "name": "MSNBC" },
    "author": "Steve Benen",
    "title": "The irony of Trump accusing Harris of having ‘the plans of a simpleton’",
    "description": "As Donald Trump accuses Kamala Harris of having \"the plans of a simpleton,\" the phrase \"every accusation is a confession\" comes to mind.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/irony-trump-accusing-harris-plans-simpleton-rcna178215",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241018-donald-trump-kamala-harris-al-0823-e125d3.jpg",
    "publishedAt": "2024-10-31T14:36:02Z",
    "content": "As the 2024 presidential election entered its final stretch, Donald Trump has struggled to respond to Kamala Harris policy agenda, to the point that the former Republican president started making up … [+2752 chars]"
  },
  {
    "source": { "id": null, "name": "RealClearPolitics" },
    "author": "Lydie Lake, American Prospect",
    "title": "Harris' Final Push Before Election Day",
    "description": "<p>Kamala Harris delivered her closing argument in a charged pre-election rally near the White House.</p>",
    "url": "https://www.realclearpolitics.com/2024/10/31/harris_final_push_before_election_day_634633.html",
    "urlToImage": "https://www.realclearpolitics.com/asset/img/social_media_assets/site_logos/rcp.png",
    "publishedAt": "2024-10-31T11:34:18Z",
    "content": "Kamala Harris delivered her closing argument in a charged pre-election rally near the White House.\r\nRead Full Article »"
  },
  {
    "source": { "id": null, "name": "Realcleardefense.com" },
    "author": "Tiffany Brannon, RealClearDefense",
    "title": "Not the Woman We've Been Waiting For",
    "description": "Two weeks ago, Bret Baier questioned Vice President Kamala Harris about the young women being raped or killed by criminals who entered our country illegally. \n\"Do you owe their...",
    "url": "https://www.realcleardefense.com/articles/2024/10/28/not_the_woman_weve_been_waiting_for_1068338.html",
    "urlToImage": "https://assets.realclear.com/images/66/667871_6_.jpeg",
    "publishedAt": "2024-10-31T11:34:45Z",
    "content": "Two weeks ago, Bret Baier questioned Vice President Kamala Harris about the young women being raped or killed by criminals who entered our country illegally. \r\n\"Do you owe their families an apology?\"… [+6439 chars]"
  },
  {
    "source": { "id": null, "name": "The Hollywood Gossip" },
    "author": "Simon Delott",
    "title": "Saint West Posts Gross Anti Kamala Harris Meme: Did Kim Kardashian Delete His YouTube …",
    "description": "What does 8-year-old Saint West think of Vice President Kamala Harris? Not much, it seems. Not according to a fairly …\nSaint West Posts Gross Anti Kamala Harris Meme: Did Kim Kardashian Delete His YouTube … was originally published on The Hollywood Gossip.",
    "url": "http://www.thehollywoodgossip.com/2024/10/saint-west-kamala-harris-meme-youtube/",
    "urlToImage": "https://cdn.thehollywoodgossip.com/uploads/2024/10/1031_saintwest_header.jpg",
    "publishedAt": "2024-10-31T20:01:54Z",
    "content": "What does 8-year-old Saint West think of Vice President Kamala Harris?\r\nNot much, it seems. Not according to a fairly disgusting meme that was posted to his YouTube.\r\nAnd if you want to see the polit… [+4253 chars]"
  }
]
