[
  {
    "source": { "id": null, "name": "Slashdot.org" },
    "author": "msmash",
    "title": "FBI Investigates Claims China Tried To Hack Donald Trump's Phone",
    "description": "Joe Biden's administration is investigating alleged Chinese efforts to hack US telecoms infrastructure amid reports hackers had targeted the phones of former president Donald Trump and his running mate JD Vance. Financial Times: The FBI and the Cybersecurity …",
    "url": "https://news.slashdot.org/story/24/10/25/2055241/fbi-investigates-claims-china-tried-to-hack-donald-trumps-phone",
    "urlToImage": "https://a.fsdn.com/sd/topics/usa_64.png",
    "publishedAt": "2024-10-25T21:00:00Z",
    "content": "Joe Biden's administration is investigating alleged Chinese efforts to hack US telecoms infrastructure amid reports hackers had targeted the phones of former president Donald Trump and his running ma… [+1748 chars]"
  },
  {
    "source": { "id": "business-insider", "name": "Business Insider" },
    "author": "Geoff Weiss",
    "title": "Washington Post reports that owner Jeff Bezos stopped it from endorsing Kamala Harris",
    "description": "Former Washington Post executive editor Marty Baron called the decision \"a moment of darkness that will leave democracy as a casualty.\"",
    "url": "https://www.businessinsider.com/jeff-bezos-owned-washington-post-wont-endorse-presidential-candidate-2024-10",
    "urlToImage": "https://i.insider.com/671bce799b3250dbbcea2dfe?width=1200&format=jpeg",
    "publishedAt": "2024-10-25T18:01:40Z",
    "content": "Jeff BezosLeon Bennett/Getty\r\n<ul><li>The Washington Post won't endorse a presidential candidate in 2024.</li><li>Former executive editor Marty Baron called the decision \"a moment of darkness,\" per N… [+2316 chars]"
  },
  {
    "source": { "id": "abc-news", "name": "ABC News" },
    "author": "Gary Langer, Steven Sparks",
    "title": "Half of Americans see Donald Trump as a fascist: POLL",
    "description": "Half the country sees Donald Trump as a fascist in a new ABC News/Ipsos poll, amplifying concerns recently raised by Kamala Harris and past Trump administration members.",
    "url": "https://abcnews.go.com/Politics/donald-trump-fascist-concerns-poll/story?id=115083795",
    "urlToImage": "https://i.abcnewsfe.com/a/de161672-848e-417b-bdbf-6604ebf37dc1/donald-trump-1-ap-gmh-241021_1729526157923_hpMain_16x9.jpg?w=1600",
    "publishedAt": "2024-10-25T10:20:58Z",
    "content": "Half the country sees former President Donald Trump as a fascist, amplifying concerns raised in recent days by Vice President Kamala Harris and past members of Trump's own administration. Far fewer i… [+6921 chars]"
  },
  {
    "source": { "id": null, "name": "The New Yorker" },
    "author": "The New Yorker",
    "title": "How Alpha Kappa Alpha Shaped Kamala Harris",
    "description": "On the New Yorker Radio Hour, David Remnick speaks with Jazmine Hughes about Kamal Harris’s membership in Alpha Kappa Alpha, the nation’s oldest Black sorority.",
    "url": "https://www.newyorker.com/podcast/the-new-yorker-radio-hour/how-alpha-kappa-alpha-shaped-kamala-harris",
    "urlToImage": "https://media.newyorker.com/photos/663cd3037d83171cd086b2ee/16:9/w_1280,c_limit/Radio-Hour-Secondary-Segment.png",
    "publishedAt": "2024-10-25T18:00:00Z",
    "content": "Listen and subscribe:Apple | Spotify | Google | Wherever You Listen\r\nSign up for our daily newsletter to get the best of The New Yorker in your in-box.\r\nOne aspect of the Vice-Presidents background t… [+986 chars]"
  },
  {
    "source": { "id": null, "name": "Vox" },
    "author": "Ian Millhiser",
    "title": "Why it’ll be even harder for Trump to steal the election this time",
    "description": "The fight over who will become the next president is unlikely to end on Election Day if Vice President Kamala Harris prevails in the upcoming election.  We know this because of former President Donald Trump’s behavior after he lost the 2020 election. Trump di…",
    "url": "https://www.vox.com/donald-trump/379351/donald-trump-january-6-election-2024-supreme-court",
    "urlToImage": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/23885105/GettyImages_1236302381.jpg?quality=90&strip=all&crop=0%2C15.79279938427%2C100%2C68.414401231459&w=1200",
    "publishedAt": "2024-10-25T03:46:41Z",
    "content": "The fight over who will become the next president is unlikely to end on Election Day if Vice President Kamala Harris prevails in the upcoming election. \r\nWe know this because of former President Dona… [+14386 chars]"
  },
  {
    "source": { "id": null, "name": "Stereogum" },
    "author": "Tom Breihan",
    "title": "Watch Bruce Springsteen Play His Hits For Howard Stern, Kamala Harris Rally",
    "description": "Bruce Springsteen had a busy day yesterday. Today marks the release of Road Diary, the new documentary about Springsteen’s recent tour with his E Street Band; it’s streaming on Hulu and Disney+ now. To promote that documentary, Springsteen sat for a long inte…",
    "url": "https://www.stereogum.com/2285389/watch-bruce-springsteen-play-his-hits-for-howard-stern-kamala-harris-rally/news/",
    "urlToImage": "https://static.stereogum.com/uploads/2024/10/Bruce-Springsteen-1729866848.jpg",
    "publishedAt": "2024-10-25T14:58:47Z",
    "content": "Bruce Springsteen had a busy day yesterday. Today marks the release of Road Diary, the new documentary about Springsteen’s recent tour with his E Street Band; it’s streaming on Hulu and Disney+ now. … [+1820 chars]"
  },
  {
    "source": { "id": "al-jazeera-english", "name": "Al Jazeera English" },
    "author": null,
    "title": "Bruce Springsteen, Samuel L Jackson, Spike Lee, rally for Harris",
    "description": "Musician Bruce Springsteen condemned Donald Trump as “an American tyrant” at an election rally for Kamala Harris.",
    "url": "https://www.aljazeera.com/program/newsfeed/2024/10/25/bruce-springsteen-samuel-l-jackson-spike-lee-rally-for-harris",
    "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/10/WIDE-CLEAN-1729846102.jpg?resize=1920%2C1080&quality=80",
    "publishedAt": "2024-10-25T08:49:43Z",
    "content": "NewsFeed\r\nMusician Bruce Springsteen condemned Donald Trump as an American tyrant at an election rally for Kamala Harris in the battleground state of Georgia, where actor Samuel L Jackson and directo… [+56 chars]"
  },
  {
    "source": { "id": "al-jazeera-english", "name": "Al Jazeera English" },
    "author": "Dwayne Oxford",
    "title": "Can Liz Cheney help Kamala Harris’s campaign? Or will she hurt her?",
    "description": "Polls suggest some Republican voters are willing to back Harris. But she could also bleed votes because of Cheney.",
    "url": "https://www.aljazeera.com/news/2024/10/25/can-liz-cheney-help-kamala-harriss-campaign-or-will-she-hurt-her",
    "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/10/AP24295751285709-1729858383.jpg?resize=1920%2C1440",
    "publishedAt": "2024-10-25T12:14:22Z",
    "content": "As United States Vice President Kamala Harris crisscrosses the country and especially key battleground states ahead of the November 5 election, an unlikely cheerleader has accompanied her on several … [+8479 chars]"
  },
  {
    "source": { "id": null, "name": "Barron's" },
    "author": null,
    "title": "Beyonce vs Rogan: Stars Power Up Election...",
    "description": "The US election takes a detour from the swing state circuit to decamp to Texas on Friday as Kamala Harris rallies with pop superstar Beyonce and Donald Trump sits down with the world's biggest podcaster.",
    "url": "https://www.barrons.com/articles/beyonce-v-joe-rogan-stars-power-up-us-election-40b7ea0a",
    "urlToImage": "https://www.barrons.com/asset/external-media/afp/AFP4956652775487425958255590284152585243867---1.jpg",
    "publishedAt": "2024-10-25T10:40:37Z",
    "content": "The US election takes a detour from the swing state circuit to decamp to Texas on Friday as Kamala Harris rallies with pop superstar Beyonce and Donald Trump sits down with the world's biggest podcas… [+2487 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "Leonardo DiCaprio Endorses Kamala Harris, Says Donald Trump “Continues To Deny The Facts” Of Climate Change",
    "description": "Leonardo DiCaprio endorsed Kamala Harris in a video posted to Instagram today, saying that her rival Donald Trump “continues to deny” the facts and science behind climate change. DiCaprio opened the video by noting that the devastating hurricanes that struck …",
    "url": "http://deadline.com/2024/10/leonardo-dicaprio-endorses-kamala-harris-1236158951/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/01/GettyImages-505034332.jpg?w=1024",
    "publishedAt": "2024-10-25T22:27:09Z",
    "content": "Leonardo DiCaprio endorsed Kamala Harris in a video posted to Instagram today, saying that her rival Donald Trump “continues to deny” the facts and science behind climate change.\r\nDiCaprio opened the… [+1256 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "“Bulls—“: Charlamagne Tha God And Anderson Cooper Spar Over Network’s Coverage Of Donald Trump Vs. Kamala Harris",
    "description": "Charlamagne Tha God and Anderson Cooper used expletives at points as they engaged in a spirited debate over how CNN and other networks have covered Donald Trump versus Kamala Harris. On AC 360 on Thursday, Cooper made the point that when it comes to Trump, “i…",
    "url": "http://deadline.com/2024/10/trump-anderson-cooper-charlamagne-tha-god-cnn-1236158475/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/Screenshot-2024-10-25-at-11.52.32 AM.jpeg?w=1024",
    "publishedAt": "2024-10-25T16:24:42Z",
    "content": "Charlamagne Tha God and Anderson Cooper used expletives at points as they engaged in a spirited debate over how CNN and other networks have covered Donald Trump versus Kamala Harris. \r\nOn AC 360 on T… [+2837 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "“Third Grade Gay Taunt”: Donald Trump Again Identifies CNN’s Anderson Cooper As “Allison”",
    "description": "Donald Trump again referred to CNN anchor Anderson Cooper as “Allison,” reviving a past reference to the openly gay personality. Trump misidentified Cooper at a rally and on social media today, as the Republican presidential candidate was talking about the CN…",
    "url": "http://deadline.com/2024/10/trump-anderson-cooper-gay-taunt-1236158967/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/GettyImages-2178289779.jpg?w=1024",
    "publishedAt": "2024-10-25T23:09:28Z",
    "content": "Donald Trump again referred to CNN anchor Anderson Cooper as “Allison,” reviving a past reference to the openly gay personality.\r\nTrump misidentified Cooper at a rally and on social media today, as t… [+799 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Ted Johnson",
    "title": "Sacha Baron Cohen Revives Ali G And Borat During ‘Tonight Show’ Appearance To Ask Questions To Donald Trump And Kamala Harris",
    "description": "Sacha Baron Cohen revived his Ali G and Borat characters during a guest appearance Thursday on The Tonight Show Starring Jimmy Fallon. The setup was Fallon’s question of how each character would ask at a presidential debate if they were to moderate such an ev…",
    "url": "http://deadline.com/2024/10/trump-kamala-harris-borat-ali-g-sacha-baron-cohen-1236158373/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/Screenshot-2024-10-25-at-10.41.13 AM.jpeg?w=1024",
    "publishedAt": "2024-10-25T15:00:24Z",
    "content": "Sacha Baron Cohen revived his Ali G and Borat characters during a guest appearance Thursday on The Tonight Show Starring Jimmy Fallon.\r\nThe setup was Fallon’s question of how each character would ask… [+1039 chars]"
  },
  {
    "source": { "id": null, "name": "Deadline" },
    "author": "Dominic Patten",
    "title": "Mel Gibson Maligns Kamala Harris As Having “IQ Of A Fence Post”; ‘Mad Max’ Star Supporting Donald Trump In Tight Election, He Says",
    "description": "Just a few days ago, Andrew Garfield praised his Hacksaw Ridge director Mel Gibson for the “beautiful healing with himself” the Oscar winner has done over the year. Based on comments Gibson made today at LAX about the Vice President of the United States, the …",
    "url": "http://deadline.com/2024/10/mel-gibson-kamala-harris-insults-donald-trump-1236158036/",
    "urlToImage": "https://deadline.com/wp-content/uploads/2024/10/Mel-Gibson-Kamala-Harris.jpg?w=1000",
    "publishedAt": "2024-10-25T01:03:37Z",
    "content": "Just a few days ago, Andrew Garfield praised his Hacksaw Ridge director Mel Gibson for the “beautiful healing with himself” the Oscar winner has done over the year. Based on comments Gibson made toda… [+2910 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Timothy Noah",
    "title": "The Influential Men Who Disdain Trump—But Won’t Endorse Harris",
    "description": "In his 1963 “Letter From the Birmingham Jail,” Martin Luther King wrote that his generation would “have to repent … not merely for the hateful words and actions of the bad people but for the appalling silence of the good people.” A similar sentiment is often …",
    "url": "https://newrepublic.com/series/58/men-hate-trump-wont-endorse-harris",
    "urlToImage": "https://images.newrepublic.com/34df413f1e7ec49154de3a24a1fa1ba4fb0ae36b.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T10:00:00Z",
    "content": "In his 1963 Letter From the Birmingham Jail, Martin Luther King wrote that his generation would have to repent not merely for the hateful words and actions of the bad people but for the appalling sil… [+2517 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Ellie Quinlan Houghtaling",
    "title": "Mitch McConnell, Mike Johnson Show True Colors With New Harris Attack",
    "description": "Donald Trump’s ex-allies and former staffers agree that the Republican presidential nominee is a fascist—but the people laser-focused on returning him to the Oval Office are working overtime to undercut the dire warning.\r\nFascism is a far-right, authoritarian…",
    "url": "https://newrepublic.com/post/187554/mitch-mcconnell-mike-johnson-kamala-harris-donald-trump-fascist",
    "urlToImage": "https://images.newrepublic.com/6c08922ff45380af8c7ef9186a9257b9a9d7ffd4.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T18:03:12Z",
    "content": "But New York voters may not actually know that, because Republican groups have been waging a fierce campaign against the measure by focusing on the amendments protections for transgender people, thre… [+910 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Peter Rothpletz",
    "title": "How Democrats Can Win Back the Young Men They’ve Lost",
    "description": "As conservatives have beat a steady retreat from our shared American culture over the last few years, Democrats have won a slew of interesting things in the national divorce: patriotism, football, camo, crass humor, and beer. The Democratic Party’s messaging …",
    "url": "https://newrepublic.com/article/187510/democrats-win-back-young-men",
    "urlToImage": "https://images.newrepublic.com/1b0a002997c2bdcc4bc2e9569ee9a7d0071703f6.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T10:00:00Z",
    "content": "Moreover, in their attempts to win over male voters, Democrats have been vocal about their desire to promote a neo-masculinitya confident-yet-kind, non-toxic approach to manhood. Young male voters, i… [+1591 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "The Daily Blast with Greg Sargent",
    "title": "Transcript: Trump’s Angry New Rants at Jack Smith Signal Darker Aims",
    "description": "The following is a lightly edited transcript of the October 25 episode of The Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nIn an …",
    "url": "https://newrepublic.com/article/187529/transcript-trumps-angry-new-rants-jack-smith-signal-darker-aims",
    "urlToImage": "https://images.newrepublic.com/a8528647e4ef15fdad0e78ff84feccd12cd4170f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T11:00:43Z",
    "content": "McQuade: I think so. In 2016, we saw people who stayed through the administration, who continued to work at the Justice Department after decades of being career prosecutors ... And in the moment of t… [+2104 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Edith Olmsted",
    "title": "“Extreme Danger”: Harris Earns a Stunning Endorsement Over Trump",
    "description": "More than 100 Arizona Palestinian, Arab, Muslim, and progressive Democrats and community leaders have signed a letter making the case for those reluctant to support Kamala Harris against Donald Trump.\r\n“We know that many in our communities are resistant to vo…",
    "url": "https://newrepublic.com/post/187537/kamala-harris-donald-trump-stunning-endorsement",
    "urlToImage": "https://images.newrepublic.com/11cfe7c1e7391fed8b22e749ce8fe3516a92a57f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T14:38:57Z",
    "content": "The Fox News broadcast of the event cut Trumps comments about gang members and drug lords in Aurora, Colorado, and his lies about Haitian immigrants in Springfield, Ohio. They just dumped 50,000 peop… [+962 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Hafiz Rashid",
    "title": "Shock Poll Shows Half of America Knows Trump Is a Fascist. And Yet …",
    "description": "Almost half of all Americans view Donald Trump as a fascist, according to a new poll from ABC News/Ipsos. \r\nThe poll, released Friday morning, shows 49 percent of registered voters think of Trump as fitting the definition of a “political extremist who acts as…",
    "url": "https://newrepublic.com/post/187546/poll-half-america-trump-fascist",
    "urlToImage": "https://images.newrepublic.com/baefd0baaf68990309af3553f926ce4a79930293.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T16:30:36Z",
    "content": "But New York voters may not actually know that, because Republican groups have been waging a fierce campaign against the measure by focusing on the amendments protections for transgender people, thre… [+910 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Hafiz Rashid",
    "title": "Trump Praised Netanyahu in Call After One of Israel’s Worst Attacks",
    "description": "Despite his recent overtures to Muslim and Arab American voters, Donald Trump privately encouraged Benjamin Netanyahu in a phone call earlier this month to “do what you have to do.” \r\nThe Washington Post reported Friday the former president told the Israeli p…",
    "url": "https://newrepublic.com/post/187577/trump-praise-netanyahu-call",
    "urlToImage": "https://images.newrepublic.com/7dbda3e11a38f60cd35e4ec1db27e694ccf5df75.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T20:40:42Z",
    "content": "Robinson morphed into a political pariah after CNN published a sprawling investigation last month about his pre-politics proclivities, which included writing in online pornographic forums that he had… [+1710 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Michael Tomasky",
    "title": "The Best Reason for Calling Donald Trump a Fascist? Easy: He Is.",
    "description": "What the hell is this “debate” about whether Kamala Harris should call Donald Trump a fascist? It’s too … what? Too aggressive? Too in your face? It risks backlash?\r\nSorry, but that’s the advice of the people who’ve been advising Democrats to lose elections f…",
    "url": "https://newrepublic.com/post/187533/donald-trump-is-a-fascist",
    "urlToImage": "https://images.newrepublic.com/8bb05b090d4977c8af6c1369da3cd541d9f926cc.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T14:10:32Z",
    "content": "But at this point a campaign is mostly about gestures and stagecraft. The Harris campaign could use some events that create mojo. A surprise endorsement from a prominent Republican or some other unex… [+1350 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Adrienne Mahsa Varkiani",
    "title": "Jeff Bezos Proves He’s a Coward With Washington Post Endorsement News",
    "description": "It appears Jeff Bezos is very afraid of Donald Trump. For the first time in 36 years, The Washington Post will not be endorsing a presidential candidate this election.\r\nThe Post’s editorial page editor David Shipley announced the news to shocked colleagues in…",
    "url": "https://newrepublic.com/post/187561/washington-post-president-endorsement-harris-trump-bezos-coward",
    "urlToImage": "https://images.newrepublic.com/8ebce5503df64f0c03db4a13a1efabc816bf43f2.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T17:17:37Z",
    "content": "But New York voters may not actually know that, because Republican groups have been waging a fierce campaign against the measure by focusing on the amendments protections for transgender people, thre… [+910 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Ellie Quinlan Houghtaling",
    "title": "“Something in Him Broke”: Ex–Trump Ally Warns He’s Totally Lost It",
    "description": "With less than two weeks until Election Day, former Trump allies are sounding the alarm that Donald Trump isn’t the same man they knew.\r\nSpeaking with Kaitlan Collins on CNN’s The Source Thursday night, former Trump White House deputy press secretary Sarah Ma…",
    "url": "https://newrepublic.com/post/187540/ex-donald-trump-ally-warns-lost-it",
    "urlToImage": "https://images.newrepublic.com/ec9806f6f9ce0a925bfaea31c2722e538395bcd9.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T14:39:21Z",
    "content": "The Fox News broadcast of the event cut Trumps comments about gang members and drug lords in Aurora, Colorado, and his lies about Haitian immigrants in Springfield, Ohio. They just dumped 50,000 peop… [+962 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Hafiz Rashid",
    "title": "Elon Musk Tells DOJ to Go Screw Itself After That Lottery Warning",
    "description": "Elon Musk is thumbing his nose at the Department of Justice, on Thursday night resuming his super PAC’s scheme to give away $1 million to a battleground state voter every day despite receiving a warning from the DOJ earlier in the week. \r\nMusk’s pro-Trump Ame…",
    "url": "https://newrepublic.com/post/187536/elon-musk-doj-justice-department-lottery-warning",
    "urlToImage": "https://images.newrepublic.com/9fe675140d7fff4e07f0d215666036b49e465a99.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T14:49:15Z",
    "content": "On Wednesday, it was reported that the DOJ sent a letter to America PAC warning that the scheme may break federal laws against paying people to register to vote. Legal experts have said that at best,… [+1247 chars]"
  },
  {
    "source": { "id": null, "name": "The New Republic" },
    "author": "Edith Olmsted",
    "title": "Sketchy Pro-Trump Group Emerges at Last Minute to Skirt Campaign Rules",
    "description": "A shady new super PAC named for Supreme Court Justice Ruth Bader Ginsberg just spent nearly $20 million on efforts to help Donald Trump appear more moderate on abortion, but the group won’t reveal where its money comes from until after the election.\r\nThe pro-…",
    "url": "https://newrepublic.com/post/187575/donald-trump-super-pac-skirt-campaign-rules",
    "urlToImage": "https://images.newrepublic.com/f22cd01e909b7a200bffe130e5fb5730a9788b68.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
    "publishedAt": "2024-10-25T20:44:12Z",
    "content": "Robinson morphed into a political pariah after CNN published a sprawling investigation last month about his pre-politics proclivities, which included writing in online pornographic forums that he had… [+1710 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Sara Dorn, Forbes Staff, \n Sara Dorn, Forbes Staff\n https://www.forbes.com/sites/saradorn/",
    "title": "Trump Vs. Harris 2024 Polls: Tie In Final NYT/Siena Poll, As Race Narrows Weeks Before Election Day",
    "description": "Most polls indicate a tight race between Donald Trump and Kamala Harris.",
    "url": "https://www.forbes.com/sites/saradorn/2024/10/25/trump-vs-harris-2024-polls-trump-up-in-3-new-surveys-harris-leads-in-2-others/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6719151a5e0c7b729e61908a/0x0.jpg?format=jpg&crop=4100,2304,x0,y0,safe&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-25T12:12:04Z",
    "content": "Former President Donald Trump and Vice President Kamala Harris are in a dead-heat race for the White House, according to the final pre-election New York Times/Siena poll that finds a tie, but within … [+7758 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Mary Whitfill Roeloffs, Forbes Staff, \n Mary Whitfill Roeloffs, Forbes Staff\n https://www.forbes.com/sites/maryroeloffs/",
    "title": "Pennsylvania County Says It Found Hundreds Of Fraudulent Voter Registration Forms",
    "description": "Pennsylvania is this year’s most crucial swing state as Donald Trump and Kamala Harris remain locked in a tight election.",
    "url": "https://www.forbes.com/sites/maryroeloffs/2024/10/25/pennsylvania-county-says-it-found-hundreds-of-fraudulent-voter-registration-forms/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/671beb425e48c0c145a06ff7/0x0.jpg?format=jpg&crop=2467,1388,x0,y127,safe&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-25T19:05:11Z",
    "content": "Election officials in Lancaster County, Pennsylvania, said they've found and halted hundreds of fraudulent voter registration applications from a batch of nearly 2,500 that were dropped off at the Bo… [+4406 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Sughnen Yongo, Contributor, \n Sughnen Yongo, Contributor\n https://www.forbes.com/sites/sughnenyongo/",
    "title": "What Beyoncé’s Political Engagement Means For Celebrity Culture",
    "description": "According to reports, Beyonce is expected to join presidential hopeful Kamala Harris at a rally in Houston, Texas, focusing on abortion rights.",
    "url": "https://www.forbes.com/sites/sughnenyongo/2024/10/25/what-beyoncs-political-engagement-means-for-celebrity-culture/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/671aa1b966d31b454a9b54f9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-25T12:30:00Z",
    "content": "Beyoncé performs onstage during the \"RENAISSANCE WORLD TOUR\" at SoFi Stadium on September 01, 2023 ... [+] in Inglewood, California.\r\nWireImage for Parkwood\r\nBeyoncé is expected to join presidential … [+5029 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Conor Murray, Forbes Staff, \n Conor Murray, Forbes Staff\n https://www.forbes.com/sites/conormurray/",
    "title": "Ex-Editor Baron Decries 'Disturbing Spinelessness' Of Washington Post Not Endorsing For President",
    "description": "The Washington Post said it would no longer endorse candidates for president, days after the Los Angeles Times’ owner blocked the paper from endorsing Vice President Kamala Harris.",
    "url": "https://www.forbes.com/sites/conormurray/2024/10/25/ex-editor-baron-decries-disturbing-spinelessness-of-washington-post-not-endorsing-for-president/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/671bd697fcdcdd88727cd669/0x0.jpg?format=jpg&crop=2150,1210,x628,y204,safe&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-25T17:45:01Z",
    "content": "The Washington Posts former executive editor, Martin Baron, slammed the paper three years after his retirement over its refusal to endorse a candidate for president, following a similar wave of criti… [+2128 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Derek Saul, Forbes Staff, \n Derek Saul, Forbes Staff\n https://www.forbes.com/sites/dereksaul/",
    "title": "Kamala Harris Has More Billionaires Prominently Backing Her Than Trump—Buffett, Gates Weigh In (Updated)",
    "description": "The historically apolitical centibillionaires Warren Buffett and Bill Gates are taking different paths this election cycle.",
    "url": "https://www.forbes.com/sites/dereksaul/2024/10/25/kamala-harris-has-more-billionaires-prominently-backing-her-than-trump-buffett-gates-weigh-in-updated/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/615e19f5298aca27c9442928/0x0.jpg?format=jpg&crop=1585,1056,x0,y50,safe&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-25T12:52:47Z",
    "content": "Forbes found at least 100 billionaires in the corners of either former President Donald Trump or Vice President Kamala Harriswith many more backing Harrisbut unlike the worlds richest man Elon Musk, … [+15963 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Jay Ginsbach, Contributor, \n Jay Ginsbach, Contributor\n https://www.forbes.com/sites/jayginsbach/",
    "title": "Trump-Harris Odds And Betting Interest Soars As 2024 U.S. Presidential Election Nears",
    "description": "The watch and wager action is really heating up less than two week before the 2024 U.S. Presidential election on Nov. 5. Updated odds on Donald Trump and Kamala Harris and surging betting interest with information you can bet on.",
    "url": "https://www.forbes.com/sites/jayginsbach/2024/10/24/trump-harris-odds-and-betting-interest-soars-as-2024-us-presidential-election-nears/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/671ad4a8f6d007f4cf715cf9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-25T02:31:46Z",
    "content": "Democratic presidential nominee Vice President Kamala Harris speaks to reporters in Philadelphia, ... [+] Thursday, Oct. 24, 2024. (AP Photo/Matt Rourke)\r\nAssociated Press\r\nThe watch and wager action… [+3625 chars]"
  },
  {
    "source": { "id": null, "name": "Forbes" },
    "author": "Phoebe Liu, Forbes Staff, \n Phoebe Liu, Forbes Staff\n https://www.forbes.com/sites/phoebeliu/",
    "title": "Here Are The Other Billionaires Donating To The Same Pro-Kamala Harris Super PAC As Bill Gates",
    "description": "Gates’ donation to the PAC was done through dark money, but other billionaires including Netflix cofounder Reed Hastings contributed publicly to the PAC.",
    "url": "https://www.forbes.com/sites/phoebeliu/2024/10/25/billionaires-donating-to-same-pro-kamala-harris-super-pac-bill-gates-election/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/671aef2a069cf472548a5a09/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
    "publishedAt": "2024-10-25T10:30:00Z",
    "content": "Bill Gates, the world's 12th richest person, has largely stayed quiet about his political giving until this year.\r\nGetty Images for TIME\r\nAfter emphasizing bipartisanship and staying away from big po… [+4290 chars]"
  },
  {
    "source": { "id": null, "name": "Mcsweeneys.net" },
    "author": "Jen de Oliveira",
    "title": "270 Reasons: Because She Won’t Eliminate the Department of Education",
    "description": "Our friends at 270 Reasons are gathering a polyphonic orchestra of brilliant writers, teachers, doctors, filmmakers, artists, and citizens of all kinds to weigh in about their plans to vote this November. These opinion essays run the gamut from advocacy for b…",
    "url": "https://www.mcsweeneys.net/articles/because-she-wont-eliminate-the-department-of-education",
    "urlToImage": "http://edge.mcsw.net/mcsweeneys/0exnp3cevx54v252nm0goagu86x4",
    "publishedAt": "2024-10-25T13:00:00Z",
    "content": "Our friends at 270 Reasons are gathering a polyphonic orchestra of brilliant writers, teachers, doctors, filmmakers, artists, and citizens of all kinds to weigh in about their plans to vote this Nove… [+2110 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "New Polls Show Kamala Harris' Chances of Winning Michigan",
    "description": "The battle for Michigan remains extremely close between Vice President Kamala Harris and former President Donald Trump, although a handful of polls in recent weeks have shown positive signs for Democrats.\nThe Great Lakes State is among a handful of contests t…",
    "url": "https://biztoc.com/x/ab43058be917b649",
    "urlToImage": "https://biztoc.com/cdn/ab43058be917b649_s.webp",
    "publishedAt": "2024-10-25T21:47:23Z",
    "content": "The battle for Michigan remains extremely close between Vice President Kamala Harris and former President Donald Trump, although a handful of polls in recent weeks have shown positive signs for Democ… [+145 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Steve Bannon Details Decisive 'October Surprise' for 3 Swing States",
    "description": "Bannon suggested there will be a shift in minority voter sentiment against Kamala Harris in Pennsylvania, Michigan, and Georgia.",
    "url": "https://biztoc.com/x/a58deed3bb89b313",
    "urlToImage": "https://biztoc.com/cdn/805/og.png",
    "publishedAt": "2024-10-25T15:30:14Z",
    "content": "Bannon suggested there will be a shift in minority voter sentiment against Kamala Harris in Pennsylvania, Michigan, and Georgia.\r\nThis story appeared on newsweek.com, 2024-10-25 15:20:19."
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Trump Within Striking Distance of Harris in New Hampshire: Poll",
    "description": "Former President Trump has closed the gap on Vice President Kamala Harris in New Hampshire, where her lead has now narrowed to just three points.",
    "url": "https://biztoc.com/x/34a9fd9ec46a6c61",
    "urlToImage": "https://biztoc.com/cdn/805/og.png",
    "publishedAt": "2024-10-25T15:19:10Z",
    "content": "Former President Trump has closed the gap on Vice President Kamala Harris in New Hampshire, where her lead has now narrowed to just three points.\r\nThis story appeared on newsweek.com, 2024-10-25 15:1… [+4 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "news.google.com",
    "title": "Do investors suddenly care if Trump or Harris wins? What’s next for stocks",
    "description": "Do investors suddenly care if Trump or Harris wins? What’s next for stocks. MarketWatch\nDon’t Rule Out a Market Panic. How to Stress-Test Your Portfolio Before Election. Barron's\nA look at how the stock market does the week before a presidential election CNBC…",
    "url": "https://biztoc.com/x/eea35795e3dbc2d0",
    "urlToImage": "https://biztoc.com/cdn/805/og.png",
    "publishedAt": "2024-10-25T21:36:09Z",
    "content": "Do investors suddenly care if Trump or Harris wins? Whats next for stocks. MarketWatchDont Rule Out a Market Panic. How to Stress-Test Your Portfolio Before Election. Barron'sA look at how the stock … [+150 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Half of Voters Say Donald Trump Is a Fascist. Some Say Kamala Harris Is Too",
    "description": "Half of Americans see former President Donald Trump as a fascist, according to a new ABC News/Ipsos poll, roughly twice as many who say the same of Vice President Kamala Harris.\nLess than two weeks before Election Day, 44 percent of registered voters said Tru…",
    "url": "https://biztoc.com/x/f1a7c020198ac48a",
    "urlToImage": "https://biztoc.com/cdn/f1a7c020198ac48a_s.webp",
    "publishedAt": "2024-10-25T16:37:28Z",
    "content": "Half of Americans see former President Donald Trump as a fascist, according to a new ABC News/Ipsos poll, roughly twice as many who say the same of Vice President Kamala Harris.Less than two weeks be… [+141 chars]"
  },
  {
    "source": { "id": null, "name": "Biztoc.com" },
    "author": "newsweek.com",
    "title": "Harris Flounders in Final Media Sprint: 'Word Salads Aren't Very Tasty'",
    "description": "Vice President Kamala Harris was slammed for avoiding media appearances when she launched her nascent presidential campaign less than four months before the election. Now that she's embraced the media circuit, the Democratic nominee is being criticized — incl…",
    "url": "https://biztoc.com/x/3a6ca5953fb075ac",
    "urlToImage": "https://biztoc.com/cdn/3a6ca5953fb075ac_s.webp",
    "publishedAt": "2024-10-25T21:35:58Z",
    "content": "Vice President Kamala Harris was slammed for avoiding media appearances when she launched her nascent presidential campaign less than four months before the election. Now that she's embraced the medi… [+143 chars]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-25T07:32:17Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "Blaze News",
    "title": "RealClearPolitics polling average has devastating news for Kamala Harris",
    "description": "Just 11 days before Election Day, the RealClearPolitics average of polls is showing a tie between Republican former President Donald Trump and Democratic Vice President Kamala Harris. Both candidates have 48.5% of the vote, according to the RCP average. The a…",
    "url": "https://www.theblaze.com/news/rcp-tied-trump-harris-polls",
    "urlToImage": "https://www.theblaze.com/media-library/realclearpolitics-polling-average-has-devastating-news-for-kamala-harris.jpg?id=53887406&width=1200&height=600&coordinates=0%2C166%2C0%2C167",
    "publishedAt": "2024-10-25T16:35:00Z",
    "content": "Just 11 days before Election Day, the RealClearPolitics average of polls is showing a tie between Republican former President Donald Trump and Democratic Vice President Kamala Harris. \r\nBoth candidat… [+1504 chars]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "BlazeTV Staff",
    "title": "Electoral environment bodes well for Republicans — but one nefarious F-word still lurks in the background",
    "description": "The Kamala Harris campaign has two pillars holding it up: “baby killing” and the narrative “[Trump] is literally Hitler.” “They don’t have anything else to run on,” says Steve Deace. According to Gallup’s most recent favorability polling\r\n, it would seem as i…",
    "url": "https://www.theblaze.com/shows/steve-deace-show/electoral-environment-bodes-well-for-republicans-but-one-nefarious-f-word-still-lurks-in-the-background",
    "urlToImage": "https://www.theblaze.com/media-library/image.jpg?id=53871656&width=1200&height=600&coordinates=0%2C0%2C0%2C120",
    "publishedAt": "2024-10-25T17:00:00Z",
    "content": "The Kamala Harris campaign has two pillars holding it up: baby killing and the narrative [Trump] is literally Hitler. \r\nThey dont have anything else to run on, says Steve Deace. \r\nAccording to Gallup… [+2051 chars]"
  },
  {
    "source": { "id": null, "name": "TheBlaze" },
    "author": "Christopher Bedford",
    "title": "There is no October surprise",
    "description": "It’s 11 days until the election, and the Democrats have tried it all. You can’t mark them down for effort, but you can certainly deduct for originality. As from the Hollywood liberals now running the party, all we’re getting are sequels and reboots.\n\nI suppos…",
    "url": "https://www.theblaze.com/columns/opinion/there-is-no-october-surprise",
    "urlToImage": "https://www.theblaze.com/media-library/there-is-no-october-surprise.jpg?id=53886189&width=1200&height=600&coordinates=0%2C85%2C0%2C86",
    "publishedAt": "2024-10-25T12:01:07Z",
    "content": "Its 11 days until the election, and the Democrats have tried it all. You cant mark them down for effort, but you can certainly deduct for originality. As from the Hollywood liberals now running the p… [+7180 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "Van Jones: Kamala Harris And Trump Are Not Taking The Same Exam To Be President",
    "description": "CNN contributor Van Jones made a very astute and important observation while being part of a panel discussion on Kamala Harris's CNN Town Hall performance Wednesday night. \nThis was a shout out to the viewers as well as the media, who have doing its part in n…",
    "url": "https://crooksandliars.com/2024/10/van-jones-kamala-harris-and-trump-are-not",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55940.jpg",
    "publishedAt": "2024-10-25T15:18:45Z",
    "content": "CNN contributor Van Jones made a very astute and important observation while being part of a panel discussion on Kamala Harris's CNN Town Hall performance Wednesday night. \r\nThis was a shout out to t… [+1368 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "John Amato",
    "title": "JD Vance Demands Kamala Harris To 'Shut The Hell Up' About John Kellys Claims",
    "description": "Vice Presidential nominee JD Vance threw a fit at General Mark Kelly's revelations regarding Trump's admiration for Hitler.\nThen he weirdly demanded that Kamala Harris 'shut the hell up' about it. \nMethinks Hillbilly Vanilli is WAY too emotional to lead.\nThat…",
    "url": "https://crooksandliars.com/2024/10/Vance-kamala-shut-the-hell-up",
    "urlToImage": "https://crooksandliars.com/files/mediaposters/2024/10/55943.jpg",
    "publishedAt": "2024-10-25T16:33:39Z",
    "content": "Vice Presidential nominee JD Vance threw a fit at General Mark Kelly's revelations regarding Trump's admiration for Hitler.\r\nThen he weirdly demanded that Kamala Harris 'shut the hell up' about it. \r… [+4255 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "Chris capper Liebenthal",
    "title": "Drunk Driver Barely Missed Harris Motorcade",
    "description": "Disaster was barely avoided on Monday night in Milwaukee:\n\nA suspected drunken driver came within inches of Vice President Kamala Harris' motorcade while on Interstate 94 in downtown Milwaukee Monday night.\r\n\nThe wrong-way driver was traveling westbound in th…",
    "url": "https://crooksandliars.com/2024/10/drunk-driver-barely-missed-harris",
    "urlToImage": "https://crooksandliars.com/files/primary_image/24/10/screenshot_2024-10-24_152328.png",
    "publishedAt": "2024-10-25T11:24:32Z",
    "content": "Disaster was barely avoided on Monday night in Milwaukee:\r\nA suspected drunken driver came within inches of Vice President Kamala Harris' motorcade while on Interstate 94 in downtown Milwaukee Monday… [+1704 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "Heather",
    "title": "Charlamagne Tha God Hits CNN For Spending More Time Covering Harris' Blackness Than Trump's Fascism",
    "description": "I'm not a fan of Charlamagne tha God, but he's right when it comes to just how godawful so much of CNN's political horse race coverage is. Charlamagne made an appearance on Anderson Cooper's show this Thursday night, and was having none of Cooper's nonsense o…",
    "url": "https://crooksandliars.com/2024/10/charlamagne-tha-god-hits-cnn-spending-more",
    "urlToImage": "https://crooksandliars.com/files/primary_image/24/10/cnn-charlamagne-cooper-102424.jpg",
    "publishedAt": "2024-10-25T11:22:02Z",
    "content": "I'm not a fan of Charlamagne tha God, but he's right when it comes to just how godawful so much of CNN's political horse race coverage is. Charlamagne made an appearance on Anderson Cooper's show thi… [+4065 chars]"
  },
  {
    "source": { "id": null, "name": "Crooksandliars.com" },
    "author": "Ed Scarce",
    "title": "Two More Editorial Writers At The LA Times Quit Over Blocked Endorsement",
    "description": "While we're all wondering if a Trump presidency might mean an end to press freedom and an embrace of Fascism in the United States we're seeing more and more overt signs that it's already here.\nSource: The Wrap\nThe Los Angeles Times has lost two more longtime …",
    "url": "https://crooksandliars.com/2024/10/two-more-editorial-writers-la-times-quit",
    "urlToImage": "https://crooksandliars.com/files/primary_image/24/10/patrick-la-times-owner-ezgif.com-webp-to-jpg-converter.jpg",
    "publishedAt": "2024-10-25T18:49:41Z",
    "content": "While we're all wondering if a Trump presidency might mean an end to press freedom and an embrace of Fascism in the United States we're seeing more and more overt signs that it's already here.The Los… [+1391 chars]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-25T19:17:06Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-25T15:46:32Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": "nbc-news", "name": "NBC News" },
    "author": "NBC News",
    "title": "Trump and Harris hold dueling events in Texas",
    "description": "The latest news and live updates on the 2024 election. Follow Donald Trump and Kamala Harris in Texas and Barack Obama and JD Vance in North Carolina.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/harris-trump-election-live-updates-rcna176309",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-09/240927-spit-trump-harris-ch-1314-0e41e2.jpg",
    "publishedAt": "2024-10-25T11:22:04Z",
    "content": "Former GOP Rep. Liz Cheney will campaign in Michigan on Monday with Rep. Elissa Slotkin, Democrats' Senate nominee in Michigan.\r\nCheney and Slotkin will be in Grand Rapids, once a conservative strong… [+1507 chars]"
  },
  {
    "source": { "id": "nbc-news", "name": "NBC News" },
    "author": "Allan Smith",
    "title": "Gov. Josh Shapiro weighs in on Elon Musk, misinformation and Harris' chances in Pennsylvania",
    "description": "Josh Shapiro sits atop one of the most important states this election, and he said he’s doing everything he can to make sure Kamala Harris wins in Pennsylvania.",
    "url": "https://www.nbcnews.com/politics/2024-election/josh-shapiro-weighs-elon-musk-pennsylvania-election-misinformation-rcna177117",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241024-jared-soares-joshshapiro-mn-1650-b21e7d.jpg",
    "publishedAt": "2024-10-25T18:46:18Z",
    "content": "LANCASTER, Pa.  Josh Shapiro sits atop what may be one of the most important states this election, and he said hes doing everything he can to make sure Kamala Harris wins in Pennsylvania. \r\nEvery ele… [+9173 chars]"
  },
  {
    "source": { "id": "new-york-magazine", "name": "New York Magazine" },
    "author": "Ed Kilgore",
    "title": "Kamala Harris’s Lost Opportunity on Immigration",
    "description": "For Kamala Harris, the imperative to look tough on border policy may have forfeited an opportunity to raise questions about the implications of Trump’s mass deportation plans and their effect on citizens as well as undocumented immigrants.",
    "url": "http://nymag.com/intelligencer/article/kamala-harriss-lost-opportunity-on-immigration.html",
    "urlToImage": "https://pyxis.nymag.com/v1/imgs/867/624/f443fa952e41238df74b0f42df0c755ac6-kamala-immigration.1x.rsocial.w1200.jpg",
    "publishedAt": "2024-10-25T21:31:28Z",
    "content": "Theres not much question that if Kamala Harris loses this crazy-close election, it will mostly be over public unhappiness with the Biden-Harris administrations handling of the economic and immigratio… [+5255 chars]"
  },
  {
    "source": { "id": "new-york-magazine", "name": "New York Magazine" },
    "author": "Nia Prater",
    "title": "GOP Leaders Finally Call Out Extremist Rhetoric (of Harris)",
    "description": "In a joint statement, Mitch McConnell and Mike Johnson criticized Kamala Harris for calling Donald Trump a ‘fascist,’ an insult the former president has used against her.",
    "url": "http://nymag.com/intelligencer/article/mcconnell-johnson-call-out-extremist-rhetoric-of-harris.html",
    "urlToImage": "https://pyxis.nymag.com/v1/imgs/096/a35/1f632b125b08beb31a4d5b125f21f82e6e-Johnson-McConnell.1x.rsocial.w1200.jpg",
    "publishedAt": "2024-10-25T17:14:14Z",
    "content": "John Kelly, who once served as chief of staff to Donald Trump, rocked the political world this week when he said in an interview that his former boss fit the definition of a fascist and warned about … [+3309 chars]"
  },
  {
    "source": { "id": "new-york-magazine", "name": "New York Magazine" },
    "author": "Ed Kilgore",
    "title": "Before Harris Snub, Washington Post Refused to Endorse Doomed Dukakis",
    "description": "Before the Kamala Harris snub, Michael Dukakis was the only Democrat the Washington ‘Post’ had refused to endorse since 1976. The paper’s last non-endorsement helped seal Dukakis’s fate. This one says more about the ‘Post.’",
    "url": "http://nymag.com/intelligencer/article/before-harris-snub-post-refused-to-endorse-doomed-dukakis.html",
    "urlToImage": "https://pyxis.nymag.com/v1/imgs/9a7/8c4/910229852b9260defcd7488adeba99791e-Mike-Dukakis.1x.rsocial.w1200.jpg",
    "publishedAt": "2024-10-25T19:31:46Z",
    "content": "The Washington Post, a font of hostile reporting and opinion about Donald Trump for many years now, has decided against endorsing Kamala Harris or any candidate in her incredibly close, tense contest… [+5544 chars]"
  },
  {
    "source": { "id": "new-york-magazine", "name": "New York Magazine" },
    "author": "Jonathan Chait",
    "title": "Trump Has Already Punished Jeff Bezos Over the Washington Post’s Independence",
    "description": "When Donald Trump first ran for president, he began to threaten that Amazon and Jeff Bezos would pay the price.  Now the Post is spiking a planned endorsement of Kamala Harris. Endorsements don’t matter, but knuckling under to pressure does.",
    "url": "http://nymag.com/intelligencer/article/washington-post-endorsement-kamala-harris-trump-bezos-amazon-threat.html",
    "urlToImage": "https://pyxis.nymag.com/v1/imgs/b1a/ad9/fa6f151d8aaab03df240db063b842f34ba-trump-national-interest-6.1x.rsocial.w1200.jpg",
    "publishedAt": "2024-10-25T20:15:50Z",
    "content": "When Donald Trump first ran for president, he began to threaten that Amazon and Jeff Bezos would pay the price. If I become president oh, do they have problems. Theyre going to have such problems, he… [+2805 chars]"
  },
  {
    "source": { "id": null, "name": "Queerty.com" },
    "author": "Jahan Sharif",
    "title": "What Black male voters should consider about Kamala Harris",
    "description": "Vice President Kamala Harris' campaign presents a unique opportunity for Black male voters to finally be heard",
    "url": "https://www.queerty.com/what-black-male-voters-should-consider-about-kamala-harris-20241025",
    "urlToImage": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2024/10/gettyimages-2177980976-scaled.jpg?auto=format&auto=compress&fit=crop&gravity=smart&w=1200&h=630&force_format=jpeg&wat=1&wat_pad=10&wat_url=https://queerty-prodweb.s3.amazonaws.com/2024/07/nativeson-logo-white.png&wat_gravity=south&wat_scale=75",
    "publishedAt": "2024-10-25T18:00:00Z",
    "content": "Image Credit: Sarah Rice for The Washington Post via Getty Images\r\nWhen I was a field organizer for President Obamas re-election campaign in 2012, our leadership frequently discussed our role in cons… [+5182 chars]"
  },
  {
    "source": { "id": null, "name": "Queerty.com" },
    "author": "Kelsey Minor",
    "title": "Beyoncé & Kamala Harris on stage together in Houston and it is “epic”",
    "description": "Vice President Kamala Harris brings out global superstar and Houston native Beyoncé to campaign with her as she makes a stop in the city with less than two weeks to go before Election Day.",
    "url": "https://www.queerty.com/beyonce-kamala-harris-on-stage-together-in-houston-and-it-is-epic-20241025",
    "urlToImage": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2024/10/gettyimages-1503043559-594x594-1.jpg?auto=format&auto=compress&fit=crop&gravity=smart&w=1200&h=630&force_format=jpeg&wat=1&wat_pad=10&wat_url=https://queerty-prodweb.s3.amazonaws.com/2024/07/nativeson-logo-white.png&wat_gravity=south&wat_scale=75",
    "publishedAt": "2024-10-25T21:00:00Z",
    "content": "Vice President Kamala Harris heads to Houston, where she will be joined by hometown favorite and global superstar Beyoncé. \r\nMultiple news outlets report they have confirmed the news with the Crazy I… [+2125 chars]"
  },
  {
    "source": { "id": "rt", "name": "RT" },
    "author": "RT",
    "title": "Nuland’s husband quits WaPo after Bezos decision",
    "description": "Robert Kagan has resigned from the Jeff Bezos-owned Washington Post after it would not endorse Kamala Harris for US president Read Full Article at RT.com",
    "url": "https://www.rt.com/news/606450-washington-post-harris-endorsement/",
    "urlToImage": "https://mf.b37mrtl.ru/files/2024.10/article/671c239285f5404ea1750ec3.jpg",
    "publishedAt": "2024-10-25T23:05:27Z",
    "content": "The Washington Post editor-at-large Robert Kagan has resigned in protest, after the newspaper owned by Amazon magnate Jeff Bezos decided to forego a presidential endorsement for the first time since … [+2498 chars]"
  },
  {
    "source": { "id": null, "name": "Fark.com" },
    "author": null,
    "title": "Two more LA Times editorial editors resign in protest after the paper's billionaire wouldn't let the editorial board endorse Kamala Harris for president. The Fourth Estate surrenders [Followup]",
    "description": "Two more LA Times editorial editors resign in protest after the paper's billionaire wouldn't let the editorial board endorse Kamala Harris for president. The Fourth Estate surrenders",
    "url": "https://www.fark.com/comments/13440966/Two-more-LA-Times-editorial-editors-resign-in-protest-after-papers-billionaire-wouldnt-let-editorial-board-endorse-Kamala-Harris-for-president-The-Fourth-Estate-surrenders",
    "urlToImage": "https://usrimg-850.fark.net/j/jT/fark_jToYr1fxUj5SCoPLfPp-RYQ_jyA.jpg?AWSAccessKeyId=JO3ELGV4BGLFW7Y3EZXN&Expires=1730088000&Signature=LuzXEkTZqULH19mSB9EGwSRo%2BX4%3D",
    "publishedAt": "2024-10-25T19:05:06Z",
    "content": "John_From:NewportBarGuy: Maybe they can start an actual news thingy? I'll pay money for actual journalism.\r\nThis 100. There is a huge open market for real news these days.\r\n1. Journalism doesn't brin… [+780 chars]"
  },
  {
    "source": { "id": null, "name": "Bleeding Cool News" },
    "author": "Ray Flook",
    "title": "Borat & Ali G Return, Take on VP Kamala Harris, Donald Trump (VIDEO)",
    "description": "With only days to go until the U.S. decides between Vice-President Kamala Harris and ex-reality show host, multi-impeached ex-POTUS, and convicted felon Donald Trump, it seems like everyone and their mother (and their mother's mother) has had a chance to shar…",
    "url": "https://bleedingcool.com/tv/borat-ali-g-return-take-on-vp-kamala-harris-donald-trump-video/",
    "urlToImage": "https://bleedingcool.com/wp-content/uploads/2024/10/MixCollage-25-Oct-2024-10-24-AM-3912-2000x1125.jpg",
    "publishedAt": "2024-10-25T15:37:10Z",
    "content": "Posted in: NBC, Opinion, TV, TV | Tagged: ali g, borat, kamala harris, sacha baron cohen, trump\r\nOn The Tonight Show with Jimmy Fallon, Sacha Baron Cohen gave Borat and Ali G a chance to chime in on … [+2253 chars]"
  },
  {
    "source": { "id": null, "name": "Bleeding Cool News" },
    "author": "Ray Flook",
    "title": "Howard Stern: Springsteen Performs \"Born in the USA\" Alt Take & More",
    "description": "In what would mark his first live radio performance with The E Street Band, Bruce Springsteen (Hulu's Road Diary) checked in with radio icon and SiriusXM host Howard Stern a day before taking part in tonight's big rally event for VP Kamala Harris and Gov. Tim…",
    "url": "https://bleedingcool.com/tv/howard-stern-springsteen-performs-born-in-the-usa-alt-take-more/",
    "urlToImage": "https://bleedingcool.com/wp-content/uploads/2024/10/MixCollage-24-Oct-2024-07-40-PM-6950-2000x1125.jpg",
    "publishedAt": "2024-10-25T00:07:08Z",
    "content": "Posted in: streaming, TV, YouTube | Tagged: bruce springsteen, howard stern\r\nCheck out the highlights from Bruce Springsteen and The E Street Band's visit with SiriusXM's The Howard Stern Show from W… [+1924 chars]"
  },
  {
    "source": { "id": null, "name": "PR Daily" },
    "author": "Casey Weldon",
    "title": "The Scoop: Podcasts influence election season like never before",
    "description": "Also: White House strategy underscores potential power of AI; consumers remain sluggish despite improving economic landscape. With a week and a half  until Election Day, Donald Trump and Kamala Harris are doing everything in their power to fi engage, and sway…",
    "url": "https://www.prdaily.com/the-scoop-podcasts-influence-election-season-like-never-before/",
    "urlToImage": "https://s39940.pcdn.co/wp-content/uploads/2024/10/iStock-1412634953.jpg",
    "publishedAt": "2024-10-25T15:31:58Z",
    "content": "With a week and a half  until Election Day, Donald Trump and Kamala Harris are doing everything in their power to fi engage, and sway notoriously hard-to-reach segments of the American electorate.\r\nO… [+6933 chars]"
  },
  {
    "source": { "id": null, "name": "Adweek" },
    "author": "Brad Pareso",
    "title": "Harris Town Hall Nets CNN More Than 3M Viewers",
    "description": "Vice President Kamala Harris' CNN town hall Wednesday night was the most-watched program of the evening among all the cable networks, with 3.334 million total viewers, and it finished second in the adults 25-through-54 demographic, behind the National Basketb…",
    "url": "https://www.adweek.com/morning-media-newsfeed/harris-town-hall-nets-cnn-more-than-3m-viewers/",
    "urlToImage": "https://www.adweek.com/wp-content/themes/adweek-next/assets/images/adweek-placeholder.png",
    "publishedAt": "2024-10-25T11:56:00Z",
    "content": "Harris CNN town hall Wednesday night was the most-watched program of the evening among all the cable networks, with 3.334 million total viewers, and it finished second in the adults 25-through-54 dem… [+398 chars]"
  },
  {
    "source": { "id": null, "name": "Adweek" },
    "author": "Brad Pareso",
    "title": "Two More LA Times Editorial Writers Quit Over ‘Chickens—’ Owner’s Block of Harris Endorsement",
    "description": "The Los Angeles Times lost two more longtime editorial writers, the latest in a growing exodus to protest owner Patrick Soon-Shiong's interference with the paper's planned endorsement of Vice President Kamala Harris, TheWrap can exclusively report. (TheWrap) …",
    "url": "https://www.adweek.com/morning-media-newsfeed/two-more-la-times-editorial-writers-quit-over-chickens-owners-block-of-harris-endorsement/",
    "urlToImage": "https://www.adweek.com/wp-content/themes/adweek-next/assets/images/adweek-placeholder.png",
    "publishedAt": "2024-10-25T11:57:00Z",
    "content": "The Los Angeles Times lost two more longtime editorial writers, the latest in a growing exodus to protest owner Patrick Soon-Shiongs interference with the papers planned endorsement of Vice President… [+286 chars]"
  },
  {
    "source": { "id": null, "name": "Just Jared" },
    "author": "Just Jared",
    "title": "Bruce Springsteen Performs at Kamala Harris Rally in Georgia, Slams Donald Trump as 'American Tyrant'",
    "description": "Bruce Springsteen is showing his support for Kamala Harris! After officially endorsing the Vice President earlier this month, the 75-year-old rock legend joined Harris, 60, on the campaign trail as she hosted a rally on Thursday (October 24) held at James R. …",
    "url": "https://www.justjared.com/2024/10/25/bruce-springsteen-performs-at-kamala-harris-rally-in-georgia-slams-donald-trump-as-american-tyrant/",
    "urlToImage": "https://cdn01.justjared.com/wp-content/uploads/headlines/2024/10/springsteen-tyrant.jpg",
    "publishedAt": "2024-10-25T15:47:53Z",
    "content": "Bruce Springsteen is showing his support for Kamala Harris!\r\nAfter officially endorsing the Vice President earlier this month, the 75-year-old rock legend joined Harris, 60, on the campaign trail as … [+1188 chars]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-25T12:09:10Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-25T14:54:47Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-25T18:03:43Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": null, "name": "[Removed]" },
    "author": null,
    "title": "[Removed]",
    "description": "[Removed]",
    "url": "https://removed.com",
    "urlToImage": null,
    "publishedAt": "2024-10-25T16:54:02Z",
    "content": "[Removed]"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "Aimee Picchi",
    "title": "Washington Post won't endorse presidential candidate, sparking outrage",
    "description": "The Washington Post on Friday said it will not endorse Kamala Harris, Donald Trump or any other candidate this year.",
    "url": "https://www.cbsnews.com/news/washington-post-endorsement-jeff-bezos-kamala-harris-trump-latimes/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2022/06/10/ab744ad7-ac97-48b4-ba73-3a2f9e32b161/thumbnail/1200x630/33e334d91aca1a7253ee994ce8c91b6c/download.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T22:36:20Z",
    "content": "The Washington Post's publisher, William Lewis, on Friday said the newspaper would not endorse a presidential candidate in this year's election or in future elections, a stance that sparked outrage f… [+4742 chars]"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Why Kamala Harris is campaigning in Texas with race in homestretch",
    "description": "Kamala Harris will be joined by Beyoncé at a rally in Houston, Texas, on Friday with just 11 days remaining until Election Day. CBS News congressional correspondent Scott MacFarlane has more on why Harris is campaigning in a non-battleground state with the ra…",
    "url": "https://www.cbsnews.com/video/why-kamala-harris-is-campaigning-in-texas-with-race-in-homestretch/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/25/2d0ab757-4b5b-42f8-a4b0-11ee1002504e/thumbnail/1200x630/6fc29c7a3d0b47cf7b56386792d2f44f/cbsn-fusion-why-kamala-harris-is-campaigning-in-texas-with-race-in-homestretch-thumbnail.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280",
    "publishedAt": "2024-10-25T15:02:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Bruce Springsteen, Tyler Perry and others join Harris at star-studded rally amid early voting",
    "description": "A star-studded rally for Vice President Kamala Harris included former President Barack Obama, singer Bruce Springsteen, actor Samuel L. Jackson and filmmakers Tyler Perry and Spike Lee on Thursday in Atlanta. The Harris campaign looked to mobilize key parts o…",
    "url": "https://www.cbsnews.com/video/bruce-springsteen-tyler-perry-and-others-join-harris-at-star-studded-rally-amid-early-voting/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/25/2bff6b91-a1e7-462b-86cf-58f512260ed4/thumbnail/1200x630/335d1941a6291381444f76c2f848aab3/1025-cmo-harris.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280",
    "publishedAt": "2024-10-25T14:10:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris and Obama campaign together for first time",
    "description": "Former President Barack Obama introduced Vice President Kamala Harris at a campaign rally in Atlanta, Georgia, on Thursday night, marking the first time they have campaigned together. CBS News congressional correspondent Nikole Killion reports.",
    "url": "https://www.cbsnews.com/video/harris-obama-campaign-together-first-time/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/25/25402d07-3ccf-425c-87f7-3698062ad714/thumbnail/1200x630/981c0768a4fddc722b59d60fc4905d9c/cbsn-fusion-harris-obama-campaign-together-first-time-thumbnail.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280",
    "publishedAt": "2024-10-25T00:53:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Here's why Harris, Trump are campaigning in Texas",
    "description": "Vice President Kamala Harris and former President Donald Trump are both taping viral podcasts while in Texas, a solidly red state where each candidate will discuss issues that resonate with their bases. CBS News' Nancy Cordes and Libby Cathey report.",
    "url": "https://www.cbsnews.com/video/heres-why-harris-trump-are-campaigning-in-texas/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/25/dd3bc8e0-0fba-4b51-a8d1-54d976d61656/thumbnail/1200x630/1ff5e4b1abb85e89ca1ae33a0474cbfd/cbsn-fusion-heres-why-harris-trump-are-campaigning-in-texas-thumbnail.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T19:44:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "\"Veep\" creator on comparisons between Kamala Harris and Veep's Selina Meyers",
    "description": "From the moment Kamala Harris became the Democratic nominee, fans of the hit HBO show \"Veep\" drew comparisons to lead character Selina Meyer. But one person who isn't laughing at the comparison is the show's creator, Armando Iannucci.",
    "url": "https://www.cbsnews.com/video/veep-creator-on-comparisons-between-kamala-harris-and-veeps-selina-meyers/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/25/835d7c5d-9ed2-4bb8-bcef-f62e595125e1/thumbnail/1200x630/52aa74a88eaca614d6909b1155aaba29/1025-cmoplus-iannucciveep-williams.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280",
    "publishedAt": "2024-10-25T14:56:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "How Trump, Harris are rallying base supporters, focusing on top issues",
    "description": "Former President Donald Trump and Vice President Kamala Harris are focusing some of their efforts before the November election on base supporters with celebrity endorsements and rallies --  Harris will chat abortion and reproductive rights at her Houston rall…",
    "url": "https://www.cbsnews.com/video/trump-harris-rallying-base-supporters-focusing-on-top-issues/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/25/26f1ae72-9cde-45df-a6f8-bc59a4270d72/thumbnail/1200x630/c8eccc10c7a1341aecd8169da6652dfb/cbsn-fusion-trump-harris-rallying-base-supporters-focusing-on-top-issues-thumbnail.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T19:06:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris to tackle Texas' abortion ban in Houston rally with Beyoncé, Willie Nelson",
    "description": "In a rally Friday night in Houston, Texas, Vice President Kamala Harris will argue that Texas' near total abortion ban is endangering pregnant women. Beyoncé and Willie Nelson are set to appear alongside Harris. Nancy Cordes reports from the campaign trail.",
    "url": "https://www.cbsnews.com/video/harris-to-tackle-texas-abortion-ban-in-houston-rally-with-beyonce-willie-nelson/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/25/4243e31b-cd3c-4660-aeee-987fa87b7e89/thumbnail/1200x630/f4943fb7debb7ca9f88f106000eb68e7/coredess.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T23:33:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Kemp discusses relationship with Trump as tight Georgia race against Harris remains",
    "description": "Georgia Gov. Brian Kemp is weighing in on his relationship with Donald Trump as efforts from the former president's campaign and Vice President Kamala Harris' campaign to swing Georgia ramp up. CBS News' Nikole Killion reports.",
    "url": "https://www.cbsnews.com/video/kemp-discusses-relationship-with-trump-as-tight-georgia-race-against-harris-remains/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/25/d8d7cdb9-a581-4cd6-96a1-68d1becfd008/thumbnail/1200x630/c9ff1ca7246fb6178455336e60adfbb3/cbsn-fusion-kemp-discusses-relationship-with-trump-as-tight-georgia-race-against-harris-remains-thumbnail-3291932-640x360.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T18:52:27Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris, Trump make final campaign pitches, plans for post-election scenarios",
    "description": "With 11 days until Election Day, Kamala Harris and Donald Trump are honing their messaging for remaining undecided voters. CBS News chief election and campaign correspondent Robert Costa has the latest.",
    "url": "https://www.cbsnews.com/video/harris-trump-make-final-campaign-pitches/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/25/75c196d8-20c0-4e32-bb54-37606ba3544d/thumbnail/1200x630/b3599d88addee6129ecc010c55cff636/cbsn-fusion-harris-trump-make-final-campaign-pitches-thumbnail.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T15:38:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris, Trump in Texas with 11 days until Election Day",
    "description": "The presidential candidates are in the Lone Star State on Friday. Vice President Kamala Harris will team up with Beyoncé, while former President Donald Trump will sit down with Joe Rogan. CBS News' Zak Hudak and Fin Gómez have the latest on the state of the 2…",
    "url": "https://www.cbsnews.com/video/harris-trump-texas-11-days-until-election-day/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/25/94c8744b-7bfd-43ab-9107-53e285989f5d/thumbnail/1200x630/33990d498978cecb96a98521ec91411c/cbsn-fusion-harris-trump-texas-11-days-until-election-day-thumbnail.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T23:36:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": null,
    "title": "Norah O'Donnell interviews VP Kamala Harris across CBS News platforms beginning Oct. 27",
    "description": "Preview: The \"CBS Evening News\" anchor's interview with the Democratic presidential nominee will air on \"CBS Sunday Morning,\" with additional excerpts appearing on \"Face the Nation,\" \"CBS Mornings,\" \"CBS Evening News\" and CBS News 24/7.",
    "url": "https://www.cbsnews.com/news/norah-odonnell-interviews-vice-president-kamala-harris-across-cbs-news-platforms-beginning-oct-27/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/01/6f6ecffe-543b-4095-8300-d13aeb047bf1/thumbnail/1200x630/0b487c58357f9754575e2da21b25ac39/gettyimages-2165608844.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T21:30:00Z",
    "content": "\"CBS Evening News\" anchor and managing editor Norah O'Donnell will interview Vice President Kamala Harris in Kalamazoo, Mich., this weekend for a CBS News exclusive.\r\nO'Donnell will join the Democrat… [+1055 chars]"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris and Béyonce in Texas, Trump joining Rogan podcast",
    "description": "Vice President Kamala Harris and former President Donald Trump will both be in Texas campaigning Friday. Harris will rally Houston voters with Beyoncé. CBS News' Scott MacFarlane has more on her expected remarks. Also, Trump will be in Austin to discuss immig…",
    "url": "https://www.cbsnews.com/video/harris-and-byonce-in-texas-trump-joining-rogan-podcast/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/25/3271bdcb-e274-44bd-b4c6-b1593f190003/thumbnail/1200x630/9ddb4af57e1ff6743a3bfea2f97c90a2/cbsn-fusion-harris-and-byonce-in-texas-trump-joining-rogan-podcast-thumbnail.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T17:52:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Harris and Beyoncé in Texas, Trump joining Rogan podcast",
    "description": "Vice President Kamala Harris and former President Donald Trump will both be in Texas campaigning Friday. Harris will rally Houston voters with Beyoncé. CBS News' Scott MacFarlane has more on her expected remarks. Also, Trump will be in Austin to discuss immig…",
    "url": "https://www.cbsnews.com/video/harris-and-beyonce-in-texas-trump-joining-rogan-podcast/",
    "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/25/3271bdcb-e274-44bd-b4c6-b1593f190003/thumbnail/1200x630/9ddb4af57e1ff6743a3bfea2f97c90a2/cbsn-fusion-harris-and-byonce-in-texas-trump-joining-rogan-podcast-thumbnail.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8",
    "publishedAt": "2024-10-25T17:53:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "Beyoncé to join Harris in Houston, Trump holding campaign event at Madison Square Garden",
    "description": "Vice President Kamala Harris is leaning into star power in the closing days of her presidential campaign, with both Beyoncé and Bruce Springsteen playing parts in her rallies this week. Meanwhile, former President Donald Trump is set to hold a major rally thi…",
    "url": "https://www.cbsnews.com/video/beyonc-to-join-harris-in-houston-trump-holding-campaign-event-at-madison-square-garden/",
    "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/25/0d533db1-eb29-4fe3-abd6-fb9870e7d395/thumbnail/1200x630/66c7cb6d71360aef222ac5e4182835ec/cbsn-fusion-beyonc-to-join-harris-in-houston-trump-holding-campaign-event-at-madison-square-garden-thumbnail.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280",
    "publishedAt": "2024-10-25T12:46:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": "cbs-news", "name": "CBS News" },
    "author": "CBS News",
    "title": "How the U.S. presidential election is viewed in Ukraine amid war with Russia",
    "description": "While Vice President Kamala Harris has pledged continued support for Ukraine, former President Donald Trump has previously praised Vladimir Putin's decision to invade. Trump now says if elected, he'd end the war. American weapons have helped hold the Russians…",
    "url": "https://www.cbsnews.com/video/how-the-u-s-presidential-election-is-viewed-in-ukraine-amid-war-with-russia/",
    "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/25/42a80895-8a7b-4a33-bf3f-46b5ce54aa82/thumbnail/1200x630/92926df53e7b8e57c723a36046f71df6/1025-cmo-ukraine.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280",
    "publishedAt": "2024-10-25T13:37:00Z",
    "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "Victor Davis Hanson",
    "title": "Kamala’s Inane Talking Points",
    "description": "As Vice President Kamala Harris slips in the polls, the Democratic National Committee/Harris campaign/mainstream media fusion talking points become even more absurd. Claiming that JD... Read More\nThe post Kamala’s Inane Talking Points appeared first on The Da…",
    "url": "https://www.dailysignal.com/2024/10/25/kamalas-inane-talking-points/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/Kamala-Pointing-scaled.jpg",
    "publishedAt": "2024-10-25T20:40:18Z",
    "content": "As Vice President Kamala Harris slips in the polls, the Democratic National Committee/Harris campaign/mainstream media fusion talking points become even more absurd.\r\nClaiming that JD Vance and Donal… [+5109 chars]"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "David Harsanyi",
    "title": "Harris Is the Bigger Threat to the Constitutional Order",
    "description": "Vote. Don’t vote. I don’t care. Just stop telling me that Vice President Kamala Harris is going to save democracy. Do I wish Republicans had... Read More\nThe post Harris Is the Bigger Threat to the Constitutional Order appeared first on The Daily Signal.",
    "url": "https://www.dailysignal.com/2024/10/25/harris-is-the-bigger-threat-to-the-constitutional-order/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/TrumpKamalaEdit.jpg",
    "publishedAt": "2024-10-25T22:42:26Z",
    "content": "Vote. Don’t vote. I don’t care. Just stop telling me that Vice President Kamala Harris is going to save democracy.\r\nDo I wish Republicans had nominated a more coherent, principled, competent candidat… [+4923 chars]"
  },
  {
    "source": { "id": null, "name": "Daily Signal" },
    "author": "Michael Barone",
    "title": "The Democratic Party’s Bad October",
    "description": "Was it just a coincidence that Vice President Kamala Harris showed up, 15 minutes late, to be interviewed by Fox News anchor Bret Baier a... Read More\nThe post The Democratic Party’s Bad October appeared first on The Daily Signal.",
    "url": "https://www.dailysignal.com/2024/10/25/the-democratic-partys-bad-october/",
    "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/10/WalzHarrisEdited.jpg",
    "publishedAt": "2024-10-25T23:13:15Z",
    "content": "Was it just a coincidence that Vice President Kamala Harris showed up, 15 minutes late, to be interviewed by Fox News anchor Bret Baier a day before Nate Silver’s poll aggregation website showed her … [+7355 chars]"
  },
  {
    "source": { "id": "abc-news-au", "name": "ABC News (AU)" },
    "author": "Jade Macmillan",
    "title": "The world stands at a crossroads. Our foreign correspondents predict where Trump or Harris could take us next",
    "description": "From war in the Middle East and Europe, to the geo-strategic complexities of our own region, America's election outcome will change the world. Our ABC correspondents break down what could follow either a Donald Trump or Kamala Harris victory.",
    "url": "https://www.abc.net.au/news/2024-10-26/trump-or-harris-will-soon-have-the-power-to-change-the-world/104498964",
    "urlToImage": "https://live-production.wcms.abc-cdn.net.au/342033e7bd0a5599327230af948fd47e?impolicy=wcms_watermark_news&cropH=1802&cropW=3203&xPos=322&yPos=129&width=862&height=485&imformat=generic",
    "publishedAt": "2024-10-25T19:12:45Z",
    "content": "When the US election results start pouring in from around the country on November 5, it won't just be Americans holding their breath.\r\nThe world will be watching.\r\nOpinion polls suggest the contest b… [+16157 chars]"
  },
  {
    "source": { "id": "msnbc", "name": "MSNBC" },
    "author": "Ari Melber and Allison Detzel",
    "title": "Kamala Harris' star-studded endorsements clearly have Donald Trump bothered",
    "description": "Ari Melber explains the cultural and political impact of Beyoncé personally campaigning for Harris in an effort to defeat Trump",
    "url": "https://www.msnbc.com/top-stories/latest/beyonce-harris-rally-texas-endorsement-trump-houston-rcna177281",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-07/240731-2x1-ari-melber-beyonce-ew-637p-3e539d.jpg",
    "publishedAt": "2024-10-25T18:26:15Z",
    "content": "This is an adapted excerpt from the Oct. 24 episode of \"The Beat with Ari Melber.\"\r\nPresidential campaigns try to reach voters any way they can: rallies and news interviews for the faithful or ads, d… [+3368 chars]"
  },
  {
    "source": { "id": "msnbc", "name": "MSNBC" },
    "author": "Jordan Rubin",
    "title": "Ask Jordan: How could the election affect Trump's criminal cases?",
    "description": "Donald Trump's federal criminal cases will likely go away if he's elected president, but if Kamala Harris wins, there are a number of possibilities.",
    "url": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-criminal-cases-election-ask-jordan-rcna177256",
    "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/240503-ask-jordan-rubin-deadline-legal-msnbc-cs-30278b.jpg",
    "publishedAt": "2024-10-25T19:42:05Z",
    "content": "If Trump doesnt get elected but refuses to concede again, how soon may we see his sentencing for his first convictions while its being contested, and will his other criminal cases finally move forwar… [+2241 chars]"
  },
  {
    "source": { "id": null, "name": "Thenation.com" },
    "author": "The Fall 2024 Nation Interns",
    "title": "Kamala Harris Does Not Deserve the Endorsement of “The Nation”",
    "description": "The Fall 2024 Nation Interns\n\n\n\nThe Biden administration’s action, and inaction, in Gaza—and her support for those policies—should have been enough to disqualify her.\r\n\n\r\n\n\nThe post Kamala Harris Does Not Deserve the Endorsement of “The Nation” appeared first…",
    "url": "https://www.thenation.com/?post_type=article&#038;p=525934",
    "urlToImage": "https://www.thenation.com/wp-content/uploads/2024/10/harris-netanyahu-handshake-getty.jpg",
    "publishedAt": "2024-10-25T09:00:00Z",
    "content": "Activism / October 25, 2024\r\nKamala Harris Does Not Deserve The Nations Endorsement\r\nThe Biden administrations action, and inaction, in Gazaand her support for those policiesshould have been enough t… [+12826 chars]"
  },
  {
    "source": { "id": null, "name": "Ra.co" },
    "author": "Hattie Lindert",
    "title": "This week's top stories: Assyouti stabbed, Sama' Abdulhadi addresses Kamala Harris, Primavera lineup",
    "description": "We round up five key announcements from the week, in bite-size format.",
    "url": "https://ra.co/news/81530",
    "urlToImage": "https://static.ra.co/images/news/2024/topstories2topstoriesipd.jpg",
    "publishedAt": "2024-10-25T08:00:00Z",
    "content": "<ul><li>\r\n</li><li>We round up five key announcements from the week, in bite-size format.</li><li></li><li>Welcome to our weekly news round-up. Every Friday, we'll share five key stories from the pas… [+1800 chars]"
  },
  {
    "source": { "id": null, "name": "NPR" },
    "author": "Kirk Siegler",
    "title": "Interior Secretary Deb Haaland wins praise for her work in Biden administration",
    "description": "America’s first indigenous Cabinet secretary wins praise for managing a domestic energy boom and work on Native American public safety issues. Would she be part of a Kamala Harris administration?",
    "url": "https://www.npr.org/2024/10/25/nx-s1-5123678/interior-secretary-deb-haaland-wins-praise-for-her-work-in-biden-administration",
    "urlToImage": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "publishedAt": "2024-10-25T08:27:57Z",
    "content": "Americas first indigenous Cabinet secretary wins praise for managing a domestic energy boom and work on Native American public safety issues. Would she be part of a Kamala Harris administration?"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Wendell Husebø, Wendell Husebø",
    "title": "Washington Post Snubs Kamala Harris with Non-Endorsement",
    "description": "The Washington Post will not endorse Vice President Kamala Harris for president, according to the paper's editorial board on Friday.\nThe post Washington Post Snubs Kamala Harris with Non-Endorsement  appeared first on Breitbart.",
    "url": "https://www.breitbart.com/politics/2024/10/25/washington-post-snubs-kamala-harris-non-endorsement/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/Kamala-Harris-closeup-fright-ap-640x335.jpg",
    "publishedAt": "2024-10-25T16:58:31Z",
    "content": "The Washington Post will not endorse Vice President Kamala Harris for president, according to the paper’s editorial board on Friday.\r\nIt will be the first time in 36 years that the paper has not endo… [+2587 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "David Ng, David Ng",
    "title": "Kamala Harris Bails on Joe Rogan Due to 'Scheduling'",
    "description": "Democrat presidential candidate Kamala Harris has bailed on her plan to sit down with Joe Rogan, with a campaign aide blaming \"scheduling\" for the cancellation.\nThe post Kamala Harris Bails on Joe Rogan Due to ‘Scheduling’ appeared first on Breitbart.",
    "url": "https://www.breitbart.com/entertainment/2024/10/25/kamala-harris-bails-on-joe-rogan-due-to-scheduling/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/kamalaharrisrogan-640x335.jpg",
    "publishedAt": "2024-10-25T15:14:49Z",
    "content": "Democrat presidential candidate Kamala Harris has bailed on her plan to sit down with Joe Rogan, with a campaign aide blaming “scheduling” for the cancellation.\r\nHer decision to cancel comes amid wid… [+1180 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Thomas D. Williams, Ph.D., Thomas D. Williams, Ph.D.",
    "title": "Donald Trump Slams Kamala Harris for ‘Persecution of the Catholic Church’",
    "description": "Donald Trump declared Friday that Kamala Harris has “lost the Catholic vote,” noting her dismal polling numbers among Catholics, a demographic that acts as a reliable bellwether of the election results.\nThe post Donald Trump Slams Kamala Harris for ‘Persecuti…",
    "url": "https://www.breitbart.com/2024-election/2024/10/25/donald-trump-slams-kamala-harris-for-persecution-of-the-catholic-church/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/kamala-harris-in-church-640x335.jpg",
    "publishedAt": "2024-10-25T15:19:27Z",
    "content": "Donald Trump declared Friday that Kamala Harris has lost the Catholic vote, noting her dismal polling numbers among Catholics, a demographic that acts as a reliable bellwether of the election results… [+1807 chars]"
  },
  {
    "source": { "id": "breitbart-news", "name": "Breitbart News" },
    "author": "Paul Bois, Paul Bois",
    "title": "Springsteen, Tyler Perry, Spike Lee, Samuel L. Jackson Outshine Kamala at Atlanta Rally",
    "description": "Hollywood celebrity A-listers from Bruce Springsteen to Samuel L. Jackson to Spike Lee to Tyler Perry headlined a rally in support of Kamala Harris in Atlanta, Georgia, on Thursday.\nThe post Springsteen, Tyler Perry, Spike Lee, Samuel L. Jackson Outshine Kama…",
    "url": "https://www.breitbart.com/entertainment/2024/10/24/springsteen-tyler-perry-spike-lee-samuel-l-jackson-outshine-kamala-at-atlanta-rally/",
    "urlToImage": "https://media.breitbart.com/media/2024/10/Springsteenperryspikejackson-640x335.jpg",
    "publishedAt": "2024-10-25T01:19:44Z",
    "content": "Hollywood celebrity A-listers from Bruce Springsteen to Samuel L. Jackson to Spike Lee to Tyler Perry headlined a rally in support of Kamala Harris in Atlanta, Georgia, on Thursday.\r\nMarvel actor Sam… [+1940 chars]"
  }
]
